{"subject": "PHYS101", "question": "Show that for a liquid in stream line motion $P + \\rho gh + \\frac{1}{2}\\rho v^2 = \\text{constant}$. The symbols have their usual meanings.", "marks": 2.5, "exam_mode_answer": "Consider a liquid in streamline motion. Here, we take a small cylindrical fluid element of cross-sectional area *dA* and length *ds* along a streamline.\n\nWe know, the forces acting on it are pressure force and gravitational force. Applying Newton's 2nd law along the streamline,\n\\[ P\\,dA - (P+dP)dA - \\rho g\\,dA\\,ds \\sin\\theta = \\rho\\,dA\\,ds\\,a \\]\nwhere \\(\\sin\\theta = dh/ds\\) and acceleration \\(a = v\\,dv/ds\\).\n\nSubstituting and simplifying,\n\\[ -dP - \\rho g\\,dh = \\rho v\\,dv \\]\nIntegrating,\n\\[ \\int -dP - \\rho g \\int dh - \\rho \\int v\\,dv = 0 \\]\n\\[ P + \\rho gh + \\frac{1}{2}\\rho v^2 = \\text{constant} \\]\n\nHence, Bernoulli's equation is proved.", "exam_f_question": "Derive the expression for the speed of efflux of a liquid from a small hole at a depth *h* below the free surface of the liquid in a large tank, using Bernoulli's equation. State the assumptions made.", "guided_mode_answer": "Let's understand Bernoulli's equation, which describes how a fluid's speed, pressure, and height are related when it's flowing smoothly.\n\n**1. The Core Idea: Energy Conservation for Fluids**\nImagine a river flowing downhill. As it goes faster (gains kinetic energy), the pressure in the water drops. Conversely, in a wide, slow-moving section, the water pressure is higher. Bernoulli's principle captures this trade-off. It states that for an ideal fluid in steady, streamline flow, the total mechanical energy per unit volume remains constant along any streamline. This energy is made up of three parts:\n*   **Pressure Energy (P):** The work the fluid can do by virtue of its pressure.\n*   **Potential Energy (ρgh):** The energy due to its height in a gravitational field.\n*   **Kinetic Energy (½ρv²):** The energy due to its motion.\n\n**2. Setting Up the Thought Experiment**\nWe prove this by analyzing a tiny \"packet\" or element of the fluid. Consider a small, cylindrical fluid element moving along a streamline.\n*   It has a cross-sectional area *dA* and a small length *ds* along the flow direction.\n*   Its front and back faces are at pressures *P* and *P+dP* respectively (pressure can change).\n*   The change in height of the element over distance *ds* is *dh*.\n\n**3. Applying Newton's Second Law (F=ma)**\nThe net force on this fluid element along the streamline causes it to accelerate. Let's find this net force:\n*   **Force from behind (at P):** = Pressure × Area = *P * dA* (pushes it forward).\n*   **Force from ahead (at P+dP):** = *(P + dP) * dA* (pushes it backward).\n*   **Weight component along the streamline:** The element's weight is (mass×g) = (ρ * dA * ds) * g. The component of this weight opposing the motion is (ρ g dA ds) * sinθ, where sinθ = dh/ds (the slope).\n\nSo, the **Net Forward Force** = Force from behind - Force from ahead - Weight component.\n\\[\n\\text{Net Force} = P\\,dA - (P+dP)dA - \\rho g \\,dA \\,ds \\left(\\frac{dh}{ds}\\right)\n\\]\n\\[\n\\text{Net Force} = -dP\\,dA - \\rho g \\,dA \\,dh\n\\]\n\nThis net force equals the mass of the element times its acceleration (a).\nMass = Density × Volume = *ρ dA ds*\nAcceleration *a* can be written using calculus as *v (dv/ds)* (the rate of change of velocity with distance).\nSo, **F = ma** becomes:\n\\[\n(-dP\\,dA - \\rho g \\,dA \\,dh) = (\\rho \\,dA \\,ds) \\times \\left(v \\frac{dv}{ds}\\right)\n\\]\n\n**4. Simplifying and Integrating**\nNotice *dA* cancels out from all terms. Also, *ds* on the right cancels, leaving:\n\\[\n-dP - \\rho g \\,dh = \\rho v \\,dv\n\\]\nThis is the differential form of Bernoulli's equation. To get the familiar form, we integrate this expression along a streamline, assuming constant density (ρ):\n\\[\n\\int -dP - \\rho g \\int dh = \\rho \\int v \\,dv\n\\]\n\\[\n-P - \\rho g h = \\rho \\frac{v^2}{2} + \\text{constant}\n\\]\nMultiplying by -1 and moving the constant, we get:\n\\[\nP + \\rho g h + \\frac{1}{2}\\rho v^2 = \\text{constant}\n\\]\nThis constant is the total mechanical energy per unit volume, which is conserved along a streamline for our ideal fluid.", "guided_f_question": "1. In your own words, describe the energy trade-off described by Bernoulli's equation. For example, if the speed of a fluid increases, what must happen to its pressure or height, assuming the total energy is constant?\n2. What are the three key assumptions about the fluid and its flow that were necessary to derive Bernoulli's equation in this proof?\n3. In the step where we wrote acceleration as *v (dv/ds)*, explain why this is a correct way to represent acceleration along the streamline.", "keywords": ["Bernoulli's equation", "Streamline flow", "Pressure energy", "Conservation of energy", "Ideal fluid"]}
{"subject": "PHYS101", "question": "State and prove the parallel axes theorem of moment of inertia. Find the moment of inertia of a circular disc of radius R and mass M about its diameter.", "marks": 5, "exam_mode_answer": "**State and Prove Parallel Axes Theorem:**\nThe theorem states that the moment of inertia (I) of a body about any axis is equal to the sum of its moment of inertia about a parallel axis through its center of mass (I_cm) and the product of its mass (M) and the square of the perpendicular distance (d) between the two axes.\n\\[ I = I_{cm} + Md^2 \\]\n\n**Proof:** Consider a body of mass M. Let I_cm be its M.I. about an axis through its CM. For a mass element dm at a perpendicular distance r from the CM axis, its M.I. about a parallel axis at distance d is (r + d)^2 dm. Integrating over the body:\n\\[ I = \\int (r + d)^2 dm = \\int (r^2 + d^2 + 2rd) dm \\]\n\\[ = \\int r^2 dm + d^2 \\int dm + 2d \\int r dm \\]\nHere, ∫ r^2 dm = I_cm, ∫ dm = M, and ∫ r dm = 0 (as r is measured from CM). Substituting, we get:\n\\[ I = I_{cm} + Md^2 \\]\nHence, proved.\n\n**M.I. of a circular disc about its diameter:**\nHere, its given that, mass = M, radius = R.\nWe know, M.I. of disc about an axis perpendicular through its center is \\( I_z = \\frac{1}{2}MR^2 \\).\nBy perpendicular axes theorem, for a lamina, \\( I_z = I_x + I_y \\), where I_x and I_y are M.I. about two perpendicular diameters.\nFor symmetry, \\( I_x = I_y \\).\nNow, substituting, \\( \\frac{1}{2}MR^2 = I_x + I_x \\)\n\\[ \\Rightarrow 2I_x = \\frac{1}{2}MR^2 \\]\n\\[ \\Rightarrow I_x = \\frac{1}{4}MR^2 \\]\nHence, the moment of inertia about its diameter is \\( \\frac{MR^2}{4} \\).", "exam_f_question": "Using the perpendicular axes theorem, find the moment of inertia of a thin uniform ring of mass M and radius R about its diameter. (5 marks)", "guided_mode_answer": "Let's understand the Parallel Axes Theorem intuitively. Imagine you have a heavy book. Spinning it around an axis through its center (like flipping pages) is relatively easy. Now, try spinning it around an axis parallel to the first one but passing through its edge—it feels much harder to start or stop the spin. This \"hardness\" is the moment of inertia. The theorem gives a mathematical way to connect these two values. The extra difficulty comes from the mass now being distributed farther, on average, from the new axis. The term **Md²** precisely accounts for this: it's as if all the mass M were concentrated at the center of mass, a distance **d** away from the new axis.\n\nNow, for the proof. Consider a rigid body. We take two parallel axes: one through the Center of Mass (CM) and another one at a perpendicular distance **d** from it.\n1.  For a tiny mass element **dm** in the body, its distance from the CM axis is **r**.\n2.  Its distance from the new parallel axis is, by geometry, **(r + d)**. Remember, **d** is constant for all mass elements for these two specific axes.\n3.  The moment of inertia (I) about the new axis is the sum (integral) of **(dm * (distance from axis)²)** for all mass elements.\n    So, I = ∫ (r + d)² dm\n4.  Expand the square: (r + d)² = r² + d² + 2rd.\n    Therefore, I = ∫ (r² + d² + 2rd) dm\n5.  We can split this integral: I = ∫ r² dm + ∫ d² dm + ∫ 2rd dm\n6.  Let's interpret each term:\n    *   ∫ r² dm: This is the definition of the moment of inertia about the CM axis, **I_cm**.\n    *   ∫ d² dm: Here, **d²** is a constant (same for all dm). So ∫ d² dm = d² ∫ dm = **Md²**, where M is the total mass.\n    *   ∫ 2rd dm = 2d ∫ r dm: This term is crucial. The quantity ∫ r dm defines the position of the center of mass relative to the axis from which **r** is measured. Since we measured **r** *from the CM itself*, ∫ r dm is **zero by definition of the center of mass**.\n7.  Substituting these results: I = I_cm + Md² + 0.\n    **Hence, I = I_cm + Md².** This is the Parallel Axes Theorem.\n\n**Finding M.I. of a disc about its diameter:**\nWe know the M.I. of a disc about an axis perpendicular to its plane and through its center is **I_z = (1/2)MR²**.\nThe **Perpendicular Axes Theorem** (for a lamina/2D object) states: I_z = I_x + I_y, where x and y are two perpendicular in-plane axes through the same point.\nFor a circular disc, any diameter is a symmetry axis. So, the M.I. about any diameter (say, I_x) is the same as about any other perpendicular diameter (I_y). Therefore, I_x = I_y.\nApplying the theorem: I_z = I_x + I_y = I_x + I_x = 2I_x.\nSo, (1/2)MR² = 2I_x.\nThus, I_x (M.I. about a diameter) = **(1/4)MR²**.", "guided_f_question": "1.  If the moment of inertia of a rod about its center is (ML²)/12, what would be its moment of inertia about one of its ends? Use the parallel axes theorem and explain what the distance 'd' represents in this case.\n2.  In the proof of the parallel axes theorem, why does the term ∫ 2rd dm become zero? What key property of the center of mass does this rely on?\n3.  We used the perpendicular axes theorem (I_z = I_x + I_y) to find the disc's M.I. about a diameter. Why can't we use the parallel axes theorem directly for this calculation? What information would we be missing?", "keywords": ["Moment of Inertia", "Parallel Axes Theorem", "Center of Mass", "Perpendicular Axes Theorem"]}
{"subject": "PHYS101", "question": "Derive Newton's second law for system of variable mass.", "marks": 2.5, "exam_mode_answer": "Here, its given that a system of mass \\( m(t) \\) moves with velocity \\( \\vec{v} \\). At time \\( t \\), a small mass element \\( dm \\) is added to the system with relative velocity \\( \\vec{u} \\).  \nWe know, Newton's second law for a system is \\( \\vec{F}_{\\text{ext}} = \\frac{d\\vec{P}}{dt} \\), where \\( \\vec{P} \\) is total momentum.  \nNow, by the definition, at time \\( t \\), \\( \\vec{P}(t) = m\\vec{v} \\). At time \\( t+dt \\), the new mass is \\( m+dm \\) and its velocity is \\( \\vec{v}+d\\vec{v} \\). The added mass \\( dm \\) originally had velocity \\( \\vec{v} + \\vec{u} \\).  \nThen, \\( \\vec{P}(t+dt) = (m+dm)(\\vec{v}+d\\vec{v}) - dm(\\vec{v}+\\vec{u}) \\), subtracting because \\( dm \\) came from outside.  \nSubstituting, \\( d\\vec{P} = \\vec{P}(t+dt) - \\vec{P}(t) = m d\\vec{v} - dm \\, \\vec{u} \\).  \nWe get \\( \\vec{F}_{\\text{ext}} = \\frac{d\\vec{P}}{dt} = m\\frac{d\\vec{v}}{dt} - \\vec{u}\\frac{dm}{dt} \\).  \nHence, \\( m\\frac{d\\vec{v}}{dt} = \\vec{F}_{\\text{ext}} + \\vec{u}\\frac{dm}{dt} \\), where \\( \\vec{u}\\frac{dm}{dt} \\) is the thrust force.", "exam_f_question": "A rocket in deep space (no external forces) ejects fuel backwards at a constant relative speed \\( u \\). If the initial mass of the rocket (including fuel) is \\( M_0 \\) and the mass of the empty rocket is \\( M_f \\), derive an expression for the final speed \\( v_f \\) of the rocket after all fuel is expended.", "guided_mode_answer": "Let's break down the derivation of Newton's second law for a variable mass system, like a rocket.\n\n**1. The Core Idea:**\nNewton's second law, \\( \\vec{F}_{ext} = \\frac{d\\vec{P}}{dt} \\), is always true for a *closed system* (a system with constant mass). For a system like a rocket, which is losing mass (fuel), we must carefully define our system at each instant to apply this law correctly.\n\n**2. Choosing the System:**\nWe consider the system at time \\( t \\) to be the main body of mass \\( m(t) \\). In a tiny time interval \\( dt \\), a small mass element \\( dm \\) is ejected. To use the momentum principle, we track a *closed system*: the main body at time \\( t \\) **plus** the element \\( dm \\) that will be ejected by time \\( t+dt \\). This combined system has constant total mass.\n\n**3. Tracking Momentum:**\n*   At time \\( t \\): The main body has momentum \\( m\\vec{v} \\). The element \\( dm \\) is still part of it, so its velocity is also \\( \\vec{v} \\). Total momentum: \\( \\vec{P}(t) = m\\vec{v} \\).\n*   At time \\( t+dt \\): The main body's mass is now \\( m + dm \\) (note: \\( dm \\) is negative for a rocket) and its velocity is \\( \\vec{v} + d\\vec{v} \\). The ejected element \\( dm \\) now moves with velocity \\( \\vec{v} + \\vec{u} \\), where \\( \\vec{u} \\) is its velocity *relative to the main body*.\n*   Total momentum of our closed system is now: \\( \\vec{P}(t+dt) = (m + dm)(\\vec{v} + d\\vec{v}) + (dm)(\\vec{v} + \\vec{u}) \\).\n\n**4. Applying Newton's Law:**\nThe change in momentum is \\( d\\vec{P} = \\vec{P}(t+dt) - \\vec{P}(t) \\).\nSubstituting and simplifying (neglecting the second-order term \\( dm\\, d\\vec{v} \\)):\n\\( d\\vec{P} = m d\\vec{v} + \\vec{u} dm \\).\nNewton's second law states: \\( \\vec{F}_{ext} = \\frac{d\\vec{P}}{dt} = m\\frac{d\\vec{v}}{dt} + \\vec{u}\\frac{dm}{dt} \\).\n\n**5. The Final Form:**\nRearranging gives the common form:\n\\( m\\frac{d\\vec{v}}{dt} = \\vec{F}_{ext} - \\vec{u}\\frac{dm}{dt} \\).\nThe term \\( -\\vec{u}\\frac{dm}{dt} \\) is the **thrust force**. For a rocket (\\( dm/dt < 0 \\)), if \\( \\vec{u} \\) is opposite \\( \\vec{v} \\) (fuel ejected backwards), thrust is in the forward direction.", "guided_f_question": "1. In the derivation, why do we add the momentum of the ejected mass \\( dm \\) as \\( +(dm)(\\vec{v} + \\vec{u}) \\) at time \\( t+dt \\), instead of subtracting it as shown in the exam answer?\n2. The term \\( -\\vec{u}(dm/dt) \\) is called the thrust. For a rocket accelerating upwards, what must be the sign of \\( dm/dt \\) and the direction of \\( \\vec{u} \\) relative to \\( \\vec{v} \\) for this thrust to act upwards?\n3. If the external force \\( \\vec{F}_{ext} \\) is zero, the equation becomes \\( m\\, dv = -u\\, dm \\). What calculus operation would you perform on this equation to find the rocket's velocity as a function of its mass?", "keywords": ["Variable Mass System", "Momentum", "Thrust Force", "Relative Velocity", "Rocket Equation", "External Force"]}
{"subject": "PHYS101", "question": "Derive an expression for M. I. of solid sphere (i) about z axis (about diameter) (ii) about tangent.", "marks": 2.5, "exam_mode_answer": "Here, its given that,\nWe know, for a solid sphere, M.I. about its diameter is \\( I_{diameter} = \\frac{2}{5}MR^2 \\).\n\n(i) About z-axis (about diameter):\nConsider the sphere’s center at origin. By symmetry, M.I. about any diameter is same.\nUsing volume element \\( dm = \\rho dV \\) and \\( r^2 = x^2 + y^2 \\),\n\\( I_z = \\int (x^2 + y^2) dm \\).\nFor sphere, \\( I_z = \\frac{2}{5}MR^2 \\).\n\n(ii) About tangent:\nUsing parallel axis theorem,\n\\( I_{tangent} = I_{diameter} + Mh^2 \\), where \\( h = R \\).\nSubstituting,\n\\( I_{tangent} = \\frac{2}{5}MR^2 + MR^2 \\).\nHence,\n\\( I_{tangent} = \\frac{7}{5}MR^2 \\).", "exam_f_question": "A solid sphere of mass M and radius R has a moment of inertia of (2/5)MR² about an axis through its center. Using the parallel axis theorem, derive the moment of inertia of the same sphere about an axis that is tangent to its surface.", "guided_mode_answer": "Let's break down the concept of moment of inertia for a solid sphere.\n\n**Beginner Level: The \"Rotational Mass\"**\nImagine trying to spin a heavy object. The moment of inertia (M.I.) is like the \"rotational mass\"—it tells you how hard it is to change an object's spin. A larger M.I. means it's harder to start spinning or to stop it. For a solid sphere, if you spin it around an axis through its center (like a diameter), the mass is distributed close to the axis, making it relatively easy to spin. The formula (2/5)MR² captures this.\n\n**Intermediate Level: The Two-Part Derivation**\nThe exam answer shows the two standard methods:\n1.  **About the Center (Diameter):** This is the fundamental result. It's found by integrating (summing) tiny mass elements throughout the sphere's volume, weighted by the square of their distance from the axis. The symmetry of a sphere means this M.I. is the same for any axis through the center.\n2.  **About a Tangent:** Instead of re-doing a complex 3D integral, we use a clever shortcut: the **Parallel Axis Theorem**. This theorem states: The M.I. about any new axis is equal to the M.I. about a parallel axis through the center of mass **plus** the total mass (M) times the square of the distance (h) between the two axes. For a tangent, h = R. So, I_tangent = I_center + M(R)² = (2/5)MR² + MR² = (7/5)MR².\n\nThe key insight is moving from a direct calculation (integration) to using a powerful theorem (Parallel Axis) to solve related problems efficiently.", "guided_f_question": "1.  What does the variable 'R' represent in the moment of inertia formula (2/5)MR² for a solid sphere, and why is it squared?\n2.  The parallel axis theorem is used to find the M.I. about the tangent. What are the two specific pieces of information you must know to apply this theorem to *any* object?\n3.  If the mass of the sphere is doubled, how does its moment of inertia about a diameter change? What if only the radius is doubled?", "keywords": ["Moment of Inertia", "Solid Sphere", "Parallel Axis Theorem", "Center of Mass", "Integration", "Rotational Dynamics"]}
{"subject": "PHYS101", "question": "Find the center of mass of a homogeneous semicircular plate of radius R.", "marks": 2.5, "exam_mode_answer": "Here, its given that the plate is a homogeneous semicircle of radius R.  \nWe know for a full circle, the center of mass lies at the center.  \nNow, by the definition of center of mass in the y-direction for a symmetric object about the x-axis, we consider a semicircular plate lying above the x-axis.  \nWe take a thin strip parallel to the x-axis at a distance y from the origin, of width dy.  \nThe mass per unit area is constant, so dm = σ·2x·dy, where x = √(R² − y²).  \nThen, y_cm = (1/M) ∫ y dm, with limits y = 0 to y = R.  \nSubstituting dm and simplifying,  \ny_cm = [∫₀ᴿ y·2√(R² − y²) dy] / [∫₀ᴿ 2√(R² − y²) dy].  \nThe denominator is the area of the semicircle = πR²/2.  \nEvaluating the numerator using substitution u = R² − y² gives (2R³)/3.  \nWe get y_cm = [(2R³)/3] / (πR²/2) = (4R)/(3π).  \nHence, the center of mass is located at (0, 4R/(3π)) from the center of the full circle along the symmetry axis perpendicular to the base.", "exam_f_question": "A homogeneous semicircular plate of radius R has its center of mass located at (0, 4R/(3π)) from the geometric center of the corresponding full circle. Now, consider a homogeneous quarter-circular plate of radius R, lying in the first quadrant (x≥0, y≥0). Where is its center of mass located? (Hint: You will need to find both x_cm and y_cm).", "guided_mode_answer": "**Concept: Center of Mass of a Semicircular Plate**\n\n**Beginner Level:**\nImagine you have a flat, perfectly uniform semicircular piece of material, like a plastic lid cut in half. The \"center of mass\" is the single point where you could perfectly balance it on your fingertip. For a full circle, this point is right in the middle. For a semicircle, because there's more material towards the curved edge than the flat base, the balance point isn't at the geometric center—it's shifted upwards along the line of symmetry.\n\n**Intermediate Level:**\nWe find this point mathematically by averaging the position of every tiny bit of mass in the object. Because the plate is \"homogeneous\" (uniform density), mass is proportional to area. We use symmetry: place the flat base along the x-axis so the shape is symmetric about the y-axis. This means the center of mass's x-coordinate is 0. To find the y-coordinate (y_cm), we sum up (integrate) the contribution of each infinitesimal horizontal strip.\n*   Each strip has a length of 2x (where x = √(R² - y²) from the circle equation).\n*   Its area is (length * thickness) = 2√(R² - y²) dy.\n*   Its contribution to the average is its area multiplied by its height (y).\nThe center of mass y_cm is the sum of all these (y * area) contributions, divided by the total area of the semicircle (πR²/2). Performing this integration yields the famous result: **y_cm = (4R)/(3π)**.", "guided_f_question": "1.  **Setup & Symmetry:** The solution places the semicircle with its base along the x-axis. Why is this a convenient choice, and what does it immediately tell us about the x-coordinate of the center of mass?\n2.  **The Mass Element (dm):** The solution uses a thin horizontal strip to build the integral. Why is the length of this strip given as 2√(R² − y²), and how does this relate to the geometry of a circle?\n3.  **The Integral:** The numerator in the y_cm formula is ∫ y * dm = ∫₀ᴿ y * [2σ√(R² − y²)] dy. If we use the substitution u = R² − y², what does 'du' equal, and how do the limits of integration change from y (0 to R) to u?", "keywords": ["Center of Mass", "Homogeneous", "Semicircle", "Integration", "Symmetry", "Density"]}
{"subject": "PHYS101", "question": "Establish the differential equation of motion for a damped harmonic oscillator and obtain the expression for displacement.", "marks": 5, "exam_mode_answer": "Here, its given that the restoring force is proportional to displacement, \\(F_{restoring} = -kx\\), and the damping force is proportional to velocity, \\(F_{damping} = -b\\dot{x}\\).  \nWe know, by Newton's second law, \\(m\\ddot{x} = F_{restoring} + F_{damping}\\).  \nSubstituting the forces,  \n\\(m\\ddot{x} = -kx - b\\dot{x}\\).  \nThen, rearranging terms,  \n\\(m\\ddot{x} + b\\dot{x} + kx = 0\\).  \nThis is the differential equation of motion for a damped harmonic oscillator.  \n\nTo solve, we assume a solution of the form \\(x(t) = Ae^{\\alpha t}\\).  \nSubstituting into the equation gives the characteristic equation:  \n\\(m\\alpha^2 + b\\alpha + k = 0\\).  \nThe roots are \\(\\alpha = -\\frac{b}{2m} \\pm \\sqrt{\\left(\\frac{b}{2m}\\right)^2 - \\frac{k}{m}}\\).  \nDefining \\(\\gamma = \\frac{b}{2m}\\) and \\(\\omega_0 = \\sqrt{\\frac{k}{m}}\\), the roots become \\(\\alpha = -\\gamma \\pm \\sqrt{\\gamma^2 - \\omega_0^2}\\).  \n\nFor the underdamped case (\\(\\gamma < \\omega_0\\)), let \\(\\omega_d = \\sqrt{\\omega_0^2 - \\gamma^2}\\).  \nThe general solution is:  \n\\(x(t) = Ae^{-\\gamma t} \\cos(\\omega_d t + \\phi)\\),  \nwhere \\(A\\) and \\(\\phi\\) are constants determined from initial conditions.", "exam_f_question": "A damped harmonic oscillator with mass m = 0.5 kg has a spring constant k = 50 N/m and a damping constant b = 2 N·s/m.\na) Calculate the damping ratio (γ) and the natural frequency (ω₀).\nb) Determine whether the system is underdamped, critically damped, or overdamped.\nc) If underdamped, calculate the damped oscillation frequency (ω_d).", "guided_mode_answer": "**Beginner Explanation:**\nImagine a block attached to a spring on a table. If you pull and release it, it oscillates back and forth. This is a simple harmonic oscillator. Now, imagine the block is moving through a thick fluid like honey. The fluid resists its motion, slowing it down more and more with each swing. This is a *damped* harmonic oscillator. The \"damping\" is the force from the fluid, which depends on how fast the block is moving.\n\n**Intermediate Explanation:**\nA damped harmonic oscillator is a fundamental physics model for systems that oscillate but lose energy over time due to a resistive force. The motion is governed by three key forces:\n1.  **Inertia (mẍ):** The mass's tendency to keep moving.\n2.  **Restoring Force (-kx):** The spring's pull back toward equilibrium, proportional to displacement (x).\n3.  **Damping Force (-bẋ):** A velocity-dependent force opposing motion (e.g., friction, air resistance).\n\nNewton's second law combines these: **mẍ + bẋ + kx = 0**. This is the equation of motion. The solution's form depends on the strength of damping (b) relative to the spring's stiffness (k) and mass (m). The key parameter is the damping ratio, which compares damping (γ = b/2m) to the natural frequency (ω₀ = √(k/m)).\n*   **Underdamped (γ < ω₀):** The system oscillates with a decreasing amplitude, described by **x(t) = A e^{-γt} cos(ω_d t + φ)**.\n*   **Critically Damped (γ = ω₀):** Returns to equilibrium fastest without oscillating.\n*   **Overdamped (γ > ω₀):** Returns to equilibrium slowly without oscillating.", "guided_f_question": "1.  In the differential equation mẍ + bẋ + kx = 0, what physical quantity does each term (mẍ, bẋ, kx) represent, and what is the direction of the force associated with the bẋ and kx terms relative to the motion?\n2.  The solution for the underdamped case is x(t) = A e^{-γt} cos(ω_d t + φ). What does the term \"e^{-γt}\" tell us about the amplitude of oscillation over time? What do A and φ represent?\n3.  How would the graph of position vs. time (x vs. t) look qualitatively different for an underdamped oscillator compared to a critically damped one?", "keywords": ["Damped Harmonic Oscillator", "Differential Equation of Motion", "Damping Constant", "Natural Frequency", "Underdamped", "Characteristic Equation"]}
