{"subject": "PHYS101", "question": "Show that for a liquid in stream line motion $P + \\rho gh + \\frac{1}{2}\\rho v^2 = \\text{constant}$. The symbols have their usual meanings.", "marks": 2.5, "exam_mode_answer": "Consider a liquid in streamline motion. Here, we take a small cylindrical fluid element of cross-sectional area *dA* and length *ds* along a streamline.\n\nWe know, the forces acting on it are pressure force and gravitational force. Applying Newton's 2nd law along the streamline,\n\\[ P\\,dA - (P+dP)dA - \\rho g\\,dA\\,ds \\sin\\theta = \\rho\\,dA\\,ds\\,a \\]\nwhere \\(\\sin\\theta = dh/ds\\) and acceleration \\(a = v\\,dv/ds\\).\n\nSubstituting and simplifying,\n\\[ -dP - \\rho g\\,dh = \\rho v\\,dv \\]\nIntegrating,\n\\[ \\int -dP - \\rho g \\int dh - \\rho \\int v\\,dv = 0 \\]\n\\[ P + \\rho gh + \\frac{1}{2}\\rho v^2 = \\text{constant} \\]\n\nHence, Bernoulli's equation is proved.", "exam_f_question": "Derive the expression for the speed of efflux of a liquid from a small hole at a depth *h* below the free surface of the liquid in a large tank, using Bernoulli's equation. State the assumptions made.", "guided_mode_answer": "Let's understand Bernoulli's equation, which describes how a fluid's speed, pressure, and height are related when it's flowing smoothly.\n\n**1. The Core Idea: Energy Conservation for Fluids**\nImagine a river flowing downhill. As it goes faster (gains kinetic energy), the pressure in the water drops. Conversely, in a wide, slow-moving section, the water pressure is higher. Bernoulli's principle captures this trade-off. It states that for an ideal fluid in steady, streamline flow, the total mechanical energy per unit volume remains constant along any streamline. This energy is made up of three parts:\n*   **Pressure Energy (P):** The work the fluid can do by virtue of its pressure.\n*   **Potential Energy (ρgh):** The energy due to its height in a gravitational field.\n*   **Kinetic Energy (½ρv²):** The energy due to its motion.\n\n**2. Setting Up the Thought Experiment**\nWe prove this by analyzing a tiny \"packet\" or element of the fluid. Consider a small, cylindrical fluid element moving along a streamline.\n*   It has a cross-sectional area *dA* and a small length *ds* along the flow direction.\n*   Its front and back faces are at pressures *P* and *P+dP* respectively (pressure can change).\n*   The change in height of the element over distance *ds* is *dh*.\n\n**3. Applying Newton's Second Law (F=ma)**\nThe net force on this fluid element along the streamline causes it to accelerate. Let's find this net force:\n*   **Force from behind (at P):** = Pressure × Area = *P * dA* (pushes it forward).\n*   **Force from ahead (at P+dP):** = *(P + dP) * dA* (pushes it backward).\n*   **Weight component along the streamline:** The element's weight is (mass×g) = (ρ * dA * ds) * g. The component of this weight opposing the motion is (ρ g dA ds) * sinθ, where sinθ = dh/ds (the slope).\n\nSo, the **Net Forward Force** = Force from behind - Force from ahead - Weight component.\n\\[\n\\text{Net Force} = P\\,dA - (P+dP)dA - \\rho g \\,dA \\,ds \\left(\\frac{dh}{ds}\\right)\n\\]\n\\[\n\\text{Net Force} = -dP\\,dA - \\rho g \\,dA \\,dh\n\\]\n\nThis net force equals the mass of the element times its acceleration (a).\nMass = Density × Volume = *ρ dA ds*\nAcceleration *a* can be written using calculus as *v (dv/ds)* (the rate of change of velocity with distance).\nSo, **F = ma** becomes:\n\\[\n(-dP\\,dA - \\rho g \\,dA \\,dh) = (\\rho \\,dA \\,ds) \\times \\left(v \\frac{dv}{ds}\\right)\n\\]\n\n**4. Simplifying and Integrating**\nNotice *dA* cancels out from all terms. Also, *ds* on the right cancels, leaving:\n\\[\n-dP - \\rho g \\,dh = \\rho v \\,dv\n\\]\nThis is the differential form of Bernoulli's equation. To get the familiar form, we integrate this expression along a streamline, assuming constant density (ρ):\n\\[\n\\int -dP - \\rho g \\int dh = \\rho \\int v \\,dv\n\\]\n\\[\n-P - \\rho g h = \\rho \\frac{v^2}{2} + \\text{constant}\n\\]\nMultiplying by -1 and moving the constant, we get:\n\\[\nP + \\rho g h + \\frac{1}{2}\\rho v^2 = \\text{constant}\n\\]\nThis constant is the total mechanical energy per unit volume, which is conserved along a streamline for our ideal fluid.", "guided_f_question": "1. In your own words, describe the energy trade-off described by Bernoulli's equation. For example, if the speed of a fluid increases, what must happen to its pressure or height, assuming the total energy is constant?\n2. What are the three key assumptions about the fluid and its flow that were necessary to derive Bernoulli's equation in this proof?\n3. In the step where we wrote acceleration as *v (dv/ds)*, explain why this is a correct way to represent acceleration along the streamline.", "keywords": ["Bernoulli's equation", "Streamline flow", "Pressure energy", "Conservation of energy", "Ideal fluid"]}
{"subject": "PHYS101", "question": "State and prove the parallel axes theorem of moment of inertia. Find the moment of inertia of a circular disc of radius R and mass M about its diameter.", "marks": 5, "exam_mode_answer": "**State and Prove Parallel Axes Theorem:**\nThe theorem states that the moment of inertia (I) of a body about any axis is equal to the sum of its moment of inertia about a parallel axis through its center of mass (I_cm) and the product of its mass (M) and the square of the perpendicular distance (d) between the two axes.\n\\[ I = I_{cm} + Md^2 \\]\n\n**Proof:** Consider a body of mass M. Let I_cm be its M.I. about an axis through its CM. For a mass element dm at a perpendicular distance r from the CM axis, its M.I. about a parallel axis at distance d is (r + d)^2 dm. Integrating over the body:\n\\[ I = \\int (r + d)^2 dm = \\int (r^2 + d^2 + 2rd) dm \\]\n\\[ = \\int r^2 dm + d^2 \\int dm + 2d \\int r dm \\]\nHere, ∫ r^2 dm = I_cm, ∫ dm = M, and ∫ r dm = 0 (as r is measured from CM). Substituting, we get:\n\\[ I = I_{cm} + Md^2 \\]\nHence, proved.\n\n**M.I. of a circular disc about its diameter:**\nHere, its given that, mass = M, radius = R.\nWe know, M.I. of disc about an axis perpendicular through its center is \\( I_z = \\frac{1}{2}MR^2 \\).\nBy perpendicular axes theorem, for a lamina, \\( I_z = I_x + I_y \\), where I_x and I_y are M.I. about two perpendicular diameters.\nFor symmetry, \\( I_x = I_y \\).\nNow, substituting, \\( \\frac{1}{2}MR^2 = I_x + I_x \\)\n\\[ \\Rightarrow 2I_x = \\frac{1}{2}MR^2 \\]\n\\[ \\Rightarrow I_x = \\frac{1}{4}MR^2 \\]\nHence, the moment of inertia about its diameter is \\( \\frac{MR^2}{4} \\).", "exam_f_question": "Using the perpendicular axes theorem, find the moment of inertia of a thin uniform ring of mass M and radius R about its diameter. (5 marks)", "guided_mode_answer": "Let's understand the Parallel Axes Theorem intuitively. Imagine you have a heavy book. Spinning it around an axis through its center (like flipping pages) is relatively easy. Now, try spinning it around an axis parallel to the first one but passing through its edge—it feels much harder to start or stop the spin. This \"hardness\" is the moment of inertia. The theorem gives a mathematical way to connect these two values. The extra difficulty comes from the mass now being distributed farther, on average, from the new axis. The term **Md²** precisely accounts for this: it's as if all the mass M were concentrated at the center of mass, a distance **d** away from the new axis.\n\nNow, for the proof. Consider a rigid body. We take two parallel axes: one through the Center of Mass (CM) and another one at a perpendicular distance **d** from it.\n1.  For a tiny mass element **dm** in the body, its distance from the CM axis is **r**.\n2.  Its distance from the new parallel axis is, by geometry, **(r + d)**. Remember, **d** is constant for all mass elements for these two specific axes.\n3.  The moment of inertia (I) about the new axis is the sum (integral) of **(dm * (distance from axis)²)** for all mass elements.\n    So, I = ∫ (r + d)² dm\n4.  Expand the square: (r + d)² = r² + d² + 2rd.\n    Therefore, I = ∫ (r² + d² + 2rd) dm\n5.  We can split this integral: I = ∫ r² dm + ∫ d² dm + ∫ 2rd dm\n6.  Let's interpret each term:\n    *   ∫ r² dm: This is the definition of the moment of inertia about the CM axis, **I_cm**.\n    *   ∫ d² dm: Here, **d²** is a constant (same for all dm). So ∫ d² dm = d² ∫ dm = **Md²**, where M is the total mass.\n    *   ∫ 2rd dm = 2d ∫ r dm: This term is crucial. The quantity ∫ r dm defines the position of the center of mass relative to the axis from which **r** is measured. Since we measured **r** *from the CM itself*, ∫ r dm is **zero by definition of the center of mass**.\n7.  Substituting these results: I = I_cm + Md² + 0.\n    **Hence, I = I_cm + Md².** This is the Parallel Axes Theorem.\n\n**Finding M.I. of a disc about its diameter:**\nWe know the M.I. of a disc about an axis perpendicular to its plane and through its center is **I_z = (1/2)MR²**.\nThe **Perpendicular Axes Theorem** (for a lamina/2D object) states: I_z = I_x + I_y, where x and y are two perpendicular in-plane axes through the same point.\nFor a circular disc, any diameter is a symmetry axis. So, the M.I. about any diameter (say, I_x) is the same as about any other perpendicular diameter (I_y). Therefore, I_x = I_y.\nApplying the theorem: I_z = I_x + I_y = I_x + I_x = 2I_x.\nSo, (1/2)MR² = 2I_x.\nThus, I_x (M.I. about a diameter) = **(1/4)MR²**.", "guided_f_question": "1.  If the moment of inertia of a rod about its center is (ML²)/12, what would be its moment of inertia about one of its ends? Use the parallel axes theorem and explain what the distance 'd' represents in this case.\n2.  In the proof of the parallel axes theorem, why does the term ∫ 2rd dm become zero? What key property of the center of mass does this rely on?\n3.  We used the perpendicular axes theorem (I_z = I_x + I_y) to find the disc's M.I. about a diameter. Why can't we use the parallel axes theorem directly for this calculation? What information would we be missing?", "keywords": ["Moment of Inertia", "Parallel Axes Theorem", "Center of Mass", "Perpendicular Axes Theorem"]}
{"subject": "PHYS101", "question": "Derive Newton's second law for system of variable mass.", "marks": 2.5, "exam_mode_answer": "Here, its given that a system of mass \\( m(t) \\) moves with velocity \\( \\vec{v} \\). At time \\( t \\), a small mass element \\( dm \\) is added to the system with relative velocity \\( \\vec{u} \\).  \nWe know, Newton's second law for a system is \\( \\vec{F}_{\\text{ext}} = \\frac{d\\vec{P}}{dt} \\), where \\( \\vec{P} \\) is total momentum.  \nNow, by the definition, at time \\( t \\), \\( \\vec{P}(t) = m\\vec{v} \\). At time \\( t+dt \\), the new mass is \\( m+dm \\) and its velocity is \\( \\vec{v}+d\\vec{v} \\). The added mass \\( dm \\) originally had velocity \\( \\vec{v} + \\vec{u} \\).  \nThen, \\( \\vec{P}(t+dt) = (m+dm)(\\vec{v}+d\\vec{v}) - dm(\\vec{v}+\\vec{u}) \\), subtracting because \\( dm \\) came from outside.  \nSubstituting, \\( d\\vec{P} = \\vec{P}(t+dt) - \\vec{P}(t) = m d\\vec{v} - dm \\, \\vec{u} \\).  \nWe get \\( \\vec{F}_{\\text{ext}} = \\frac{d\\vec{P}}{dt} = m\\frac{d\\vec{v}}{dt} - \\vec{u}\\frac{dm}{dt} \\).  \nHence, \\( m\\frac{d\\vec{v}}{dt} = \\vec{F}_{\\text{ext}} + \\vec{u}\\frac{dm}{dt} \\), where \\( \\vec{u}\\frac{dm}{dt} \\) is the thrust force.", "exam_f_question": "A rocket in deep space (no external forces) ejects fuel backwards at a constant relative speed \\( u \\). If the initial mass of the rocket (including fuel) is \\( M_0 \\) and the mass of the empty rocket is \\( M_f \\), derive an expression for the final speed \\( v_f \\) of the rocket after all fuel is expended.", "guided_mode_answer": "Let's break down the derivation of Newton's second law for a variable mass system, like a rocket.\n\n**1. The Core Idea:**\nNewton's second law, \\( \\vec{F}_{ext} = \\frac{d\\vec{P}}{dt} \\), is always true for a *closed system* (a system with constant mass). For a system like a rocket, which is losing mass (fuel), we must carefully define our system at each instant to apply this law correctly.\n\n**2. Choosing the System:**\nWe consider the system at time \\( t \\) to be the main body of mass \\( m(t) \\). In a tiny time interval \\( dt \\), a small mass element \\( dm \\) is ejected. To use the momentum principle, we track a *closed system*: the main body at time \\( t \\) **plus** the element \\( dm \\) that will be ejected by time \\( t+dt \\). This combined system has constant total mass.\n\n**3. Tracking Momentum:**\n*   At time \\( t \\): The main body has momentum \\( m\\vec{v} \\). The element \\( dm \\) is still part of it, so its velocity is also \\( \\vec{v} \\). Total momentum: \\( \\vec{P}(t) = m\\vec{v} \\).\n*   At time \\( t+dt \\): The main body's mass is now \\( m + dm \\) (note: \\( dm \\) is negative for a rocket) and its velocity is \\( \\vec{v} + d\\vec{v} \\). The ejected element \\( dm \\) now moves with velocity \\( \\vec{v} + \\vec{u} \\), where \\( \\vec{u} \\) is its velocity *relative to the main body*.\n*   Total momentum of our closed system is now: \\( \\vec{P}(t+dt) = (m + dm)(\\vec{v} + d\\vec{v}) + (dm)(\\vec{v} + \\vec{u}) \\).\n\n**4. Applying Newton's Law:**\nThe change in momentum is \\( d\\vec{P} = \\vec{P}(t+dt) - \\vec{P}(t) \\).\nSubstituting and simplifying (neglecting the second-order term \\( dm\\, d\\vec{v} \\)):\n\\( d\\vec{P} = m d\\vec{v} + \\vec{u} dm \\).\nNewton's second law states: \\( \\vec{F}_{ext} = \\frac{d\\vec{P}}{dt} = m\\frac{d\\vec{v}}{dt} + \\vec{u}\\frac{dm}{dt} \\).\n\n**5. The Final Form:**\nRearranging gives the common form:\n\\( m\\frac{d\\vec{v}}{dt} = \\vec{F}_{ext} - \\vec{u}\\frac{dm}{dt} \\).\nThe term \\( -\\vec{u}\\frac{dm}{dt} \\) is the **thrust force**. For a rocket (\\( dm/dt < 0 \\)), if \\( \\vec{u} \\) is opposite \\( \\vec{v} \\) (fuel ejected backwards), thrust is in the forward direction.", "guided_f_question": "1. In the derivation, why do we add the momentum of the ejected mass \\( dm \\) as \\( +(dm)(\\vec{v} + \\vec{u}) \\) at time \\( t+dt \\), instead of subtracting it as shown in the exam answer?\n2. The term \\( -\\vec{u}(dm/dt) \\) is called the thrust. For a rocket accelerating upwards, what must be the sign of \\( dm/dt \\) and the direction of \\( \\vec{u} \\) relative to \\( \\vec{v} \\) for this thrust to act upwards?\n3. If the external force \\( \\vec{F}_{ext} \\) is zero, the equation becomes \\( m\\, dv = -u\\, dm \\). What calculus operation would you perform on this equation to find the rocket's velocity as a function of its mass?", "keywords": ["Variable Mass System", "Momentum", "Thrust Force", "Relative Velocity", "Rocket Equation", "External Force"]}
{"subject": "PHYS101", "question": "Derive an expression for M. I. of solid sphere (i) about z axis (about diameter) (ii) about tangent.", "marks": 2.5, "exam_mode_answer": "Here, its given that,\nWe know, for a solid sphere, M.I. about its diameter is \\( I_{diameter} = \\frac{2}{5}MR^2 \\).\n\n(i) About z-axis (about diameter):\nConsider the sphere’s center at origin. By symmetry, M.I. about any diameter is same.\nUsing volume element \\( dm = \\rho dV \\) and \\( r^2 = x^2 + y^2 \\),\n\\( I_z = \\int (x^2 + y^2) dm \\).\nFor sphere, \\( I_z = \\frac{2}{5}MR^2 \\).\n\n(ii) About tangent:\nUsing parallel axis theorem,\n\\( I_{tangent} = I_{diameter} + Mh^2 \\), where \\( h = R \\).\nSubstituting,\n\\( I_{tangent} = \\frac{2}{5}MR^2 + MR^2 \\).\nHence,\n\\( I_{tangent} = \\frac{7}{5}MR^2 \\).", "exam_f_question": "A solid sphere of mass M and radius R has a moment of inertia of (2/5)MR² about an axis through its center. Using the parallel axis theorem, derive the moment of inertia of the same sphere about an axis that is tangent to its surface.", "guided_mode_answer": "Let's break down the concept of moment of inertia for a solid sphere.\n\n**Beginner Level: The \"Rotational Mass\"**\nImagine trying to spin a heavy object. The moment of inertia (M.I.) is like the \"rotational mass\"—it tells you how hard it is to change an object's spin. A larger M.I. means it's harder to start spinning or to stop it. For a solid sphere, if you spin it around an axis through its center (like a diameter), the mass is distributed close to the axis, making it relatively easy to spin. The formula (2/5)MR² captures this.\n\n**Intermediate Level: The Two-Part Derivation**\nThe exam answer shows the two standard methods:\n1.  **About the Center (Diameter):** This is the fundamental result. It's found by integrating (summing) tiny mass elements throughout the sphere's volume, weighted by the square of their distance from the axis. The symmetry of a sphere means this M.I. is the same for any axis through the center.\n2.  **About a Tangent:** Instead of re-doing a complex 3D integral, we use a clever shortcut: the **Parallel Axis Theorem**. This theorem states: The M.I. about any new axis is equal to the M.I. about a parallel axis through the center of mass **plus** the total mass (M) times the square of the distance (h) between the two axes. For a tangent, h = R. So, I_tangent = I_center + M(R)² = (2/5)MR² + MR² = (7/5)MR².\n\nThe key insight is moving from a direct calculation (integration) to using a powerful theorem (Parallel Axis) to solve related problems efficiently.", "guided_f_question": "1.  What does the variable 'R' represent in the moment of inertia formula (2/5)MR² for a solid sphere, and why is it squared?\n2.  The parallel axis theorem is used to find the M.I. about the tangent. What are the two specific pieces of information you must know to apply this theorem to *any* object?\n3.  If the mass of the sphere is doubled, how does its moment of inertia about a diameter change? What if only the radius is doubled?", "keywords": ["Moment of Inertia", "Solid Sphere", "Parallel Axis Theorem", "Center of Mass", "Integration", "Rotational Dynamics"]}
{"subject": "PHYS101", "question": "Find the center of mass of a homogeneous semicircular plate of radius R.", "marks": 2.5, "exam_mode_answer": "Here, its given that the plate is a homogeneous semicircle of radius R.  \nWe know for a full circle, the center of mass lies at the center.  \nNow, by the definition of center of mass in the y-direction for a symmetric object about the x-axis, we consider a semicircular plate lying above the x-axis.  \nWe take a thin strip parallel to the x-axis at a distance y from the origin, of width dy.  \nThe mass per unit area is constant, so dm = σ·2x·dy, where x = √(R² − y²).  \nThen, y_cm = (1/M) ∫ y dm, with limits y = 0 to y = R.  \nSubstituting dm and simplifying,  \ny_cm = [∫₀ᴿ y·2√(R² − y²) dy] / [∫₀ᴿ 2√(R² − y²) dy].  \nThe denominator is the area of the semicircle = πR²/2.  \nEvaluating the numerator using substitution u = R² − y² gives (2R³)/3.  \nWe get y_cm = [(2R³)/3] / (πR²/2) = (4R)/(3π).  \nHence, the center of mass is located at (0, 4R/(3π)) from the center of the full circle along the symmetry axis perpendicular to the base.", "exam_f_question": "A homogeneous semicircular plate of radius R has its center of mass located at (0, 4R/(3π)) from the geometric center of the corresponding full circle. Now, consider a homogeneous quarter-circular plate of radius R, lying in the first quadrant (x≥0, y≥0). Where is its center of mass located? (Hint: You will need to find both x_cm and y_cm).", "guided_mode_answer": "**Concept: Center of Mass of a Semicircular Plate**\n\n**Beginner Level:**\nImagine you have a flat, perfectly uniform semicircular piece of material, like a plastic lid cut in half. The \"center of mass\" is the single point where you could perfectly balance it on your fingertip. For a full circle, this point is right in the middle. For a semicircle, because there's more material towards the curved edge than the flat base, the balance point isn't at the geometric center—it's shifted upwards along the line of symmetry.\n\n**Intermediate Level:**\nWe find this point mathematically by averaging the position of every tiny bit of mass in the object. Because the plate is \"homogeneous\" (uniform density), mass is proportional to area. We use symmetry: place the flat base along the x-axis so the shape is symmetric about the y-axis. This means the center of mass's x-coordinate is 0. To find the y-coordinate (y_cm), we sum up (integrate) the contribution of each infinitesimal horizontal strip.\n*   Each strip has a length of 2x (where x = √(R² - y²) from the circle equation).\n*   Its area is (length * thickness) = 2√(R² - y²) dy.\n*   Its contribution to the average is its area multiplied by its height (y).\nThe center of mass y_cm is the sum of all these (y * area) contributions, divided by the total area of the semicircle (πR²/2). Performing this integration yields the famous result: **y_cm = (4R)/(3π)**.", "guided_f_question": "1.  **Setup & Symmetry:** The solution places the semicircle with its base along the x-axis. Why is this a convenient choice, and what does it immediately tell us about the x-coordinate of the center of mass?\n2.  **The Mass Element (dm):** The solution uses a thin horizontal strip to build the integral. Why is the length of this strip given as 2√(R² − y²), and how does this relate to the geometry of a circle?\n3.  **The Integral:** The numerator in the y_cm formula is ∫ y * dm = ∫₀ᴿ y * [2σ√(R² − y²)] dy. If we use the substitution u = R² − y², what does 'du' equal, and how do the limits of integration change from y (0 to R) to u?", "keywords": ["Center of Mass", "Homogeneous", "Semicircle", "Integration", "Symmetry", "Density"]}
{"subject": "PHYS101", "question": "Establish the differential equation of motion for a damped harmonic oscillator and obtain the expression for displacement.", "marks": 5, "exam_mode_answer": "Here, its given that the restoring force is proportional to displacement, \\(F_{restoring} = -kx\\), and the damping force is proportional to velocity, \\(F_{damping} = -b\\dot{x}\\).  \nWe know, by Newton's second law, \\(m\\ddot{x} = F_{restoring} + F_{damping}\\).  \nSubstituting the forces,  \n\\(m\\ddot{x} = -kx - b\\dot{x}\\).  \nThen, rearranging terms,  \n\\(m\\ddot{x} + b\\dot{x} + kx = 0\\).  \nThis is the differential equation of motion for a damped harmonic oscillator.  \n\nTo solve, we assume a solution of the form \\(x(t) = Ae^{\\alpha t}\\).  \nSubstituting into the equation gives the characteristic equation:  \n\\(m\\alpha^2 + b\\alpha + k = 0\\).  \nThe roots are \\(\\alpha = -\\frac{b}{2m} \\pm \\sqrt{\\left(\\frac{b}{2m}\\right)^2 - \\frac{k}{m}}\\).  \nDefining \\(\\gamma = \\frac{b}{2m}\\) and \\(\\omega_0 = \\sqrt{\\frac{k}{m}}\\), the roots become \\(\\alpha = -\\gamma \\pm \\sqrt{\\gamma^2 - \\omega_0^2}\\).  \n\nFor the underdamped case (\\(\\gamma < \\omega_0\\)), let \\(\\omega_d = \\sqrt{\\omega_0^2 - \\gamma^2}\\).  \nThe general solution is:  \n\\(x(t) = Ae^{-\\gamma t} \\cos(\\omega_d t + \\phi)\\),  \nwhere \\(A\\) and \\(\\phi\\) are constants determined from initial conditions.", "exam_f_question": "A damped harmonic oscillator with mass m = 0.5 kg has a spring constant k = 50 N/m and a damping constant b = 2 N·s/m.\na) Calculate the damping ratio (γ) and the natural frequency (ω₀).\nb) Determine whether the system is underdamped, critically damped, or overdamped.\nc) If underdamped, calculate the damped oscillation frequency (ω_d).", "guided_mode_answer": "**Beginner Explanation:**\nImagine a block attached to a spring on a table. If you pull and release it, it oscillates back and forth. This is a simple harmonic oscillator. Now, imagine the block is moving through a thick fluid like honey. The fluid resists its motion, slowing it down more and more with each swing. This is a *damped* harmonic oscillator. The \"damping\" is the force from the fluid, which depends on how fast the block is moving.\n\n**Intermediate Explanation:**\nA damped harmonic oscillator is a fundamental physics model for systems that oscillate but lose energy over time due to a resistive force. The motion is governed by three key forces:\n1.  **Inertia (mẍ):** The mass's tendency to keep moving.\n2.  **Restoring Force (-kx):** The spring's pull back toward equilibrium, proportional to displacement (x).\n3.  **Damping Force (-bẋ):** A velocity-dependent force opposing motion (e.g., friction, air resistance).\n\nNewton's second law combines these: **mẍ + bẋ + kx = 0**. This is the equation of motion. The solution's form depends on the strength of damping (b) relative to the spring's stiffness (k) and mass (m). The key parameter is the damping ratio, which compares damping (γ = b/2m) to the natural frequency (ω₀ = √(k/m)).\n*   **Underdamped (γ < ω₀):** The system oscillates with a decreasing amplitude, described by **x(t) = A e^{-γt} cos(ω_d t + φ)**.\n*   **Critically Damped (γ = ω₀):** Returns to equilibrium fastest without oscillating.\n*   **Overdamped (γ > ω₀):** Returns to equilibrium slowly without oscillating.", "guided_f_question": "1.  In the differential equation mẍ + bẋ + kx = 0, what physical quantity does each term (mẍ, bẋ, kx) represent, and what is the direction of the force associated with the bẋ and kx terms relative to the motion?\n2.  The solution for the underdamped case is x(t) = A e^{-γt} cos(ω_d t + φ). What does the term \"e^{-γt}\" tell us about the amplitude of oscillation over time? What do A and φ represent?\n3.  How would the graph of position vs. time (x vs. t) look qualitatively different for an underdamped oscillator compared to a critically damped one?", "keywords": ["Damped Harmonic Oscillator", "Differential Equation of Motion", "Damping Constant", "Natural Frequency", "Underdamped", "Characteristic Equation"]}
{"subject": "PHYS101", "question": "Develop the Newton's second law of motion for system of a variable mass. Show that for a rocket system $M_{\\mathrm{f}} = M_{0} \\exp \\left[-\\nu_{\\mathrm{f}} / \\nu_{\\mathrm{rel}}\\right]$. Where the symbols have their usual meanings.", "marks": 5, "exam_mode_answer": "Here, its given that the rocket’s mass changes as fuel is expelled.  \nWe know Newton’s second law for a system of variable mass is  \n\\[\n\\frac{d}{dt}(m\\vec{v}) = \\vec{F}_{\\text{ext}} + \\vec{v}_{\\text{rel}} \\frac{dm}{dt},\n\\]  \nwhere \\(\\vec{v}_{\\text{rel}}\\) is the exhaust velocity relative to the rocket.  \n\nNow, by the definition, \\(\\vec{v}_{\\text{rel}} = \\vec{u} - \\vec{v}\\), with \\(\\vec{u}\\) the exhaust velocity in the ground frame. For motion in one dimension without external forces (\\(\\vec{F}_{\\text{ext}}=0\\)),  \n\\[\nm\\frac{dv}{dt} = -v_{\\text{rel}} \\frac{dm}{dt},\n\\]  \nsince \\(dm/dt < 0\\) for mass loss.  \n\nSubstituting \\(v_{\\text{rel}}\\) constant and rearranging:  \n\\[\ndv = -v_{\\text{rel}} \\frac{dm}{m}.\n\\]  \n\nIntegrating from initial mass \\(M_0\\) and velocity \\(0\\) to final mass \\(M_f\\) and final velocity \\(v_f\\):  \n\\[\n\\int_{0}^{v_f} dv = -v_{\\text{rel}} \\int_{M_0}^{M_f} \\frac{dm}{m}.\n\\]  \n\nThen,  \n\\[\nv_f = -v_{\\text{rel}} \\left[ \\ln m \\right]_{M_0}^{M_f} = v_{\\text{rel}} \\ln\\left( \\frac{M_0}{M_f} \\right).\n\\]  \n\nWe get  \n\\[\n\\frac{M_0}{M_f} = e^{v_f / v_{\\text{rel}}}.\n\\]  \n\nHence,  \n\\[\nM_f = M_0 \\exp\\left[ -\\frac{v_f}{v_{\\text{rel}}} \\right].\n\\]", "exam_f_question": "A rocket in deep space (no external forces) has an initial mass of 8000 kg, including fuel. Its engines expel exhaust gases at a constant relative speed of 2500 m/s. If the rocket needs to achieve a final velocity of 4000 m/s, use the rocket equation to calculate the final mass of the rocket (structure and remaining payload) after the burn.", "guided_mode_answer": "Let's break down the rocket problem step-by-step.\n\n**1. The Core Idea: A System with Changing Mass**\nNewton's Second Law (F=ma) is written for an object with constant mass. A rocket is different—its total mass decreases as it burns fuel. To analyze it, we must consider the *rocket plus its expelled fuel* as our complete, constant-mass system. The momentum change of this whole system gives us the correct equation.\n\n**2. The Rocket Equation Derivation (Conceptual)**\nImagine a rocket at time *t* with mass *m* and velocity *v*. In a tiny time *dt*, it expels a small amount of fuel *-dm* (note: *dm* is negative). This fuel is expelled backward with a speed *v_rel* relative to the rocket.\n*   Initial momentum (rocket + fuel about to be expelled): `m * v`\n*   Final momentum: Rocket (now `m + dm`) moves at `v + dv`. Expelled fuel (`-dm`) moves at `v - v_rel` in the ground frame.\n*   Change in momentum = Final - Initial. If there are no external forces (like in deep space), the total momentum must be conserved. Setting the change to zero and simplifying leads to:\n    `m dv = -v_rel dm`\n    This is the key differential equation. The rocket's acceleration (`dv`) depends on its instantaneous mass (`m`) and how fast it's losing mass (`dm`).\n\n**3. Solving for Velocity Gain**\nWe rearrange the equation: `dv = -v_rel (dm / m)`.\nTo find the total velocity change, we integrate from the start (mass `M0`, velocity `0`) to the end (mass `Mf`, velocity `vf`):\n`∫ dv = -v_rel ∫ (dm/m)`\nThis gives: `vf = v_rel * ln(M0 / Mf)`.\nThe `ln(M0 / Mf)` term is crucial—it shows the velocity gain depends on the *ratio* of initial to final mass, not the burn time or thrust. Doubling the fuel doesn't double the speed; it gives a logarithmic increase.\n\n**4. Rearranging to the Requested Form**\nThe question asks for `Mf`. Starting from `vf = v_rel * ln(M0 / Mf)`:\nDivide both sides by `v_rel`: `vf / v_rel = ln(M0 / Mf)`\nTake the exponential of both sides: `exp(vf / v_rel) = M0 / Mf`\nFinally, solve for `Mf`: `Mf = M0 / exp(vf / v_rel) = M0 * exp( -vf / v_rel )`\nThis is the Tsiolkovsky rocket equation. It tells us the final mass needed to reach a desired speed given a specific exhaust velocity.", "guided_f_question": "1.  In the derivation, we set the change in total momentum of the (rocket + expelled fuel) system to zero. What fundamental physical law justifies this step, and under what condition is it valid?\n2.  In the equation `m dv = -v_rel dm`, the right side has a negative sign. Explain in your own words: why is this negative sign physically necessary? What would it mean if it were positive?\n3.  The final velocity depends on `ln(M0/Mf)`. If a rocket's initial mass is 90% fuel, so `Mf = 0.1 M0`, what is the value of `ln(M0/Mf)`? If engineers want to double the velocity gain, by what factor must they increase the mass ratio `M0/Mf`?", "keywords": ["Variable Mass System", "Rocket Equation", "Tsiolkovsky Equation", "Exhaust Velocity", "Momentum Conservation", "Mass Ratio"]}
{"subject": "PHYS101", "question": "In Young's double slit experiment, two slits are 0.5 mm apart and the distance of screen from the slit is 1 m. It is observed that the fourth bright fringes is at a distance of 2.945 mm from the second dark fringes. Calculate the wavelength of light used.", "marks": 2.5, "exam_mode_answer": "Here, its given that,  \nSlit separation \\( d = 0.5 \\text{ mm} = 0.5 \\times 10^{-3} \\text{ m} \\),  \nDistance to screen \\( D = 1 \\text{ m} \\),  \nDistance between 4th bright fringe and 2nd dark fringe \\( = 2.945 \\text{ mm} = 2.945 \\times 10^{-3} \\text{ m} \\).  \n\nWe know,  \nPosition of \\( n^{\\text{th}} \\) bright fringe: \\( y_n = \\frac{n \\lambda D}{d} \\),  \nPosition of \\( m^{\\text{th}} \\) dark fringe: \\( y'_m = \\frac{(2m-1) \\lambda D}{2d} \\).  \n\nFor 4th bright fringe \\( n = 4 \\), for 2nd dark fringe \\( m = 2 \\):  \n\\[\ny_4 = \\frac{4 \\lambda D}{d}, \\quad y'_2 = \\frac{(2 \\times 2 - 1) \\lambda D}{2d} = \\frac{3 \\lambda D}{2d}.\n\\]  \n\nNow, by the definition,  \n\\[\ny_4 - y'_2 = 2.945 \\times 10^{-3}.\n\\]  \n\nSubstituting,  \n\\[\n\\frac{4 \\lambda D}{d} - \\frac{3 \\lambda D}{2d} = \\frac{(8 - 3) \\lambda D}{2d} = \\frac{5 \\lambda D}{2d} = 2.945 \\times 10^{-3}.\n\\]  \n\nThen,  \n\\[\n\\lambda = \\frac{2d \\times 2.945 \\times 10^{-3}}{5 D}.\n\\]  \n\nWe get,  \n\\[\n\\lambda = \\frac{2 \\times 0.5 \\times 10^{-3} \\times 2.945 \\times 10^{-3}}{5 \\times 1} = \\frac{2.945 \\times 10^{-6}}{5} = 5.89 \\times 10^{-7} \\text{ m}.\n\\]  \n\nHence, wavelength of light used is \\( 589 \\text{ nm} \\).", "exam_f_question": "In a Young's double slit experiment, the slit separation is 0.8 mm, and the screen is placed 1.5 m away. The distance between the 3rd dark fringe and the 5th bright fringe on the same side of the central maximum is measured to be 1.9125 mm. Calculate the wavelength of the light used.", "guided_mode_answer": "**Concept Explanation: Young's Double Slit Experiment**\n\n**Beginner Level:**\nImagine you have a barrier with two very close, parallel slits. When you shine a single-color light (like a laser) through them, the light waves spread out from each slit. On a screen behind the slits, instead of seeing just two bright lines, you see a pattern of many alternating bright and dark bands. This is called an **interference pattern**.\n\n*   **Why does this happen?** The light waves from the two slits meet on the screen. Sometimes they meet **in phase** (peaks align with peaks), which makes them add together to create a **bright fringe** (constructive interference). Other times they meet **out of phase** (a peak aligns with a trough), which makes them cancel each other out to create a **dark fringe** (destructive interference).\n\n**Intermediate Level:**\nThe positions of these fringes can be predicted mathematically. The key is the **path difference**—the difference in distance traveled by light from the two slits to a specific point on the screen.\n*   **Bright Fringes (Maxima):** Occur when the path difference is an integer multiple of the wavelength (λ).\n    *   Formula: Path Difference = \\( n \\lambda \\), where \\( n = 0, 1, 2,... \\) is the **order** of the fringe.\n    *   Position on screen: \\( y_{\\text{bright}} = \\frac{n \\lambda D}{d} \\)\n*   **Dark Fringes (Minima):** Occur when the path difference is a half-integer multiple of the wavelength.\n    *   Formula: Path Difference = \\( (m - \\frac{1}{2}) \\lambda \\), where \\( m = 1, 2, 3,... \\).\n    *   Position on screen: \\( y_{\\text{dark}} = \\frac{(2m - 1) \\lambda D}{2d} \\)\n\n**Where:**\n*   \\( y \\) = distance from the central bright fringe (n=0)\n*   \\( \\lambda \\) = wavelength of light (what we often solve for)\n*   \\( D \\) = distance from slits to screen\n*   \\( d \\) = separation between the two slits\n*   \\( n, m \\) = order numbers for bright and dark fringes, respectively.\n\nIn the given problem, you are told the *distance between a specific bright fringe and a specific dark fringe*. You use the formulas for their positions, subtract them, set it equal to the given distance, and solve for the unknown wavelength (λ).", "guided_f_question": "1.  In the formula for the position of the nth bright fringe, \\( y_n = \\frac{n \\lambda D}{d} \\), what does the variable 'n' represent physically? What would be the position if n=0?\n2.  For the 2nd dark fringe (m=2), the formula uses (2m-1) which equals 3. Does this mean the path difference is \\( 3\\lambda \\)? If not, what is the correct path difference for destructive interference?\n3.  In the final calculation step, we had \\( \\frac{5 \\lambda D}{2d} = 2.945 \\times 10^{-3} \\). If the distance 'D' to the screen were doubled to 2 m, and all other given values remained the same, would the calculated wavelength (λ) increase, decrease, or stay the same? Why?", "keywords": ["Interference", "Wavelength", "Constructive Interference", "Destructive Interference", "Fringe Separation", "Path Difference"]}
{"subject": "PHYS101", "question": "Derive the expressions for the energy and energy stored per unit volume in the stretched wire.", "marks": 2.5, "exam_mode_answer": "Here, its given that a wire of length L and cross-sectional area A is stretched by a force F through an extension l.  \nWe know, within elastic limit, by Hooke's law, \\( F = \\frac{YA}{L} l \\), where Y is Young’s modulus.  \nNow, by the definition of work done, the energy stored in stretching the wire is  \n\\( U = \\int_0^l F \\, dl = \\int_0^l \\frac{YA}{L} l \\, dl \\).  \nSubstituting and integrating,  \n\\( U = \\frac{YA}{L} \\cdot \\frac{l^2}{2} = \\frac{1}{2} \\cdot \\frac{YA l^2}{L} \\).  \nSimilarly, energy stored per unit volume is  \n\\( u = \\frac{U}{AL} \\).  \nThen, substituting U,  \n\\( u = \\frac{1}{2AL} \\cdot \\frac{YA l^2}{L} = \\frac{1}{2} Y \\left( \\frac{l}{L} \\right)^2 \\).  \nWe get \\( u = \\frac{1}{2} \\times \\text{stress} \\times \\text{strain} \\), since stress \\( = Y \\times \\text{strain} \\) and strain \\( = l/L \\).  \nHence, the energy stored is \\( U = \\frac{1}{2} \\frac{YA l^2}{L} \\) and energy per unit volume is \\( u = \\frac{1}{2} \\times \\text{stress} \\times \\text{strain} \\).", "exam_f_question": "A wire of length 2.0 m and cross-sectional area 1.0 x 10⁻⁶ m² is stretched by 1.0 mm. If the Young's modulus of the material is 2.0 x 10¹¹ N/m², calculate (a) the energy stored in the wire, and (b) the energy stored per unit volume.", "guided_mode_answer": "**Beginner Explanation:**\nImagine a rubber band. When you stretch it, you are doing work (using energy) to pull it apart. This energy isn't lost; it gets stored *inside* the stretched rubber band as elastic potential energy. If you let go, this stored energy is released, making the band snap back. A metal wire behaves similarly when stretched within its elastic limit (meaning it will return to its original length).\n\n**Intermediate Derivation:**\nWe start with Hooke's Law for a wire: The force *F* needed to stretch it is proportional to the extension *l*. The constant of proportionality involves the material's stiffness (Young's modulus, *Y*), its original length *L*, and its cross-sectional area *A*.\n\\[\nF = \\left( \\frac{YA}{L} \\right) l\n\\]\nThis shows the wire acts like a spring with spring constant \\( k = \\frac{YA}{L} \\).\n\n**1. Total Energy Stored (U):**\nThe work done by the stretching force is stored as energy. Since the force increases linearly with extension, we must integrate:\n\\[\nU = \\int_0^l F \\, dl = \\int_0^l \\frac{YA}{L} l \\, dl\n\\]\n\\[\nU = \\frac{YA}{L} \\left[ \\frac{l^2}{2} \\right]_0^l = \\frac{1}{2} \\left( \\frac{YA}{L} \\right) l^2\n\\]\n\n**2. Energy per Unit Volume (u):**\nTo find the energy density, we divide the total energy by the wire's original volume (A * L):\n\\[\nu = \\frac{U}{A L} = \\frac{1}{2AL} \\cdot \\frac{YA l^2}{L}\n\\]\n\\[\nu = \\frac{1}{2} Y \\left( \\frac{l}{L} \\right)^2\n\\]\nRecognizing that strain \\( \\epsilon = l/L \\) and stress \\( \\sigma = Y \\times \\epsilon \\), we get the important general formula:\n\\[\nu = \\frac{1}{2} \\times \\text{Stress} \\times \\text{Strain}\n\\]\nThis formula tells us that the energy is stored in the deformation itself, and it applies to any material within the elastic limit.", "guided_f_question": "1. In the derivation, we integrated the force \\( F \\) with respect to extension \\( l \\). Why can't we simply calculate work as \\( \\text{Force} \\times \\text{Distance} \\) (i.e., \\( F \\times l \\)) in this case?\n2. In the final expression for energy per unit volume \\( u = \\frac{1}{2} Y (l/L)^2 \\), identify which variable represents the material property, which represents the geometric property of the wire, and which represents the amount of deformation.\n3. The final formula \\( u = \\frac{1}{2} \\times \\text{Stress} \\times \\text{Strain} \\) is very general. If the stress-strain graph for a material is linear (Hookean) up to a certain point, what does the area under that graph represent physically?", "keywords": ["Young's Modulus", "Elastic Potential Energy", "Stress", "Strain", "Hooke's Law", "Energy Density"]}
{"subject": "PHYS101", "question": "Obtain an expression for Poiseuille's formula for fluid flow in capillary tube.", "marks": 5, "exam_mode_answer": "Here, its given that a viscous fluid flows steadily through a horizontal capillary tube of radius \\( R \\) and length \\( L \\) under a constant pressure difference \\( P \\).  \nWe know the viscous force on a cylindrical fluid shell of radius \\( r \\) and length \\( L \\) is \\( F_{\\text{viscous}} = \\eta (2\\pi r L) \\frac{dv}{dr} \\), where \\( \\eta \\) is the coefficient of viscosity.  \nNow, by the definition of steady flow, the viscous force balances the net driving force due to pressure on the shell. The driving force is \\( \\pi r^2 P \\).  \nEquating:  \n\\[\n\\pi r^2 P = - \\eta (2\\pi r L) \\frac{dv}{dr}\n\\]  \nThe negative sign appears because velocity decreases with increasing \\( r \\).  \nSubstituting and simplifying:  \n\\[\n\\frac{dv}{dr} = - \\frac{P r}{2\\eta L}\n\\]  \nIntegrating with respect to \\( r \\):  \n\\[\nv = - \\frac{P}{4\\eta L} r^2 + C\n\\]  \nApplying the no-slip boundary condition \\( v = 0 \\) at \\( r = R \\) gives \\( C = \\frac{P R^2}{4\\eta L} \\).  \nHence,  \n\\[\nv(r) = \\frac{P}{4\\eta L} (R^2 - r^2)\n\\]  \nThen, the volume flow rate \\( Q \\) is  \n\\[\nQ = \\int_0^R v(r) \\cdot 2\\pi r \\, dr = \\frac{\\pi P}{2\\eta L} \\int_0^R (R^2 r - r^3) dr\n\\]  \nWe get  \n\\[\nQ = \\frac{\\pi P}{2\\eta L} \\left[ \\frac{R^4}{2} - \\frac{R^4}{4} \\right] = \\frac{\\pi P R^4}{8\\eta L}\n\\]  \nThis is Poiseuille’s formula for laminar flow in a capillary tube.", "exam_f_question": "A capillary tube of length L and radius R is connected to a pressure head that maintains a constant pressure difference P across its ends. Derive the expression for the velocity profile v(r) of a viscous fluid flowing steadily through this tube. Clearly state all assumptions and boundary conditions used in your derivation.", "guided_mode_answer": "Poiseuille's Law describes how a thick, sticky (viscous) fluid like honey flows slowly through a thin, straight pipe. Imagine pushing the fluid from one end with a constant pressure. The fluid right in the center of the pipe moves the fastest. As you move outward towards the pipe wall, the fluid sticks to the wall and doesn't move at all, creating layers that slide over each other—this is called laminar flow.\n\nThe key idea is a balance of forces. Think of a thin, cylindrical shell of fluid inside the bigger pipe. The pressure difference from one end of this shell to the other tries to push it forward. However, the viscosity (internal stickiness) of the fluid creates a drag force on the sides of this shell, trying to slow it down. For a steady flow where the speed isn't changing, these two forces must be equal and opposite.\n\nBy setting up this force balance mathematically for a shell at a distance 'r' from the center, we get an equation. Solving this equation and applying the \"no-slip\" condition (fluid velocity is zero at the pipe wall) gives us a parabolic velocity profile: v(r) = (P/(4ηL)) * (R² - r²). This tells us the speed at any point 'r'.\n\nTo find the total flow rate (volume per second), we add up the flow through all these thin cylindrical shells from the center (r=0) to the wall (r=R) using integration. The final, famous result is Poiseuille's Law: Q = (π P R⁴) / (8 η L). This shows that the flow rate is incredibly sensitive to the tube's radius (R⁴!), and depends directly on the pressure difference (P) and inversely on the fluid's viscosity (η) and the tube's length (L).", "guided_f_question": "1. In the force balance equation, the viscous force formula used is F = η * (Area) * (velocity gradient). What does the \"velocity gradient\" (dv/dr) physically represent in the context of the fluid layers in the tube?\n2. During the integration step to find v(r), a constant of integration 'C' appears. How is the value of this constant determined, and what physical principle or condition does this step rely on?\n3. The final expression for flow rate Q shows it is proportional to R⁴. If the radius of the tube is doubled, by what factor does the volume flow rate increase? What does this tell you about the dominant factor controlling flow in such systems?", "keywords": ["Viscosity", "Laminar Flow", "Pressure Gradient", "No-Slip Condition", "Velocity Profile", "Volume Flow Rate"]}
{"subject": "PHYS101", "question": "In Young's double slit experiment, the slits are separated by 0.28 mm and the screen is 1.4 m away. The distance between the central bright fringe and the fourth bright fringe is 1.2 cm. Find the frequency of light used. Use the standard value of velocity of light.", "marks": 2.5, "exam_mode_answer": "Here, its given that,  \nSlit separation \\( d = 0.28 \\, \\text{mm} = 2.8 \\times 10^{-4} \\, \\text{m} \\),  \nDistance to screen \\( D = 1.4 \\, \\text{m} \\),  \nDistance from central to fourth bright fringe \\( y_4 = 1.2 \\, \\text{cm} = 1.2 \\times 10^{-2} \\, \\text{m} \\),  \nOrder \\( m = 4 \\) for bright fringe.  \n\nWe know, position of \\( m \\)-th bright fringe is  \n\\[\ny_m = \\frac{m \\lambda D}{d}.\n\\]  \nNow, by the definition of,  \n\\[\n\\lambda = \\frac{y_m d}{m D}.\n\\]  \nSubstituting,  \n\\[\n\\lambda = \\frac{(1.2 \\times 10^{-2}) \\times (2.8 \\times 10^{-4})}{4 \\times 1.4}\n= \\frac{3.36 \\times 10^{-6}}{5.6}\n= 6.0 \\times 10^{-7} \\, \\text{m}.\n\\]  \nSimilarly, velocity of light \\( c = 3 \\times 10^8 \\, \\text{m/s} \\).  \nThen, frequency \\( f = \\frac{c}{\\lambda} \\).  \nWe get,  \n\\[\nf = \\frac{3 \\times 10^8}{6.0 \\times 10^{-7}}\n= 5.0 \\times 10^{14} \\, \\text{Hz}.\n\\]  \nHence, the frequency of light used is \\( 5.0 \\times 10^{14} \\, \\text{Hz} \\).", "exam_f_question": "In a Young's double slit experiment, the distance between the slits is 0.15 mm and the screen is 2.0 m away. The distance between the third dark fringe and the central bright fringe is measured to be 1.8 cm. Calculate the wavelength of the light used.", "guided_mode_answer": "**Beginner Explanation:**\nImagine you throw two pebbles into a still pond. Each pebble creates a circular wave. Where these two sets of waves meet, they interfere. In some spots, a wave crest from one meets a wave crest from the other, making a bigger wave (constructive interference). In other spots, a crest meets a trough, and they cancel out (destructive interference). Young's double slit experiment is like this, but with light waves. Light passes through two very close, parallel slits, creating two new waves that spread out and overlap on a screen. The pattern of bright and dark bands (fringes) you see is the interference pattern.\n\n**Intermediate Explanation:**\nThe core concept is **wave interference**. When coherent light (waves with a constant phase relationship) passes through two slits separated by a distance `d`, each slit acts as a new wave source. The light waves travel a distance `D` to a screen. At any point on the screen, the path difference between the waves from the two slits determines whether they interfere constructively or destructively.\n*   **Bright Fringes (Maxima):** Occur when the path difference is an integer multiple of the wavelength: `mλ = d sinθ ≈ d (y_m / D)`, where `m = 0, 1, 2,...` is the order, and `y_m` is the distance from the central maximum.\n*   **Dark Fringes (Minima):** Occur when the path difference is a half-integer multiple of the wavelength: `(m + ½)λ = d sinθ`.\nThe given problem uses the formula for the position of the `m`-th bright fringe, `y_m = (mλD)/d`, to first find the wavelength `λ` and then the frequency `f = c/λ`, where `c` is the speed of light.", "guided_f_question": "1. In the formula `y_m = (mλD)/d`, what does each symbol (`y_m`, `m`, `λ`, `D`, `d`) represent physically in the context of the double-slit setup?\n2. The solution uses `m=4` for the fourth bright fringe. What value of `m` would you use for the first dark fringe next to the central bright fringe, and what would the corresponding condition be?\n3. If the entire experiment (slits and screen) were submerged in water, would the fringe separation (distance between adjacent bright fringes) increase, decrease, or stay the same? Explain your reasoning.", "keywords": ["Interference", "Wavelength", "Fringe Separation", "Constructive Interference", "Coherent Sources", "Path Difference"]}
{"subject": "PHYS101", "question": "Discuss the phenomenon of double refraction and polarization by reflection.", "marks": 2.5, "exam_mode_answer": "Double refraction, or birefringence, occurs when a light ray incident on an anisotropic crystal, like calcite, splits into two rays: the ordinary (o-ray) and extraordinary (e-ray). Here, its given that the o-ray obeys Snell's law, while the e-ray does not. We know these two rays are plane-polarized with mutually perpendicular vibration planes. Now, by the definition of polarization by reflection, when unpolarized light is incident on a dielectric surface at a specific angle, called Brewster's angle, the reflected light becomes completely plane-polarized. Substituting the condition that the reflected and refracted rays are perpendicular, we get Brewster's law: tan θ_B = n, where n is the refractive index. Similarly, at this angle, the reflected light's electric field oscillates perpendicular to the plane of incidence. Hence, both phenomena demonstrate methods to obtain plane-polarized light from unpolarized light.", "exam_f_question": "Explain how the concepts of double refraction and polarization by reflection are connected, despite being based on different physical principles. In your answer, discuss the common outcome they produce and the key condition required for polarization by reflection to occur.", "guided_mode_answer": "Let's break down the two phenomena step-by-step.\n\n**1. Double Refraction (Birefringence):**\n*   **What happens?** When light enters certain crystals (like calcite), it doesn't just bend once. It splits into **two separate rays** traveling in slightly different directions.\n*   **The Two Rays:**\n    *   **Ordinary Ray (o-ray):** Behaves \"normally.\" It follows Snell's Law of refraction.\n    *   **Extraordinary Ray (e-ray):** Behaves \"extraordinarily.\" Its speed and direction of travel depend on its orientation inside the crystal, so it doesn't strictly follow Snell's Law.\n*   **The Key Point:** Both of these emerging rays are **plane-polarized**. This means the electric field of the light wave vibrates in a single, specific direction. Crucially, the vibration directions of the o-ray and e-ray are **perpendicular to each other**.\n\n**2. Polarization by Reflection:**\n*   **What happens?** When unpolarized light (vibrating in all directions) hits a non-metallic surface (like water or glass), the reflected light can become polarized.\n*   **The Special Angle (Brewster's Angle):** This only happens perfectly at one specific angle of incidence. At this angle, the **reflected ray and the refracted ray are perpendicular to each other**.\n*   **The Result:** The reflected light is **completely plane-polarized**. Its electric field vibrates **parallel to the reflecting surface** (or perpendicular to the plane containing the incident and reflected rays).\n\n**Connection:** Both are methods to **produce plane-polarized light** from ordinary, unpolarized light. Double refraction uses the structure of a crystal to split and polarize light, while polarization by reflection uses a specific angle of incidence on a surface.", "guided_f_question": "1. In double refraction, the two emerging rays (o-ray and e-ray) are polarized. What is the specific geometric relationship between their planes of vibration?\n2. For polarization by reflection to produce completely plane-polarized light, what must be the angular relationship between the reflected ray and the refracted ray?\n3. The Brewster's angle (θ_B) is given by tan(θ_B) = n. What does the variable 'n' represent in this equation, and what is the key assumption about the media involved?", "keywords": ["Birefringence", "Ordinary Ray", "Extraordinary Ray", "Brewster's Angle", "Plane-Polarized Light", "Snell's Law"]}
{"subject": "PHYS101", "question": "What is 1. ASL-R? Describe population inversion and pumping process for producing laser", "marks": 2.5, "exam_mode_answer": "ASL-R stands for Absorption, Spontaneous Emission, and Stimulated Emission of Radiation. These are the three fundamental processes of interaction between radiation and matter. For laser action, stimulated emission must dominate, which requires a population inversion. Population inversion is a non-equilibrium condition where the number of atoms in a higher energy state exceeds that in a lower energy state. This cannot be achieved under thermal equilibrium. The pumping process is the method of supplying external energy (e.g., via electrical discharge, optical flash, or chemical reaction) to the active medium to excite atoms from the lower to the higher energy state, thereby creating and maintaining the essential population inversion.", "exam_f_question": "Explain why a population inversion is necessary for laser action and cannot occur under conditions of thermal equilibrium.", "guided_mode_answer": "Let's break down how a laser works, step-by-step, using the concepts from the answer.\n\n**1. The Three Light-Matter Interactions (ASL-R):**\nThink of atoms as having specific energy levels, like steps on a ladder.\n*   **Absorption:** An atom on a lower step absorbs energy from a passing light photon and jumps to a higher step.\n*   **Spontaneous Emission:** An excited atom (on a higher step) eventually falls back down to a lower step on its own, releasing a new photon of light in a random direction. This is how ordinary light bulbs work.\n*   **Stimulated Emission:** This is the key to lasers. If a photon passes by an *already excited* atom, it can **stimulate** that atom to fall down. When it does, it emits a second photon that is an *exact copy* of the first one—same energy, direction, and phase.\n\n**2. The Problem and the Solution (Population Inversion & Pumping):**\nFor stimulated emission to become dominant and create a powerful, coherent beam, you need *many more* excited atoms than ground-state atoms. Normally, under thermal equilibrium (like in a room-temperature object), almost all atoms are in the lowest energy state. This is the opposite of what we need.\n*   **Population Inversion** is the special, non-equilibrium condition where you have **more atoms in a higher energy state than in a lower one**. It's like having more people on the top steps of the ladder than the bottom. This creates a \"stockpile\" of excited atoms ready for stimulated emission.\n*   **Pumping** is the process of actively creating this inversion. It's the \"hard work\" of the laser. An external energy source (like an electrical current or a bright flash of light) is used to forcefully \"pump\" or lift atoms from the lower state up to the higher, excited state. This builds up and maintains the population inversion.\n\n**In summary:** The **pumping process** uses external energy to create a **population inversion**. This inversion provides the medium where **stimulated emission** can dominate over absorption, leading to the amplification of light that defines a **laser**.", "guided_f_question": "1. In the ASL-R processes, which one is responsible for the random, incoherent light from a light bulb?\n2. Why is stimulated emission alone not enough to produce a laser beam? What specific condition must be met first?\n3. If you saw a diagram of a simple laser with an energy source, a tube of gas, and two mirrors, which component and process would be responsible for creating the population inversion?", "keywords": ["Absorption", "Stimulated Emission", "Population Inversion", "Pumping", "Energy Levels", "Laser Action"]}
{"subject": "PHYS101", "question": "What is grating element? Show that intensity of secondary principal maxima is decreased when number of slits N increased in plane transmission grating.", "marks": 5, "exam_mode_answer": "The grating element is the distance between corresponding points of adjacent slits, denoted by \\( d = a + b \\), where \\( a \\) is the slit width and \\( b \\) is the opaque spacing.\n\nFor a plane transmission grating with \\( N \\) slits, the resultant intensity from Fraunhofer diffraction is given by\n\\[\nI = I_0 \\left( \\frac{\\sin \\alpha}{\\alpha} \\right)^2 \\left( \\frac{\\sin N \\beta}{\\sin \\beta} \\right)^2,\n\\]\nwhere \\( \\alpha = \\frac{\\pi a \\sin \\theta}{\\lambda} \\) and \\( \\beta = \\frac{\\pi d \\sin \\theta}{\\lambda} \\).\n\nPrincipal maxima occur when \\( \\beta = m\\pi \\), i.e., \\( d \\sin \\theta = m\\lambda \\). Secondary maxima lie between these principal maxima. For secondary maxima, \\( \\frac{\\sin N \\beta}{\\sin \\beta} \\) is not zero but finite. The factor \\( \\left( \\frac{\\sin N \\beta}{\\sin \\beta} \\right)^2 \\) determines the intensity envelope.\n\nAs \\( N \\) increases, the principal maxima become sharper and more intense, but the number of secondary maxima increases proportionally to \\( N-2 \\). The total energy is distributed among more secondary maxima, so the intensity of each secondary maximum decreases. Specifically, the secondary maxima intensity is proportional to \\( \\frac{1}{N^2} \\) relative to the principal maxima. Hence, increasing \\( N \\) reduces the intensity of individual secondary maxima.", "exam_f_question": "A plane transmission grating has 5000 lines per cm. Calculate the grating element. If this grating is illuminated normally by light of wavelength 600 nm, at what angles will the first and second-order principal maxima be observed?", "guided_mode_answer": "Let's break down the key concepts from the answer.\n\n**1. Grating Element:**\nThink of a diffraction grating like a very precise comb for light. It's a surface with many equally spaced, parallel slits. The **grating element (d)** is simply the center-to-center distance between two adjacent slits. If 'a' is the width of a transparent slit and 'b' is the width of the opaque space between them, then the grating element is their sum: **d = a + b**. This distance 'd' is the fundamental repeating unit of the grating.\n\n**2. Intensity Formula & Maxima:**\nWhen light passes through the grating, the pattern we see (intensity 'I' at an angle θ) comes from two effects combined:\n*   **Single-Slit Diffraction:** The factor `(sin α / α)²` governs the overall brightness envelope. It's due to light spreading out from each individual slit.\n*   **Multi-Slit Interference:** The factor `(sin Nβ / sin β)²` creates the sharp, bright lines within that envelope. Here, N is the total number of slits.\n\n**Principal Maxima** are the very bright, sharp lines you see. They occur under a special condition: `d sin θ = mλ`, where m=0,1,2... (this is the famous grating equation).\n\n**Secondary Maxima** are the much fainter, broader bumps of light that appear *between* the principal maxima.\n\n**3. Effect of Increasing Slits (N):**\nThis is the core of the question. The interference term `(sin Nβ / sin β)²` is key.\n*   **For Principal Maxima:** When the condition `β = mπ` is met, this term equals `N²`. So, the intensity of a principal maximum is proportional to **N²**. More slits mean *much brighter* principal maxima.\n*   **For Secondary Maxima:** They occur when the numerator `sin Nβ` is at a maximum, but the denominator `sin β` is not zero. The height of these secondary peaks is much smaller.\n*   **The Crucial Point:** The **total light energy** passing through the grating is fixed (it comes from your source). As you increase N, this energy gets redistributed:\n    *   A larger fraction goes into making the principal maxima brighter (∝ N²).\n    *   The remaining energy is spread out over many more secondary maxima (there are about N-2 of them).\n    *   Therefore, with more slits (larger N), each individual secondary maximum gets a smaller and smaller share of the total energy. Mathematically, the intensity of a secondary maximum is proportional to **1/N²** compared to a principal maximum.\n\n**Analogy:** Imagine you have a fixed amount of paint (total light energy).\n*   With a few slits (small N), you paint a few bright principal lines and a few dim secondary smudges.\n*   With thousands of slits (large N), you use most paint to make the principal lines incredibly vivid and sharp. The leftover paint must now be used to color many, many more faint secondary smudges in between, making each one almost invisible.", "guided_f_question": "1.  In the intensity formula I = I₀ (sin α/α)² (sin Nβ/sin β)², what does the variable 'β' physically represent, and how is it different from 'α'?\n2.  The condition for a principal maximum is d sin θ = mλ. If the wavelength λ of the light is increased while keeping the grating the same, what happens to the angular separation between the principal maxima?\n3.  In the guided explanation, an analogy with paint was used. How does this analogy connect to the mathematical fact that the intensity of a principal maximum is proportional to N²?", "keywords": ["Grating Element", "Principal Maxima", "Secondary Maxima", "Diffraction Grating", "Intensity Distribution", "Fraunhofer Diffraction"]}
{"subject": "PHYS101", "question": "Assume that limits of the visible spectrum are arbitrarily chosen as 4300 A and 5800 A. Design a grating that will spread the first-order spectrum through an angular range 20°.", "marks": 5, "exam_mode_answer": "Here, its given that,\nλ₁ = 4300 Å = 4.3 × 10⁻⁷ m,\nλ₂ = 5800 Å = 5.8 × 10⁻⁷ m,\nAngular range for first-order (m = 1) spectrum, Δθ = 20°.\n\nWe know,\nThe grating equation is: d sin θ = mλ.\nFor first order, d sin θ₁ = λ₁ and d sin θ₂ = λ₂.\n\nNow, by the definition,\nAngular range Δθ = θ₂ − θ₁ = 20°.\n\nSubstituting,\nθ₂ = θ₁ + 20°.\nThen, d sin θ₁ = λ₁ and d sin (θ₁ + 20°) = λ₂.\n\nSimilarly,\nDividing the two equations:\nsin (θ₁ + 20°) / sin θ₁ = λ₂ / λ₁ = 5.8 / 4.3 ≈ 1.3488.\n\nWe get,\nsin (θ₁ + 20°) = 1.3488 sin θ₁.\nExpanding: sin θ₁ cos 20° + cos θ₁ sin 20° = 1.3488 sin θ₁.\nUsing cos 20° ≈ 0.9397, sin 20° ≈ 0.3420:\n0.9397 sin θ₁ + 0.3420 cos θ₁ = 1.3488 sin θ₁\n→ 0.3420 cos θ₁ = 0.4091 sin θ₁\n→ tan θ₁ ≈ 0.8360\n→ θ₁ ≈ 39.9°.\n\nThen,\nd = λ₁ / sin θ₁ = (4.3 × 10⁻⁷) / sin 39.9° ≈ (4.3 × 10⁻⁷) / 0.6414 ≈ 6.70 × 10⁻⁷ m.\n\nHence,\nNumber of lines per meter N = 1/d ≈ 1 / (6.70 × 10⁻⁷) ≈ 1.49 × 10⁶ lines/m.\nGrating design: Use a grating with about 1490 lines/mm.", "exam_f_question": "A diffraction grating has 1200 lines/mm. For the first-order spectrum, the angle of diffraction for a wavelength of 500 nm is measured to be 20°. Calculate the angular width of the first-order spectrum if the visible range is from 400 nm to 700 nm. Does the entire first-order spectrum fit within a 30° angular range?", "guided_mode_answer": "**Concept Explanation: Designing a Diffraction Grating for a Specific Angular Spread**\n\n**Beginner Level:**\nImagine a diffraction grating as a tool that acts like a super-precise comb for light. When white light (containing all colors) hits it, the grating separates the light into its constituent colors, creating a rainbow pattern called a spectrum. This happens because different colors (wavelengths) of light bend by different amounts when they pass through the grating's closely spaced lines.\n\n**Intermediate Level:**\nThe core principle is described by the **grating equation**: **d sin θ = mλ**.\n*   **d**: The distance between adjacent lines on the grating (grating spacing).\n*   **θ**: The angle at which a specific color (wavelength λ) appears.\n*   **m**: The \"order\" of the spectrum (m=1 for the first, most prominent rainbow).\n*   **λ**: The wavelength of the light.\n\nThe problem asks us to *design* the grating (find 'd') so that the first rainbow (first-order spectrum) for visible light covers a specific angular width (20°). We are given the two edges of the visible spectrum: violet (λ₁) and red (λ₂).\n\n**Step-by-Step Logic:**\n1.  For the violet edge: d sin θ₁ = λ₁\n2.  For the red edge: d sin θ₂ = λ₂\n3.  The angular range is defined as Δθ = θ₂ - θ₁ = 20°.\n4.  We combine these equations. By dividing (2) by (1), we eliminate 'd': sin θ₂ / sin θ₁ = λ₂ / λ₁.\n5.  Since θ₂ = θ₁ + 20°, we substitute to get: sin(θ₁ + 20°) / sin θ₁ = λ₂/λ₁.\n6.  This equation has only one unknown (θ₁). We solve it using trigonometric identities.\n7.  Once θ₁ is found, we plug it back into d = λ₁ / sin θ₁ to calculate the required grating spacing 'd'.\n8.  Finally, the number of lines per meter (N) is the reciprocal of 'd' (N = 1/d).\n\nThe provided solution follows this exact logical path, using the given wavelengths to find θ₁ ≈ 39.9°, then d ≈ 670 nm, resulting in a grating with about 1490 lines per millimeter.", "guided_f_question": "1.  The grating equation is d sin θ = mλ. If we want the first-order (m=1) spectrum for a specific wavelength to appear at a larger angle θ, should the grating spacing 'd' be increased or decreased? Explain your reasoning using the equation.\n2.  In the solved problem, we found θ₁ (for violet) to be about 39.9°. Using the grating equation d sin θ = λ, and the calculated d ≈ 6.70 x 10⁻⁷ m, verify the angle for the red light (λ₂ = 5.8 x 10⁻⁷ m). Does θ₂ come out to be approximately θ₁ + 20°?\n3.  The solution uses the approximation sin 20° ≈ 0.3420 and cos 20° ≈ 0.9397. How would the final answer for the number of lines per meter change if you used more precise values (e.g., from a calculator: sin 20°=0.342020..., cos 20°=0.939693...)? Perform the calculation to check if the difference is significant for practical grating design.", "keywords": ["Diffraction Grating", "Grating Equation", "Angular Dispersion", "First-Order Spectrum", "Wavelength", "Lines per Meter"]}
{"subject": "PHYS101", "question": "Explain the theory of Newton's ring formed by coherent sources of light. Derive an expression for Jameter of n° bright and dark rings. Obtain an expression for wavelength of sodium light by using such ring.", "marks": 5, "exam_mode_answer": "Newton's rings are formed due to interference between light waves reflected from the top and bottom surfaces of an air film of varying thickness between a plano-convex lens and a flat glass plate. The two reflected beams are coherent as they originate from the same monochromatic source. For near-normal incidence, the path difference is \\(2\\mu t + \\frac{\\lambda}{2}\\), where \\(\\mu\\) is the refractive index of the film (air, \\(\\mu \\approx 1\\)) and \\(t\\) is the thickness at a distance \\(r\\) from the point of contact. The extra \\(\\frac{\\lambda}{2}\\) arises due to phase change at the denser medium (glass plate).\n\nHere, its given that for a lens of radius of curvature \\(R\\), \\(t \\approx \\frac{r^2}{2R}\\).\nWe know, for constructive interference (bright ring), \\(2t + \\frac{\\lambda}{2} = n\\lambda\\).\nSubstituting for \\(t\\), \\(2\\left(\\frac{r_n^2}{2R}\\right) + \\frac{\\lambda}{2} = n\\lambda\\).\nThen, \\(\\frac{r_n^2}{R} = \\left(n - \\frac{1}{2}\\right)\\lambda\\).\nHence, diameter of \\(n^{th}\\) bright ring, \\(D_n^2 = 4R\\left(n - \\frac{1}{2}\\right)\\lambda\\).\n\nSimilarly, for destructive interference (dark ring), \\(2t + \\frac{\\lambda}{2} = \\left(n + \\frac{1}{2}\\right)\\lambda\\).\nWe get \\(\\frac{r_n^2}{R} = n\\lambda\\).\nHence, \\(D_n^2 = 4Rn\\lambda\\).\n\nTo find wavelength \\(\\lambda\\), using dark rings, \\(\\lambda = \\frac{D_{n+m}^2 - D_n^2}{4Rm}\\), where \\(m\\) is the ring difference. Measuring diameters for known \\(R\\) gives \\(\\lambda\\).", "exam_f_question": "A student measures the diameters of the 5th and 15th dark rings in a Newton's rings experiment as 2.50 mm and 4.33 mm respectively. If the radius of curvature of the plano-convex lens is 1.00 m, calculate the wavelength of the light used. Which part of the electromagnetic spectrum does this wavelength belong to?", "guided_mode_answer": "**Beginner Explanation:**\nImagine placing a curved glass lens on top of a flat glass plate. There's a tiny air gap between them, thickest at the edges and zero at the center where they touch. When you shine a single-color light (like yellow from a sodium lamp) from above, the light reflects off both the *bottom surface of the lens* and the *top surface of the plate*. These two reflected light waves meet and \"interfere.\" Where the wave crests align, they add up to make a bright ring. Where a crest meets a trough, they cancel to make a dark ring. Because the air gap thickness changes in a circular pattern, you see concentric bright and dark rings.\n\n**Intermediate Derivation:**\nThe setup creates an air film of variable thickness `t`. The key is the **path difference** between the two reflected rays. One ray reflects off a denser medium (glass plate), causing a half-wavelength (`λ/2`) phase shift.\n*   **Path Difference:** `Δ = 2μt + λ/2` (for air, μ ≈ 1, so `Δ = 2t + λ/2`).\n*   **Condition for a Dark Ring (Destructive Interference):** `2t + λ/2 = (n + ½)λ` simplifies to `2t = nλ`.\n*   **Relating Thickness to Ring Radius:** For a lens of radius of curvature `R`, geometry gives `t ≈ r_n² / (2R)` for small `t`.\n*   **Substitute:** `2 * (r_n² / (2R)) = nλ` → `r_n² = nλR`.\n*   **Diameter:** `D_n = 2r_n`, so `D_n² = 4nλR`.\n\n**Finding Wavelength (λ):**\nYou can't measure `R` and `t` directly with high precision. The clever solution uses the *difference* in diameters of two rings. From `D_n² = 4nλR` and `D_(n+m)² = 4(n+m)λR`, subtracting gives:\n`D_(n+m)² - D_n² = 4mλR`\nTherefore, `λ = (D_(n+m)² - D_n²) / (4mR)`\nBy measuring the diameters of the `nth` and `(n+m)th` dark rings and knowing `R`, you can calculate `λ` accurately without needing the exact point of contact.", "guided_f_question": "1. In the derivation, we used the approximation `t ≈ r²/(2R)`. What geometric principle or lens property is this based on, and why is this approximation valid for Newton's rings?\n2. The formula for the diameter of the nth dark ring is D_n² = 4nλR. If you plot D_n² on the y-axis and the ring number `n` on the x-axis, what would the graph look like? What does the slope of this graph represent?\n3. In the procedure, why is it important to use a monochromatic light source (like a sodium lamp) and not white light? What would you observe if you used white light instead?", "keywords": ["Interference", "Coherent Sources", "Path Difference", "Air Film", "Radius of Curvature", "Constructive and Destructive Interference"]}
{"subject": "PHYS101", "question": "What is the full form of LASER? Provide any four significant applications of lasers in various fields.", "marks": 3, "exam_mode_answer": "Light Amplification by Stimulated Emission of Radiation. Here, its given that laser light is highly coherent, monochromatic, and directional. We know these properties enable precise applications. Now, by the definition of its use in medicine, lasers are applied in surgeries for cutting and cauterizing tissues. Similarly, in communications, they transmit data through optical fibers. Then, in manufacturing, lasers are used for cutting, welding, and engraving materials with high accuracy. Substituting for measurement, lasers enable precise distance ranging in surveying and LIDAR. We get significant applications also in scientific research for spectroscopy and cooling atoms. Hence, four key applications are: medical surgery, optical fiber communications, industrial material processing, and precision measurement systems.", "exam_f_question": "Explain how the property of coherence in laser light is crucial for its application in optical fiber communications.", "guided_mode_answer": "**Beginner Explanation:**\nLASER stands for Light Amplification by Stimulated Emission of Radiation. Think of it as a device that produces a very special, intense beam of light. Unlike a regular light bulb that scatters light in all directions and contains many colors (wavelengths), a laser beam is:\n*   **Monochromatic:** It's essentially one pure color (a single wavelength).\n*   **Coherent:** All the light waves are perfectly aligned and in step with each other, like marching soldiers.\n*   **Directional:** The beam is very narrow and doesn't spread out much, allowing it to travel long distances or be focused onto a very tiny spot.\n\n**Intermediate Explanation:**\nA LASER is a device that generates light through a quantum mechanical process called **Stimulated Emission**. Here’s the core process:\n1.  **Energy Input (Pumping):** Energy (electrical, optical, etc.) is supplied to a **gain medium** (like a crystal, gas, or semiconductor).\n2.  **Population Inversion:** This pumping excites atoms in the medium, creating a non-equilibrium state where more atoms are in a higher energy level than a lower one—this is called population inversion.\n3.  **Stimulated Emission:** When a photon (light particle) of the correct frequency passes by an excited atom, it can *stimulate* that atom to drop to a lower energy level and emit a second, identical photon. The key is that this new photon has the same phase, frequency, polarization, and direction as the stimulating photon.\n4.  **Amplification:** This process happens repeatedly within an **optical cavity** (two mirrors facing each other). Photons bounce back and forth, stimulating more and more emissions, creating a chain reaction that **amplifies** the light. One mirror is partially transparent, allowing the intense, coherent beam to escape.\n\nThe unique properties (coherence, monochromaticity, directionality) arise directly from this stimulated emission process, making lasers powerful tools for precision applications.", "guided_f_question": "1.  Why is achieving a \"population inversion\" a critical requirement for a laser to function, and how does it differ from the normal state of a material?\n2.  The answer mentions lasers are used for \"cooling atoms\" in research. How can a beam of light, which we associate with heat, possibly be used to cool something down to extremely low temperatures?\n3.  In industrial material processing (like cutting metal), why is a laser's ability to be focused to a very small spot size so important for its effectiveness?", "keywords": ["Stimulated Emission", "Population Inversion", "Coherence", "Optical Cavity", "Gain Medium", "Monochromatic"]}
{"subject": "PHYS101", "question": "Write short notes on (a) spontaneous emission (b) stimulated emission, and (c) population inversion.", "marks": 3, "exam_mode_answer": "Here, its given that an atom in an excited state can return to a lower energy state by emitting a photon.  \nWe know, in spontaneous emission, the atom decays randomly without any external influence, emitting a photon with random phase and direction.  \nNow, by the definition of stimulated emission, an incoming photon of appropriate energy triggers the excited atom to decay, producing a second photon identical in phase, frequency, and direction to the incident one.  \nSimilarly, for laser action, stimulated emission must dominate.  \nThen, this requires more atoms in the excited state than the lower state, a condition known as population inversion.  \nWe get population inversion by pumping energy into the system via electrical, optical, or other means.  \nHence, population inversion is a non-equilibrium state essential for achieving net light amplification.", "exam_f_question": "Explain why population inversion is a necessary condition for the operation of a laser, and describe one common method used to achieve it.", "guided_mode_answer": "Let's break down the key concepts from the exam answer step-by-step.\n\n**1. The Starting Point: Excited Atoms**\nAn atom can absorb energy and jump to a higher energy level (an \"excited state\"). This state is unstable. Sooner or later, the atom will return to a lower, more stable energy level. When it does this, it must release the extra energy, often in the form of a photon (a particle/package of light).\n\n**2. Two Ways to Emit Light**\nThere are two distinct processes by which this excited atom can release its photon:\n\n*   **Spontaneous Emission:** This happens naturally and randomly. Think of it like a popcorn kernel popping. You don't know *which* kernel will pop *when* or in *which direction*. Similarly, an excited atom will eventually decay on its own, emitting a photon with a random phase and shooting off in a random direction. This is how ordinary light sources (like light bulbs) work.\n\n*   **Stimulated Emission:** This is a triggered process. If a photon with the *exact* energy matching the atom's excited state passes by, it can \"stimulate\" the atom to decay immediately. The result is remarkable: the atom emits a *second* photon that is an **exact copy** of the first one. They have the same energy (color/frequency), travel in the same direction, and their light waves are perfectly in step (in phase).\n\n**3. The Key to Lasers: Making Copies**\nThe magic of stimulated emission is that it creates identical photons. One photon goes in and two identical photons come out. This is **light amplification**.\n\n**4. The Problem and the Solution: Population Inversion**\nUnder normal conditions (at thermal equilibrium), almost all atoms are in the lowest energy state. Any photon trying to cause stimulated emission is far more likely to be *absorbed* by a low-energy atom than to stimulate an excited one. Absorption wins, and light gets weaker, not stronger.\n\nTo make stimulated emission dominate, we need **more atoms in the excited state than in the lower state**. This unnatural, \"upside-down\" condition is called **Population Inversion**. It's like having more popcorn kernels already popped and waiting in the air than sitting unpopped in the bag.\n\n**5. Creating the Inversion: Pumping**\nWe can't get population inversion by just heating the material; we have to actively \"pump\" energy into it. This is like using a special method to force most kernels to pop and stay popped. Common pumping methods include:\n*   **Optical Pumping:** Blasting the material with intense light (like a camera flash).\n*   **Electrical Pumping:** Passing an electric current through the material (as in a laser diode).\n\nIn summary: **Pumping** creates a **Population Inversion**, which allows **Stimulated Emission** to dominate over absorption, leading to the amplification of identical photons that is the basis of **Laser** light.", "guided_f_question": "1. In your own words, what is the single most important difference between a photon produced by spontaneous emission and one produced by stimulated emission?\n2. Why is a simple light bulb, which uses spontaneous emission, incapable of producing a laser beam?\n3. If you were to look at the energy levels of atoms in a material at room temperature, would you find a population inversion? Why or why not?", "keywords": ["Spontaneous Emission", "Stimulated Emission", "Population Inversion", "Pumping", "Photon", "Excited State"]}
{"subject": "PHYS101", "question": "Calculate the moment of inertia and radius of gyration of slender (uniform) rod about an axis passing through its center of mass and perpendicular to its length.", "marks": 3, "exam_mode_answer": "Here, its given that the rod is slender and uniform, with mass \\( M \\) and length \\( L \\).  \nWe know the moment of inertia about an axis through one end and perpendicular to the rod is \\( \\frac{1}{3} M L^2 \\).  \nNow, by the definition of the parallel axis theorem, \\( I = I_{cm} + M d^2 \\), where \\( d \\) is the distance between the axes.  \nFor the end axis, \\( d = L/2 \\).  \nSubstituting, \\( \\frac{1}{3} M L^2 = I_{cm} + M \\left( \\frac{L}{2} \\right)^2 \\).  \nThen, \\( I_{cm} = \\frac{1}{3} M L^2 - \\frac{1}{4} M L^2 \\).  \nWe get, \\( I_{cm} = \\frac{1}{12} M L^2 \\).  \nHence, the moment of inertia about the center is \\( \\frac{1}{12} M L^2 \\).  \nThe radius of gyration \\( k \\) is given by \\( I = M k^2 \\).  \nSubstituting, \\( M k^2 = \\frac{1}{12} M L^2 \\).  \nThus, \\( k = \\frac{L}{\\sqrt{12}} = \\frac{L}{2\\sqrt{3}} \\).", "exam_f_question": "A uniform rod of mass M and length L has a moment of inertia of (1/12)ML² about an axis through its center and perpendicular to its length. If the axis is shifted to be parallel to this central axis but located at a distance of L/4 from one end of the rod, what is the new moment of inertia? Use the parallel axis theorem.", "guided_mode_answer": "**Beginner Explanation:**\nImagine a long, thin, uniform rod like a meter stick. The \"moment of inertia\" is a measure of how hard it is to spin it. It depends on where you put the axis of rotation. Spinning it around its center (like a propeller) is easier than spinning it around one end (like a swinging door). The formula (1/12)ML² quantifies this difficulty for spinning around the center. The \"radius of gyration\" (k) is a single distance that tells you how far from the axis you would have to concentrate all the mass to get the same moment of inertia. For the center axis, this distance is L/(2√3).\n\n**Intermediate Explanation:**\nWe derive the moment of inertia by integrating the contributions of infinitesimal mass elements along the rod's length. For an axis through the center (x=0), we consider a small mass element *dm = (M/L)dx* at a distance *x*. The moment of inertia is *I_cm = ∫ x² dm*, integrated from -L/2 to L/2. This yields *I_cm = (1/12)ML²*. The provided exam answer cleverly uses the known result for an axis at the end, *I_end = (1/3)ML²*, and the Parallel Axis Theorem: *I = I_cm + Md²*, where *d* is the distance between the parallel axes (here, d = L/2). Solving *I_end = I_cm + M(L/2)²* gives *I_cm*. The radius of gyration *k* is defined by *I = Mk²*, so *k = √(I/M) = L/√12 = L/(2√3)*.", "guided_f_question": "1. Let's start with the definition. For a small piece of the rod with mass *dm*, its contribution to the moment of inertia is *r² dm*, where *r* is its distance from the axis. If the rod's linear mass density is λ (mass per unit length), how do you express *dm* in terms of λ and a small length *dx*?\n2. Now, set up the integral to find *I_cm*. Place the rod along the x-axis with its center at x=0. The axis is perpendicular to the rod at x=0. What are the correct limits of integration for the variable *x*, and what is the full integral *I_cm = ∫ r² dm* in terms of λ and x?\n3. After integrating, you'll get an answer in terms of M and L. The final step is the radius of gyration *k*. Using the result *I_cm = (1/12)ML²* and the definition *I = Mk²*, solve algebraically for *k*.", "keywords": ["Moment of Inertia", "Parallel Axis Theorem", "Radius of Gyration", "Linear Mass Density", "Integration", "Center of Mass"]}
{"subject": "PHYS101", "question": "State and prove the parallel and perpendicular axes theorem of moment of inertia.", "marks": 3, "exam_mode_answer": "The parallel axis theorem states: \\( I = I_{cm} + Md^2 \\), where \\( I_{cm} \\) is the moment of inertia about the centre of mass axis, \\( M \\) is the total mass, and \\( d \\) is the perpendicular distance between the two parallel axes.\n\nHere, its given that an object’s mass element \\( dm \\) is at position \\( \\vec{r} \\) from the centre of mass. For an axis parallel to the CM axis but displaced by \\( \\vec{d} \\), the position vector is \\( \\vec{r}' = \\vec{r} + \\vec{d} \\).  \nNow, by the definition of moment of inertia, \\( I = \\int r'^2 dm \\).  \nSubstituting, \\( I = \\int (\\vec{r} + \\vec{d})^2 dm = \\int (r^2 + d^2 + 2\\vec{r}\\cdot\\vec{d}) dm \\).  \nThen, \\( \\int r^2 dm = I_{cm} \\), \\( \\int d^2 dm = Md^2 \\), and \\( \\int \\vec{r}\\cdot\\vec{d} \\, dm = 0 \\) because \\( \\int \\vec{r} \\, dm = 0 \\) about the CM.  \nWe get \\( I = I_{cm} + Md^2 \\). Hence, proved.\n\nThe perpendicular axis theorem applies to planar laminas: \\( I_z = I_x + I_y \\), where \\( x \\) and \\( y \\) are perpendicular axes in the plane and \\( z \\) is perpendicular to the plane through their intersection.  \nBy definition, \\( I_z = \\int (x^2 + y^2) dm \\), \\( I_x = \\int y^2 dm \\), \\( I_y = \\int x^2 dm \\).  \nSubstituting, \\( I_z = \\int x^2 dm + \\int y^2 dm = I_y + I_x \\). Hence, proved.", "exam_f_question": "A uniform thin rod of mass M and length L has a moment of inertia about an axis through its centre and perpendicular to its length of (1/12)ML². Using the parallel axis theorem, calculate its moment of inertia about an axis perpendicular to the rod and passing through one of its ends.", "guided_mode_answer": "Let's break down the two theorems for moment of inertia, which is a measure of how difficult it is to change an object's rotation.\n\n**Parallel Axis Theorem:**\nThink of it as a \"shifting\" rule. If you know how hard it is to spin an object around an axis through its center of mass (like spinning a pencil around its middle), this theorem tells you how much harder it is to spin it around a *parallel* axis somewhere else (like spinning the same pencil around its end). The extra difficulty comes from the mass being, on average, farther from the new axis. The formula is:\nI = I_cm + Md²\nWhere:\n- I = Moment of inertia about the new parallel axis.\n- I_cm = Moment of inertia about the center of mass axis.\n- M = Total mass of the object.\n- d = Perpendicular distance between the two parallel axes.\n\n**Perpendicular Axis Theorem:**\nThis is a \"flat object\" rule. It *only* applies to thin, flat, planar objects (like a sheet of paper, a coin, or a door). If you have moments of inertia about two perpendicular axes *in the plane* of the object (say, the x and y axes), this theorem gives you the moment of inertia about a third axis *perpendicular* to the plane (the z-axis) that passes through the point where the first two axes intersect. The formula is:\nI_z = I_x + I_y\nWhere:\n- I_z = Moment of inertia about the perpendicular axis (z-axis).\n- I_x, I_y = Moments of inertia about the two perpendicular axes lying in the plane of the object.", "guided_f_question": "1. For the parallel axis theorem, why is the term ∫ **r** · **d** dm equal to zero in the proof? What key property of the center of mass does this rely on?\n2. The perpendicular axis theorem is stated for a planar lamina. Why does it fail for a three-dimensional object, like a solid sphere or a thick cylinder?\n3. A student calculates the moment of inertia of a thin circular ring about its diameter using I = (1/2)MR² (which is correct for an axis through its center, perpendicular to the plane). They then try to use the perpendicular axis theorem to find I about a diameter, writing I_diameter + I_diameter = (1/2)MR², leading to I_diameter = (1/4)MR². Is this application of the theorem valid? Why or why not?", "keywords": ["Moment of Inertia", "Parallel Axis Theorem", "Perpendicular Axis Theorem", "Center of Mass", "Planar Lamina", "Mass Distribution"]}
{"subject": "PHYS101", "question": "A gas molecule having a speed of $300 \\mathrm{~m} / \\mathrm{s}$ collides elastically with another molecule of the same mass which is initially at rest. After collision the first molecule moves at an angle of $30^{\\circ}$ to its initial direction. Find the speed of each molecule after collision and the angle made with the incident direction by the recoiling target molecule.", "marks": 3, "exam_mode_answer": "Here, its given that,  \n\\( u_1 = 300 \\ \\text{m/s}, \\ u_2 = 0, \\ m_1 = m_2 = m, \\ \\theta_1 = 30^\\circ \\).  \nWe know, for elastic collision of equal masses, velocities after collision are perpendicular:  \n\\( \\theta_1 + \\theta_2 = 90^\\circ \\).  \nSo, \\( \\theta_2 = 90^\\circ - 30^\\circ = 60^\\circ \\).  \n\nNow, by conservation of momentum along initial direction:  \n\\( m u_1 = m v_1 \\cos 30^\\circ + m v_2 \\cos 60^\\circ \\).  \nSubstituting \\( u_1 = 300 \\):  \n\\( 300 = v_1 \\frac{\\sqrt{3}}{2} + v_2 \\cdot \\frac{1}{2} \\) … (1)  \n\nSimilarly, perpendicular direction momentum:  \n\\( 0 = m v_1 \\sin 30^\\circ - m v_2 \\sin 60^\\circ \\)  \n\\( v_1 \\cdot \\frac{1}{2} = v_2 \\cdot \\frac{\\sqrt{3}}{2} \\)  \n\\( v_1 = \\sqrt{3} \\, v_2 \\) … (2)  \n\nSubstituting (2) into (1):  \n\\( 300 = \\sqrt{3} v_2 \\cdot \\frac{\\sqrt{3}}{2} + \\frac{v_2}{2} \\)  \n\\( 300 = \\frac{3 v_2}{2} + \\frac{v_2}{2} = 2 v_2 \\)  \n\\( v_2 = 150 \\ \\text{m/s} \\).  \n\nThen from (2): \\( v_1 = \\sqrt{3} \\times 150 \\approx 259.8 \\ \\text{m/s} \\).  \n\nHence, after collision:  \nFirst molecule speed \\( \\approx 259.8 \\ \\text{m/s} \\),  \nSecond molecule speed \\( = 150 \\ \\text{m/s} \\),  \nRecoil angle \\( \\theta_2 = 60^\\circ \\) to incident direction.", "exam_f_question": "A gas molecule with a speed of 400 m/s collides elastically with an identical molecule at rest. After the collision, the first molecule is deflected by an angle of 45°. Find the speeds of both molecules after the collision and the angle at which the second molecule recoils.", "guided_mode_answer": "This problem involves a perfectly **elastic collision** between two particles of **equal mass**. In such collisions, kinetic energy is conserved. A key geometric result for equal-mass elastic collisions is that the final velocities of the two particles are always perpendicular to each other (θ₁ + θ₂ = 90°). We use two fundamental principles:\n1.  **Conservation of Momentum**: The total momentum before the collision equals the total momentum after. We apply this separately along the initial direction (x-axis) and perpendicular to it (y-axis).\n2.  **Conservation of Kinetic Energy**: The total kinetic energy before equals the total after.\n\nThe step-by-step strategy is:\n*   **Step 1 (Geometry)**: Use the perpendicular-velocities rule (θ₂ = 90° - θ₁) to find the recoil angle.\n*   **Step 2 (Momentum - Perpendicular)**: Set up the momentum equation perpendicular to the initial motion. Since there was no initial momentum in this direction, the sum of the components after must be zero. This gives a simple relationship between the two final speeds (v₁ and v₂).\n*   **Step 3 (Momentum - Parallel)**: Set up the momentum equation along the initial direction. Substitute the relationship from Step 2 into this equation to solve for one of the speeds.\n*   **Step 4 (Solve)**: Use the result from Step 3 to find the other speed using the relationship from Step 2.", "guided_f_question": "1.  In the provided solution, the rule θ₁ + θ₂ = 90° is used. What physical principle (conservation law) leads directly to this specific geometric result for elastic collisions of equal masses?\n2.  Looking at the perpendicular momentum equation: 0 = m v₁ sin30° - m v₂ sin60°. Why is there a minus sign for the second term, and what does this imply about the directions of the particles' motion after the collision?\n3.  After finding v₂ = 150 m/s, we use v₁ = √3 v₂. If you were to verify your answer, which conservation law (other than momentum) could you use to check if the calculated speeds are correct? Set up that equation with the numbers you found.", "keywords": ["Elastic Collision", "Conservation of Momentum", "Conservation of Kinetic Energy", "Scattering Angle", "Relative Velocity", "Equal Mass"]}
{"subject": "PHYS101", "question": "A $200 \\mathrm{~kg}$ load is hung on a wire of length $4 \\mathrm{~m}$ , cross-sectional area $0.200 \\times 10^{-4} \\mathrm{~m}^{2}$ , and Young's modulus $8.0 \\times 10^{10} \\mathrm{~N} / \\mathrm{m}^{2}$ . What is its increase in length?", "marks": 3, "exam_mode_answer": "Here, its given that,  \nMass \\( m = 200 \\, \\text{kg} \\),  \nLength \\( L = 4 \\, \\text{m} \\),  \nCross-sectional area \\( A = 0.200 \\times 10^{-4} \\, \\text{m}^2 \\),  \nYoung’s modulus \\( Y = 8.0 \\times 10^{10} \\, \\text{N/m}^2 \\).  \n\nWe know,  \nThe force due to the load is \\( F = mg = 200 \\times 9.8 = 1960 \\, \\text{N} \\).  \n\nNow, by the definition of Young’s modulus,  \n\\[\nY = \\frac{F/A}{\\Delta L / L}\n\\]\n\\[\n\\Delta L = \\frac{F L}{A Y}\n\\]\n\nSubstituting the values,  \n\\[\n\\Delta L = \\frac{1960 \\times 4}{(0.200 \\times 10^{-4}) \\times (8.0 \\times 10^{10})}\n\\]\n\nThen,  \n\\[\n\\Delta L = \\frac{7840}{1.6 \\times 10^{6}} = 4.9 \\times 10^{-3} \\, \\text{m}\n\\]\n\nWe get,  \n\\[\n\\Delta L = 4.9 \\, \\text{mm}\n\\]\n\nHence, the increase in length is \\( 4.9 \\, \\text{mm} \\).", "exam_f_question": "A steel wire of length 2.5 m and diameter 0.50 mm is stretched by 1.0 mm when supporting a certain load. If Young's modulus for steel is 2.0 × 10¹¹ N/m², calculate the mass of the load. (Use g = 9.8 m/s²)", "guided_mode_answer": "This problem is about **Elasticity**, specifically how a material stretches under a force. The key concept is **Young's Modulus (Y)**, which is a measure of a material's stiffness. It tells us how much stress (force per area) is needed to produce a certain strain (fractional change in length).\n\n**Step-by-Step Logic:**\n1.  **Identify the Force:** The load has mass, so its weight (Force, F = m × g) pulls down on the wire.\n2.  **Relate Force to Stretch:** The wire stretches because of this force. Young's Modulus (Y) is the constant that links the cause (stress = F/A) to the effect (strain = ΔL / L).\n3.  **Use the Formula:** The defining equation is Y = (F/A) / (ΔL/L). We rearrange it to solve for the unknown increase in length: ΔL = (F × L) / (A × Y).\n4.  **Substitute and Solve:** Carefully plug all given values into this formula, ensuring all units are in meters, kilograms, and seconds.\n\n**Why it Works:** Young's Modulus is a property of the *material* (the wire). For a given material, a thicker wire (larger A) stretches less for the same force, and a longer wire (larger L) stretches more. The formula ΔL = (F L)/(A Y) perfectly captures these relationships.", "guided_f_question": "1.  In the formula ΔL = (F L) / (A Y), if the cross-sectional area (A) of the wire were doubled, how would the increase in length (ΔL) change, assuming everything else stays the same?\n2.  What does the value of Young's modulus (8.0 × 10¹⁰ N/m²) tell you about the material of the wire? Is it relatively stiff or easily stretchable compared to rubber (Y ~ 10⁶ N/m²)?\n3.  The final answer was 4.9 mm. What is this value as a fraction or percentage of the original 4 m length? What is the name given to this fractional change (ΔL/L)?", "keywords": ["Young's Modulus", "Stress", "Strain", "Elasticity", "Tensile Force", "Deformation"]}
{"subject": "PHYS101", "question": "A solid brass sphere is initially surrounded by air, and the air pressure exerted on it is $1.0 \\times 10^{10} \\mathrm{~N} / \\mathrm{m}^{2}$ (normal atmospheric pressure). The sphere is lowered into the ocean to a depth where the pressure is $2.0 \\times 10^{7} \\mathrm{~N} / \\mathrm{m}^{2}$ . The volume of the sphere in air is $0.50 \\mathrm{~m}^{3}$ . By how much does this volume change once the sphere is submerged?", "marks": 3, "exam_mode_answer": "Here, its given that,  \nInitial pressure \\( P_1 = 1.0 \\times 10^{5} \\, \\text{N/m}^2 \\) (atmospheric pressure),  \nFinal pressure \\( P_2 = 2.0 \\times 10^{7} \\, \\text{N/m}^2 \\),  \nInitial volume \\( V_0 = 0.50 \\, \\text{m}^3 \\).  \n\nWe know,  \nBulk modulus of brass \\( B \\approx 6.1 \\times 10^{10} \\, \\text{N/m}^2 \\).  \n\nNow, by the definition of bulk modulus,  \n\\[\nB = - \\frac{\\Delta P}{\\Delta V / V_0}\n\\]  \nwhere \\( \\Delta P = P_2 - P_1 \\).  \n\nSubstituting,  \n\\[\n\\Delta P = 2.0 \\times 10^{7} - 1.0 \\times 10^{5} \\approx 1.99 \\times 10^{7} \\, \\text{N/m}^2\n\\]  \n\nThen,  \n\\[\n\\frac{\\Delta V}{V_0} = -\\frac{\\Delta P}{B}\n\\]  \n\\[\n\\Delta V = -V_0 \\frac{\\Delta P}{B}\n\\]  \n\nWe get,  \n\\[\n\\Delta V = -0.50 \\times \\frac{1.99 \\times 10^{7}}{6.1 \\times 10^{10}}\n\\]  \n\\[\n\\Delta V \\approx -1.631 \\times 10^{-4} \\, \\text{m}^3\n\\]  \n\nHence,  \nThe volume decreases by approximately \\( 1.63 \\times 10^{-4} \\, \\text{m}^3 \\).", "exam_f_question": "A solid aluminum cube with a volume of 0.20 m³ at the surface (atmospheric pressure = 1.01 × 10⁵ Pa) is lowered into a deep lake. At its maximum depth, the water pressure is 5.05 × 10⁶ Pa. Given that the bulk modulus of aluminum is 7.0 × 10¹⁰ Pa, calculate the change in the cube's volume at this depth.", "guided_mode_answer": "**Concept Explanation: Bulk Modulus and Volume Change**\n\n**Beginner Level:**\nImagine a material, like a sponge or a rubber ball. When you squeeze it (apply pressure), it gets smaller (its volume decreases). The **bulk modulus** is a number that tells us how hard it is to squeeze that material. A high bulk modulus means the material is very stiff and doesn't compress much (like a metal sphere). A low bulk modulus means it's easy to compress (like the sponge).\n\nThe formula connects three things:\n1.  **Bulk Modulus (B):** The material's \"stiffness\" to squeezing.\n2.  **Change in Pressure (ΔP):** How much harder you're squeezing.\n3.  **Fractional Volume Change (ΔV/V₀):** How much the volume shrinks compared to its original size.\n\n**Intermediate Level:**\nThe bulk modulus (B) is formally defined as the ratio of the **volumetric stress** (the increase in pressure, ΔP) to the **volumetric strain** (the resulting fractional decrease in volume, -ΔV/V₀). It measures a substance's resistance to uniform compression.\n\nThe defining equation is:\n\\[\nB = -\\frac{\\Delta P}{(\\Delta V / V_0)}\n\\]\nThe negative sign is crucial: a positive increase in pressure (ΔP > 0) causes a *decrease* in volume (ΔV < 0), making the ratio positive as required for B.\n\nTo find the actual volume change, we rearrange the formula:\n\\[\n\\Delta V = -V_0 \\frac{\\Delta P}{B}\n\\]\nThis shows the change depends directly on the original volume (V₀) and the pressure change (ΔP), and inversely on the material's stiffness (B). In the exam problem, the large bulk modulus of brass means even a large pressure increase results in a very tiny volume decrease.", "guided_f_question": "1.  In the formula for bulk modulus, \\( B = -\\frac{\\Delta P}{(\\Delta V / V_0)} \\), why is there a negative sign? What does it ensure about the value of B?\n2.  If the bulk modulus of a hypothetical material were twice that of brass, and it experienced the same pressure change starting from the same initial volume, how would the magnitude of its volume change compare?\n3.  The problem states the sphere is submerged in the ocean. The pressure increase (ΔP) used in the calculation is the difference between the final water pressure and the initial air pressure. Why don't we need to separately account for the pressure from the weight of the brass sphere itself?", "keywords": ["Bulk Modulus", "Pressure", "Volume Strain", "Compression", "Elasticity", "Volumetric Stress"]}
{"subject": "PHYS101", "question": "A bullet of mass $10 \\mathrm{~gm}$ strikes a ballistic pendulum of mass $2000 \\mathrm{~gm}$ . The center of mass of the pendulum rises a vertical distance of $0.12 \\mathrm{~m}$ . Assuming the bullet remains embedded in the pendulum, find its initial speed.", "marks": 3, "exam_mode_answer": "Here, its given that,  \nmass of bullet \\( m = 10 \\, \\text{gm} = 0.01 \\, \\text{kg} \\),  \nmass of pendulum \\( M = 2000 \\, \\text{gm} = 2 \\, \\text{kg} \\),  \nvertical rise of center of mass \\( h = 0.12 \\, \\text{m} \\).  \n\nWe know, after collision bullet and pendulum move together with speed \\( V \\).  \nBy conservation of energy for pendulum rise:  \n\\[\n\\frac{1}{2} (M+m) V^2 = (M+m) g h\n\\]  \n\\[\nV = \\sqrt{2 g h} = \\sqrt{2 \\times 9.8 \\times 0.12} \\approx 1.534 \\, \\text{m/s}\n\\]  \n\nNow, by conservation of momentum for collision:  \n\\[\nm u = (M+m) V\n\\]  \nSubstituting,  \n\\[\n0.01 \\times u = (2 + 0.01) \\times 1.534\n\\]  \n\\[\nu = \\frac{2.01 \\times 1.534}{0.01} \\approx 308.3 \\, \\text{m/s}\n\\]  \n\nHence, the initial speed of the bullet is about \\( 308 \\, \\text{m/s} \\).", "exam_f_question": "A bullet of mass 15 g is fired into a stationary wooden block of mass 1.5 kg suspended as a pendulum. After the bullet embeds itself, the block swings and its center of mass rises to a maximum height of 9.0 cm. Calculate the initial speed of the bullet. (Use g = 9.8 m/s²)", "guided_mode_answer": "This problem is a classic \"ballistic pendulum\" experiment used to find the speed of a fast-moving projectile. It cleverly combines two fundamental physics principles: conservation of momentum and conservation of energy, but they are applied to *different stages* of the event.\n\n**Stage 1: The Inelastic Collision (Momentum)**\nThe moment the bullet hits and sticks into the pendulum block, this is a **perfectly inelastic collision**. During this very short impact time, the only significant forces are internal between the bullet and block. External forces like gravity are negligible over this instant. Therefore, the total **momentum** of the system (bullet + block) is conserved *just before* and *just after* the collision.\n*   Before: Momentum = (mass of bullet * its speed) + (mass of block * 0).\n*   After: Momentum = (combined mass of bullet+block) * their new shared speed (V).\nWe set these equal to find V in terms of the bullet's unknown initial speed (u).\n\n**Stage 2: The Swing (Energy)**\nAfter the collision, the bullet-block combination is now a pendulum with an initial speed V. As it swings upward, gravity (an external conservative force) does work on it. During this swing, **mechanical energy is conserved** (if we ignore air resistance). The kinetic energy (KE) it has right after the collision is converted into gravitational potential energy (PE) at the highest point of the swing.\n*   At the bottom (just after collision): Energy = (1/2)*(combined mass)*V².\n*   At the highest point: Energy = (combined mass)*g*(height risen, h).\nWe set these equal to find V in terms of the measurable height h.\n\n**Connecting the Stages**\nWe use the energy stage (Stage 2) to calculate the numerical value of V from the given height. We then plug this V into the momentum equation from Stage 1 to solve for the bullet's original speed u. This two-step method allows us to measure a very high speed (u) using only measurements of mass and a small vertical height (h).", "guided_f_question": "1.  In the energy conservation step, we equated kinetic energy to potential energy. What crucial assumption are we making about the pendulum's swing when we use the formula (M+m)gh for the potential energy gain?\n2.  Why can we use conservation of momentum during the collision, even though gravity is acting on the system? What characteristic of the collision event justifies this?\n3.  If the bullet did NOT remain embedded but instead bounced back elastically from the block, which parts of the two-step solution (momentum equation, energy equation, or both) would have to be changed, and why?", "keywords": ["Conservation of Momentum", "Conservation of Energy", "Inelastic Collision", "Ballistic Pendulum", "Projectile Speed", "Kinetic Energy"]}
{"subject": "PHYS101", "question": "Establish the equation of continuity for an incompressible and non- viscous fluid flowing steadily through the tube. State Bernoulli's theorem and prove it for flow of fluid through the tube.", "marks": 5, "exam_mode_answer": "Here, its given that the fluid is incompressible and non-viscous, flowing steadily.  \nWe know, for an incompressible fluid, density ρ is constant.  \nNow, by the definition of mass conservation, the mass flow rate must be constant:  \nρ A₁ v₁ = ρ A₂ v₂.  \nSince ρ is constant,  \nA₁ v₁ = A₂ v₂.  \nThis is the equation of continuity: Av = constant.  \n\nBernoulli’s theorem states that for steady, incompressible, non-viscous flow, the total energy per unit volume remains constant along a streamline:  \nP + ½ ρ v² + ρ g h = constant.  \n\nTo prove it, consider a fluid element moving along a streamline.  \nWork done by pressure forces equals change in kinetic and potential energy.  \nWork done = P₁ A₁ dx₁ – P₂ A₂ dx₂ = (P₁ – P₂) dm/ρ.  \nChange in kinetic energy = ½ dm (v₂² – v₁²).  \nChange in potential energy = dm g (h₂ – h₁).  \nEquating work done to total energy change:  \n(P₁ – P₂) dm/ρ = ½ dm (v₂² – v₁²) + dm g (h₂ – h₁).  \nDividing by dm and rearranging,  \nP₁ + ½ ρ v₁² + ρ g h₁ = P₂ + ½ ρ v₂² + ρ g h₂.  \nHence, Bernoulli’s theorem is proved.", "exam_f_question": "A horizontal pipe of varying cross-section carries water. At a point where the pipe radius is 5 cm, the flow speed is 2 m/s. What is the flow speed at a point where the pipe radius narrows to 2 cm? Use the equation of continuity.", "guided_mode_answer": "Let's break down the core concepts from the exam answer.\n\n**1. The Equation of Continuity**\nThink of a river. Where the river is wide, the water flows slowly. Where it's narrow, like in a canyon, the water flows much faster. The equation of continuity (A₁v₁ = A₂v₂) is the mathematical rule for this. It says the product of the cross-sectional area (A) and the fluid speed (v) at one point in a pipe or stream must equal the product at any other point, *provided the fluid is incompressible* (like water) and the flow is steady. This is a direct result of the conservation of mass: the same amount of mass must flow into a section as flows out.\n\n**2. Bernoulli's Theorem**\nThis theorem explains the trade-off between different types of energy in a moving fluid. It states that for a steady, incompressible, non-viscous (frictionless) fluid, the sum of three energy terms per unit volume is constant along a streamline:\n*   **Pressure Energy (P):** The energy due to the fluid's internal pressure.\n*   **Kinetic Energy (½ρv²):** The energy due to the fluid's motion.\n*   **Potential Energy (ρgh):** The energy due to the fluid's height in a gravitational field.\n\n**The Proof in Simple Terms:**\nThe proof connects the work-energy principle to fluid flow. It considers a small \"packet\" of fluid moving along a streamline.\n*   **Work Done:** The fluid behind the packet pushes it forward (doing positive work), while the fluid ahead pushes back (doing negative work). The net work done on the packet comes from this pressure difference.\n*   **Energy Change:** This net work must cause a change in the packet's energy—either by speeding it up (changing kinetic energy) or lifting it (changing potential energy).\nBy mathematically equating the work done by pressure forces to the change in kinetic + potential energy, and simplifying, you arrive at Bernoulli's equation: P + ½ρv² + ρgh = constant.", "guided_f_question": "1.  In the equation of continuity, A₁v₁ = A₂v₂, what fundamental physical law is being applied, and why is it crucial that the fluid is *incompressible* for this simple form to hold?\n2.  In the proof of Bernoulli's theorem, the work done is calculated as (P₁ – P₂) dm/ρ. Can you explain the role of 'dm' (the mass element) and 'ρ' (density) in this expression? Why do we divide by density?\n3.  Bernoulli's equation shows that if the speed (v) of a fluid increases, the pressure (P) must decrease, assuming height (h) is constant. Can you describe a real-world observation or application that demonstrates this principle?", "keywords": ["Equation of Continuity", "Bernoulli's Theorem", "Incompressible Flow", "Steady Flow", "Non-viscous Fluid", "Streamline"]}
{"subject": "PHYS101", "question": "What is coefficient of viscosity? Derive an expression for Poiseuille's formula for fluid flow in a capillary tube.", "marks": 5, "exam_mode_answer": "Coefficient of viscosity (η) is the measure of a fluid's internal resistance to flow. It is defined as the tangential force per unit area required to maintain a unit velocity gradient between two parallel layers of fluid.\n\nConsider steady laminar flow through a horizontal capillary tube of radius R and length L under a pressure difference P. A fluid cylinder of radius r and length L is taken. The viscous drag force on its surface balances the pressure force.\n\nHere, its given that,\nPressure force = Pressure difference × Area = P × πr².\nWe know,\nViscous drag force = η × Area × velocity gradient = η × (2πrL) × (dv/dr).\n\nNow, by the definition of steady flow,\nPressure force = Viscous drag force.\nP πr² = – η (2πrL) (dv/dr).\nThe negative sign indicates v decreases as r increases.\n\nThen,\ndv = – (P / 2ηL) r dr.\nIntegrating from r = r to r = R, where v = 0 at r = R (no-slip condition):\n∫₀ᵛ dv = – (P / 2ηL) ∫_rᴿ r dr.\nWe get,\nv(r) = (P / 4ηL) (R² – r²).\n\nSimilarly, volume flow rate dQ through an annular ring of thickness dr is:\ndQ = v × 2πr dr = (P / 4ηL) (R² – r²) 2πr dr.\nIntegrating from r = 0 to r = R:\nQ = (πP / 2ηL) ∫₀ᴿ (R²r – r³) dr = (πP / 2ηL) [ (R²R²/2) – (R⁴/4) ].\nHence,\nQ = (πP R⁴) / (8ηL).\nThis is Poiseuille’s formula.", "exam_f_question": "A capillary tube of length 50 cm and radius 0.5 mm is connected to a pressure head that maintains a pressure difference of 2000 Pa. If the volume flow rate of a fluid through it is measured to be 1.57 x 10⁻⁷ m³/s, calculate the coefficient of viscosity of the fluid.", "guided_mode_answer": "**Beginner Explanation:**\nImagine you're trying to pour honey and then water. Honey flows slowly and sticks to the spoon, while water flows quickly. This \"thickness\" or internal stickiness of a fluid is called viscosity. The **coefficient of viscosity** is a number that measures this property. A high coefficient means the fluid is very viscous (like honey), and a low coefficient means it's runny (like water).\n\n**Intermediate Explanation (Poiseuille's Flow):**\nWhen a fluid like water flows steadily through a thin, straight pipe (a capillary tube), it doesn't all move at the same speed. The layer of fluid touching the pipe wall is stuck to it (no-slip condition) and has zero velocity. As you move toward the center of the pipe, the fluid moves faster, creating a parabolic velocity profile. Poiseuille's formula tells us exactly how much fluid (volume flow rate, Q) we get for a given pressure difference (P) pushing it through a tube of a certain length (L) and radius (R). The key insight from the derivation is that the flow rate depends most strongly on the tube's radius (Q ∝ R⁴). This means doubling the radius increases the flow rate by 16 times! The formula also shows that a more viscous fluid (higher η) will have a lower flow rate for the same pressure push.", "guided_f_question": "1. In the derivation, why is there a negative sign when we equate the pressure force to the viscous drag force (P πr² = – η (2πrL) (dv/dr))?\n2. The final formula is Q = (πP R⁴) / (8ηL). If the length of the tube (L) is doubled while keeping the pressure difference (P) constant, how does the volume flow rate (Q) change? What if the radius (R) is doubled?\n3. The no-slip condition states that the fluid velocity at the pipe wall (r = R) is zero. How would the derivation and the final parabolic velocity profile v(r) change if this condition was not true?", "keywords": ["Coefficient of Viscosity", "Laminar Flow", "Poiseuille's Law", "No-Slip Condition", "Velocity Gradient", "Volume Flow Rate"]}
{"subject": "PHYS101", "question": "Describe the Fraunhoffer diffraction at N parallel slits and also plot the intensity distribution curve in such type of diffraction.", "marks": 5, "exam_mode_answer": "In Fraunhofer diffraction by N parallel slits of equal width b and equal spacing a, the resultant intensity is the product of the single-slit diffraction pattern and the interference pattern from N slits. Here, its given that the path difference between waves from consecutive slits is a sinθ. We know the phase difference is β = (π/λ) a sinθ. Now, by the definition of the resultant amplitude from N coherent sources, it is proportional to (sin Nβ/2) / (sin β/2). The amplitude due to a single slit is proportional to (sin α)/α, where α = (π/λ) b sinθ. Substituting, the total intensity I is given by I = I₀ (sin α/α)² [ (sin Nβ/2) / (sin β/2) ]². The term (sin α/α)² gives the single-slit diffraction envelope. The term [ (sin Nβ/2) / (sin β/2) ]² gives sharp principal maxima at β = 2mπ, i.e., a sinθ = mλ, where m=0,±1,±2,... Between these, there are (N-1) minima and (N-2) secondary maxima. Hence, the intensity distribution curve shows sharp principal maxima of equal height within the broader single-slit envelope. The secondary maxima are much weaker, and their number increases with N.", "exam_f_question": "Explain how the intensity distribution pattern for a diffraction grating (with a large number of slits N) differs from that of a simple double-slit setup. Specifically, describe the changes in the principal maxima, secondary maxima, and the overall envelope.", "guided_mode_answer": "Let's break down the concept of diffraction from multiple slits step-by-step.\n\n**1. The Core Idea:**\nImagine you have several identical, very narrow, parallel slits (like a picket fence) illuminated by a single light source. Light waves spread out (diffract) from each slit and overlap on a distant screen. Where they overlap in step (in phase), they add up to create bright spots (maxima). Where they cancel out (out of phase), they create darkness (minima).\n\n**2. The Two Effects at Play:**\nThe final pattern is a combination of two effects:\n*   **Single-Slit Diffraction:** This acts as an \"envelope\" or overall brightness controller. Light from *within* each individual slit interferes with itself, creating a broad pattern where the central maximum is brightest, and it gets dimmer towards the sides.\n*   **Multi-Slit Interference:** This creates the fine, sharp details *within* that envelope. Waves *from different slits* interfere with each other. With many slits (N), this creates very sharp, bright principal maxima at specific angles, with many weak, dim secondary peaks in between.\n\n**3. The Mathematical Result (as seen in the answer):**\nThe total intensity `I` is: `I = I₀ * (Single-Slit Term) * (Multi-Slit Term)`\n*   **Single-Slit Term:** `(sin α / α)²` where `α` depends on the slit width `b`. This shapes the overall envelope.\n*   **Multi-Slit Term:** `[ sin(Nβ/2) / sin(β/2) ]²` where `β` depends on the slit separation `a`. This creates the sharp interference peaks.\n\n**4. Key Features of the Pattern:**\n*   **Principal Maxima:** Occur at angles where `a sinθ = mλ` (m = 0, ±1, ±2...). These are very bright and sharp. Their *height* is modulated by the single-slit envelope.\n*   **Minima & Secondary Maxima:** Between two principal maxima, there are `(N-1)` points of complete darkness (minima) and `(N-2)` very dim secondary maxima.\n*   **Effect of Increasing N:** As you increase the number of slits, the principal maxima become sharper and brighter, while the secondary maxima become relatively weaker and more numerous. This is the principle behind a **diffraction grating**.\n\n**Visualizing the Curve:**\nThe intensity plot (I vs. sinθ) looks like a broad, smooth hump (the single-slit envelope). Sitting on top of this hump are several extremely sharp, tall spikes (the principal maxima). Between these tall spikes, you can see many tiny, barely noticeable bumps (the secondary maxima).", "guided_f_question": "1. In the formula I = I₀ (sin α/α)² [ (sin Nβ/2) / (sin β/2) ]², what does the variable 'β' physically represent, and how is it related to the spacing between the slits?\n2. If the single-slit diffraction envelope has its first minimum at a certain angle, what happens to a principal maximum from the multi-slit term that would normally appear at that same angle?\n3. For a given wavelength λ and slit spacing a, the condition for a principal maximum is a sinθ = mλ. If you want to distinguish two very close wavelengths (like in a spectrometer), would you prefer a grating with a large N or a small N? Why?", "keywords": ["Fraunhofer Diffraction", "Diffraction Grating", "Principal Maxima", "Intensity Distribution", "Phase Difference", "Interference Pattern"]}
{"subject": "PHYS101", "question": "Obtain the fringe width for both bright and dark fringes in Young's double slit experiment.", "marks": 3, "exam_mode_answer": "Here, its given that two coherent sources \\( S_1 \\) and \\( S_2 \\) separated by distance \\( d \\) produce interference on a screen at distance \\( D \\) from the slits.  \nWe know, for a point \\( P \\) on the screen at distance \\( x \\) from the central maximum, the path difference is \\( \\Delta = S_2P - S_1P \\approx \\frac{x d}{D} \\).  \nNow, by the definition of bright fringe, \\( \\Delta = n\\lambda \\), where \\( n = 0,1,2,\\dots \\).  \nSubstituting, \\( \\frac{x_n d}{D} = n\\lambda \\), so \\( x_n = \\frac{n\\lambda D}{d} \\).  \nSimilarly, for dark fringe, \\( \\Delta = (2n-1)\\frac{\\lambda}{2} \\), giving \\( x'_n = \\frac{(2n-1)\\lambda D}{2d} \\).  \nThen, the separation between consecutive bright or dark fringes is the fringe width \\( \\beta \\).  \nWe get \\( \\beta = x_{n+1} - x_n = \\frac{(n+1)\\lambda D}{d} - \\frac{n\\lambda D}{d} \\).  \nHence, \\( \\beta = \\frac{\\lambda D}{d} \\), which is the same for both bright and dark fringes.", "exam_f_question": "In a Young's double slit experiment, the distance between the slits is halved while the screen distance and wavelength are kept constant. How does this change affect the fringe width? Justify your answer mathematically.", "guided_mode_answer": "Let's break down the concept of fringe width in Young's double slit experiment.\n\n**The Core Idea:** When light from two coherent, closely spaced slits overlaps, it creates a pattern of alternating bright and dark bands (fringes) on a screen. The **fringe width (β)** is the distance between the centers of two consecutive bright fringes (or two consecutive dark fringes).\n\n**How is it derived?**\n1.  **Path Difference:** For a point on the screen at a distance `x` from the center, the extra distance light from one slit travels compared to the other is approximately `(x * d) / D`, where `d` is the slit separation and `D` is the screen distance.\n2.  **Condition for Bright Fringe:** A bright fringe occurs when this path difference is a whole number of wavelengths (`nλ`). This gives the position of the `n`th bright fringe as `x_n = (nλD) / d`.\n3.  **Finding the Spacing:** The distance between the `(n+1)`th and the `n`th bright fringe is:\n    `β = x_(n+1) - x_n = [ ( (n+1)λD ) / d ] - [ (nλD) / d ] = (λD) / d`.\n    The same calculation for dark fringes yields the identical result.\n\n**Key Takeaway:** The formula `β = λD / d` tells us the fringe width is directly proportional to the wavelength (λ) and screen distance (D), and inversely proportional to the slit separation (d). This means fringes are wider for red light (longer λ) than blue, wider if the screen is moved farther, and narrower if the slits are placed closer together.", "guided_f_question": "1. What is the physical meaning of the path difference in the double slit experiment, and why must the light sources be coherent for a stable interference pattern?\n2. Using the formula β = λD/d, predict what would happen to the fringe width if the entire experiment was conducted underwater (where light has a shorter wavelength) instead of in air.\n3. For the third dark fringe from the central bright spot, what is the value of the path difference in terms of the wavelength (λ)?", "keywords": ["Interference", "Coherent Sources", "Path Difference", "Fringe Width", "Wavelength", "Constructive Interference"]}
{"subject": "PHYS101", "question": "In a Newton's rings experiment, the diameter of $12^{\\text{th}}$ dark ring changes from 1.40 to 1.27 cm as a liquid is introduced between the lens and the glass plate. Calculate the refractive index of the liquid.", "marks": 3, "exam_mode_answer": "Here, its given that,  \nDiameter of \\( 12^{\\text{th}} \\) dark ring in air, \\( D_{12} = 1.40 \\ \\text{cm} \\)  \nDiameter of \\( 12^{\\text{th}} \\) dark ring in liquid, \\( D'_{12} = 1.27 \\ \\text{cm} \\)  \n\nWe know,  \nFor dark ring in Newton’s rings,  \n\\[\nD_n^2 = 4n\\lambda R\n\\]\nin air, and  \n\\[\n(D'_n)^2 = \\frac{4n\\lambda R}{\\mu}\n\\]\nin liquid of refractive index \\( \\mu \\).  \n\nNow, by the definition,  \n\\[\n\\frac{D_n^2}{(D'_n)^2} = \\mu\n\\]\nsince \\( n, \\lambda, R \\) are same in both cases.  \n\nSubstituting,  \n\\[\n\\mu = \\frac{(1.40)^2}{(1.27)^2}\n\\]\n\nSimilarly,  \n\\[\n\\mu = \\frac{1.96}{1.6129}\n\\]\n\nWe get,  \n\\[\n\\mu \\approx 1.215\n\\]\n\nHence, the refractive index of the liquid is \\( 1.22 \\) (approx).", "exam_f_question": "In a Newton's rings experiment, the diameter of the 8th bright ring is measured as 0.80 cm in air. When a liquid is introduced, the diameter of the same ring changes to 0.60 cm. Calculate the refractive index of the liquid. (Assume the wavelength of light and radius of curvature of the lens remain constant.)", "guided_mode_answer": "**Beginner Explanation:**\nNewton's rings are a pattern of concentric bright and dark circles you see when you place a curved glass lens on a flat glass plate. This happens because light waves reflect off both surfaces—the bottom of the lens and the top of the plate—and interfere with each other. Where the waves add up (constructive interference), you see a bright ring. Where they cancel out (destructive interference), you see a dark ring. The diameter of these rings depends on the thickness of the air gap between the lens and the plate.\n\n**Intermediate Explanation:**\nThe experiment demonstrates interference by division of amplitude in a thin film (the air wedge). Monochromatic light is shone down onto a plano-convex lens resting on an optical flat. Light reflects from both the bottom surface of the lens and the top surface of the flat. These two reflected beams are coherent and interfere. The condition for a dark ring (destructive interference) is given by \\( 2\\mu t = n\\lambda \\), where \\( \\mu \\) is the refractive index of the medium in the gap, \\( t \\) is the thickness at that point, \\( n \\) is the ring order (0, 1, 2...), and \\( \\lambda \\) is the wavelength. For a lens of radius of curvature \\( R \\), the thickness \\( t \\) is related to the ring's radius \\( r \\) by \\( t \\approx r^2/(2R) \\). Combining these gives the formula \\( D_n^2 = 4n\\lambda R / \\mu \\) for the diameter \\( D_n \\) of the \\( n \\)-th dark ring. Introducing a liquid changes \\( \\mu \\) from 1 (air) to a higher value, which reduces the ring diameter for the same order \\( n \\), as seen in the problem.", "guided_f_question": "1. In the formula for the dark ring, \\( D_n^2 = 4n\\lambda R / \\mu \\), what does each symbol (\\(D_n\\), \\(n\\), \\(\\lambda\\), \\(R\\), \\(\\mu\\)) represent physically in the context of the experiment?\n2. Why does the diameter of a specific dark ring (e.g., the 12th) become smaller when air is replaced by a liquid? Explain using the relationship between optical path difference and refractive index.\n3. If you were to perform this experiment with light of a longer wavelength (e.g., red instead of green), how would the diameters of the rings change, assuming all other conditions remain the same? Would this affect the calculated refractive index?", "keywords": ["Interference", "Newton's Rings", "Refractive Index", "Optical Path Difference", "Thin Film", "Destructive Interference"]}
{"subject": "PHYS101", "question": "Establish the differential equation for forced or driven harmonic oscillation and solve it. Describe the condition for resonance and also sketch the nature of graph between amplitude and applied angular frequency.", "marks": 5, "exam_mode_answer": "Here, its given that the oscillator is driven by an external periodic force \\( F(t) = F_0 \\cos \\omega t \\).  \nWe know the equation of motion for a damped harmonic oscillator is \\( m\\ddot{x} + b\\dot{x} + kx = 0 \\).  \nNow, by the definition of forced oscillation, the external force is added to the right-hand side:  \n\\[ m\\ddot{x} + b\\dot{x} + kx = F_0 \\cos \\omega t. \\]  \nDividing by \\( m \\) and letting \\( \\gamma = b/(2m) \\), \\( \\omega_0^2 = k/m \\), and \\( f_0 = F_0/m \\), we get:  \n\\[ \\ddot{x} + 2\\gamma \\dot{x} + \\omega_0^2 x = f_0 \\cos \\omega t. \\]  \nFor the steady-state solution, we assume \\( x(t) = A \\cos(\\omega t - \\delta) \\).  \nSubstituting into the differential equation and comparing coefficients of \\( \\cos \\omega t \\) and \\( \\sin \\omega t \\) gives:  \n\\[ A = \\frac{f_0}{\\sqrt{(\\omega_0^2 - \\omega^2)^2 + 4\\gamma^2 \\omega^2}}, \\quad \\tan \\delta = \\frac{2\\gamma \\omega}{\\omega_0^2 - \\omega^2}. \\]  \nHence, the steady-state solution is \\( x(t) = A \\cos(\\omega t - \\delta) \\) with \\( A \\) and \\( \\delta \\) as above.  \n\nResonance occurs when the amplitude \\( A \\) is maximum. This happens at \\( \\omega_r = \\sqrt{\\omega_0^2 - 2\\gamma^2} \\) for underdamped systems.  \nThe graph of \\( A \\) vs. \\( \\omega \\) shows a peak at \\( \\omega_r \\), with the peak height decreasing and broadening as damping \\( \\gamma \\) increases. At \\( \\gamma = 0 \\), resonance is at \\( \\omega_0 \\) with amplitude theoretically infinite.", "exam_f_question": "A forced harmonic oscillator with damping constant \\( b \\) and natural frequency \\( \\omega_0 \\) is driven by a force \\( F(t) = F_0 \\sin(\\omega t) \\). Derive the expression for the phase difference \\( \\delta \\) between the driving force and the oscillator's displacement in the steady state. At what driving frequency \\( \\omega \\) is this phase difference exactly \\( \\pi/2 \\) radians?", "guided_mode_answer": "Let's break down the concept of a forced harmonic oscillator step-by-step.\n\n**1. The Core Idea:**\nImagine pushing a child on a swing. Your periodic pushes are the \"driving force.\" The swing has its own natural rhythm (natural frequency, \\( \\omega_0 \\)). Friction in the chains and air resistance provide \"damping\" (\\( \\gamma \\)). A forced harmonic oscillator is a mathematical model for this: a system (like a mass on a spring) that is periodically pushed while also experiencing friction.\n\n**2. The Governing Equation:**\nWe start with Newton's second law: Net Force = mass × acceleration.\n* **Restoring Force:** The spring pulls the mass back, proportional to displacement (\\( -kx \\)).\n* **Damping Force:** Friction opposes motion, proportional to velocity (\\( -b\\dot{x} \\)).\n* **Driving Force:** The external, periodic push (\\( F_0 \\cos \\omega t \\)).\n\nAdding these gives the equation of motion:\n\\[ m\\ddot{x} + b\\dot{x} + kx = F_0 \\cos \\omega t \\]\nThis is the differential equation for a forced, damped harmonic oscillator.\n\n**3. The Steady-State Solution:**\nAfter the initial transient motions die down due to damping, the system settles into a \"steady state.\" It oscillates at the **driving frequency** \\( \\omega \\), not necessarily its own natural frequency. The solution has the form:\n\\[ x(t) = A \\cos(\\omega t - \\delta) \\]\n* **Amplitude (A):** How big the oscillations are. It depends on \\( \\omega_0, \\omega, \\gamma, \\) and \\( F_0 \\).\n* **Phase Constant (δ):** A delay between the driving force and the system's response. The system's motion lags behind the push.\n\n**4. Resonance - The Special Condition:**\nResonance is when the driving frequency \\( \\omega \\) matches the system's preferred frequency, causing a maximum response (amplitude). For a lightly damped system, this happens near \\( \\omega_0 \\). The exact resonant frequency is \\( \\omega_r = \\sqrt{\\omega_0^2 - 2\\gamma^2} \\).\n* **Effect of Damping:** Higher damping (\\( \\gamma \\)) makes the resonance peak lower, broader, and shifts it slightly to a lower frequency.\n* **Graph (A vs. ω):** The graph is a curve with a peak at \\( \\omega_r \\). For zero damping (\\( \\gamma = 0 \\)), the peak is infinitely high and infinitely sharp at \\( \\omega_0 \\). As damping increases, the peak shrinks and widens.", "guided_f_question": "1.  In the equation \\( m\\ddot{x} + b\\dot{x} + kx = F_0 \\cos \\omega t \\), what physical quantity does each term represent (e.g., \\( m\\ddot{x} \\) is the inertial force)? What is the role of the term on the right-hand side?\n2.  The steady-state solution is \\( x(t) = A \\cos(\\omega t - \\delta) \\). Why does the oscillation frequency in the steady state equal the driving frequency \\( \\omega \\), and not the system's natural frequency \\( \\omega_0 \\)?\n3.  Looking at the amplitude formula \\( A = \\frac{f_0}{\\sqrt{(\\omega_0^2 - \\omega^2)^2 + 4\\gamma^2 \\omega^2}} \\), what happens to the amplitude \\( A \\) when the driving frequency \\( \\omega \\) is much smaller than the natural frequency \\( \\omega_0 \\)? What about when \\( \\omega \\) is much larger than \\( \\omega_0 \\)?", "keywords": ["Forced Oscillation", "Damping Coefficient", "Natural Frequency", "Steady-State Solution", "Resonance", "Phase Lag"]}
{"subject": "PHYS101", "question": "Obtain the differential equation for damped harmonic oscillation and solve it. Discuss the following conditions: (i) over damping (ii) critical damping (iii) under damping", "marks": 5, "exam_mode_answer": "Here, its given that the damping force is proportional to velocity, \\(F_d = -b v\\).  \nWe know the restoring force is \\(F_s = -k x\\).  \nNow, by the definition of Newton’s second law,  \n\\[\nm \\frac{d^2 x}{dt^2} = -k x - b \\frac{dx}{dt}.\n\\]  \nSubstituting \\(\\omega_0^2 = \\frac{k}{m}\\) and \\(2\\beta = \\frac{b}{m}\\),  \n\\[\n\\frac{d^2 x}{dt^2} + 2\\beta \\frac{dx}{dt} + \\omega_0^2 x = 0.\n\\]  \nSimilarly, assuming a solution \\(x = A e^{\\lambda t}\\), the auxiliary equation is  \n\\[\n\\lambda^2 + 2\\beta \\lambda + \\omega_0^2 = 0.\n\\]  \nThen, \\(\\lambda = -\\beta \\pm \\sqrt{\\beta^2 - \\omega_0^2}\\).  \nWe get three cases:  \n(i) Over damping (\\(\\beta > \\omega_0\\)): Two real negative roots, motion decays slowly without oscillation.  \n(ii) Critical damping (\\(\\beta = \\omega_0\\)): Repeated real root, fastest return to equilibrium without oscillation.  \n(iii) Under damping (\\(\\beta < \\omega_0\\)): Complex roots, solution \\(x = A e^{-\\beta t} \\cos(\\omega' t + \\phi)\\) with \\(\\omega' = \\sqrt{\\omega_0^2 - \\beta^2}\\), giving oscillatory decay.  \nHence, the general solution describes all three damping regimes.", "exam_f_question": "A critically damped oscillator with mass m = 2.0 kg and damping constant b = 8.0 N·s/m is displaced from equilibrium. What is the spring constant k for this system to be critically damped? Using this value of k, if the initial displacement is x₀ = 0.1 m and initial velocity is zero, write down the specific equation of motion x(t).", "guided_mode_answer": "Let's break down the concept of damped harmonic motion step-by-step.\n\n**1. The Core Idea:**\nImagine a block on a spring, our classic simple harmonic oscillator. Now, let's put it in a thick fluid like honey. As it moves, the fluid resists (or \"damps\") its motion. Damped harmonic motion is the study of how this resistive force changes the oscillator's behavior.\n\n**2. The Forces at Play:**\nThree main forces act on the mass:\n*   **Restoring Force (F_s):** From the spring, always pulling/pushing the mass back toward equilibrium. F_s = -k x.\n*   **Damping Force (F_d):** From the fluid (or friction), opposing the velocity. We model it as proportional to speed: F_d = -b v.\n*   **Net Force:** By Newton's 2nd Law (F_net = m a), these combine: m a = -k x - b v.\n\n**3. The Differential Equation:**\nSince acceleration a = d²x/dt² and velocity v = dx/dt, we get:\nm (d²x/dt²) = -k x - b (dx/dt)\nRearranging gives the standard form:\n**d²x/dt² + (b/m)(dx/dt) + (k/m)x = 0**\nTo simplify, we define:\n*   **ω₀ = √(k/m)**: The \"natural frequency\" (how fast it would oscillate with no damping).\n*   **β = b/(2m)**: The \"damping constant\" (how strong the damping is).\nThe equation becomes the clean, final form:\n**d²x/dt² + 2β(dx/dt) + ω₀²x = 0**\n\n**4. Solving & The Three Cases:**\nWe guess a solution of the form x = e^(λt). Substituting leads to the **characteristic equation**: λ² + 2βλ + ω₀² = 0.\nThe roots are: **λ = -β ± √(β² - ω₀²)**.\nThe behavior depends entirely on what's under the square root: **(β² - ω₀²)**.\n\n*   **Overdamping (β > ω₀):** The roots are real, negative, and different. Solution: x(t) = A₁e^(λ₁t) + A₂e^(λ₂t). The system slowly creeps back to equilibrium **without ever oscillating**. Think of a door closer that prevents slamming.\n\n*   **Critical Damping (β = ω₀):** The roots are real, negative, and equal. Solution: x(t) = (A + Bt)e^(-βt). The system returns to equilibrium **in the shortest possible time without oscillating**. This is the ideal for car shock absorbers or galvanometer needles.\n\n*   **Underdamping (β < ω₀):** The roots are complex. Solution: x(t) = A e^(-βt) cos(ω't + φ), where ω' = √(ω₀² - β²) is the **damped frequency**. The system oscillates with an **amplitude that decays exponentially** over time. Think of a ringing bell that slowly fades out.", "guided_f_question": "1.  In the equation of motion, what does the term `2β(dx/dt)` physically represent, and why is it written with a positive sign in front of it when the damping force itself is negative?\n2.  For an underdamped oscillator, the solution is `x(t) = A e^(-βt) cos(ω't + φ)`. What is the physical meaning of the constant `A` in this context? Is it simply the initial displacement?\n3.  In the characteristic equation `λ² + 2βλ + ω₀² = 0`, the quantity under the square root is `β² - ω₀²`. Why does comparing `β` and `ω₀` (the damping constant vs. natural frequency) determine the system's physical behavior?", "keywords": []}
{"subject": "PHYS101", "question": "The radiation emitted by a star is 10,000 times more than that of the sun. If the surface temperature of the sun and the star is 6000 K and 2000 K respectively. Calculate the ratio of the radii of the star and the sun.", "marks": 3, "exam_mode_answer": "Here, its given that,  \n\\[\n\\frac{P_{\\text{star}}}{P_{\\text{sun}}} = 10,000, \\quad T_{\\text{sun}} = 6000\\ \\text{K}, \\quad T_{\\text{star}} = 2000\\ \\text{K}.\n\\]  \nWe know, by Stefan–Boltzmann law,  \n\\[\nP = \\sigma A T^4 = \\sigma (4\\pi R^2) T^4.\n\\]  \nNow, by the definition of the ratio,  \n\\[\n\\frac{P_{\\text{star}}}{P_{\\text{sun}}} = \\frac{R_{\\text{star}}^2 T_{\\text{star}}^4}{R_{\\text{sun}}^2 T_{\\text{sun}}^4}.\n\\]  \nSubstituting the given values,  \n\\[\n10,000 = \\frac{R_{\\text{star}}^2}{R_{\\text{sun}}^2} \\times \\frac{(2000)^4}{(6000)^4}.\n\\]  \nSimilarly,  \n\\[\n\\frac{R_{\\text{star}}^2}{R_{\\text{sun}}^2} = 10,000 \\times \\frac{(6000)^4}{(2000)^4} = 10,000 \\times 3^4.\n\\]  \nThen,  \n\\[\n\\frac{R_{\\text{star}}^2}{R_{\\text{sun}}^2} = 10,000 \\times 81 = 810,000.\n\\]  \nWe get,  \n\\[\n\\frac{R_{\\text{star}}}{R_{\\text{sun}}} = \\sqrt{810,000} = 900.\n\\]  \nHence, the ratio of the radii of the star to the sun is \\(900\\).", "exam_f_question": "A star has a luminosity 64 times greater than our Sun. If the surface temperature of the star is half that of the Sun (which is 6000 K), what is the ratio of the star's radius to the Sun's radius?", "guided_mode_answer": "Let's break down the core concept: the Stefan-Boltzmann Law. This law tells us how much total energy an object, like a star, radiates per second. This energy output is called **luminosity** or power (P).\n\nThe law states: **Luminosity depends on two things: the object's surface area and its surface temperature.**\n\n1.  **Temperature (T):** The hotter the surface, the more intensely it glows. The relationship is incredibly strong—luminosity is proportional to temperature raised to the *fourth* power (T⁴). Doubling the temperature increases the energy output by a factor of 2⁴ = 16.\n\n2.  **Surface Area (A):** For a spherical star, the surface area is 4πR², where R is the radius. A bigger star has more surface area to emit light from, so luminosity is directly proportional to R².\n\nCombining these, the full formula is:\n**P = σ × (4πR²) × T⁴**\n(where σ is a constant, so we often ignore it when comparing ratios).\n\nIn the exam problem, we are comparing two stars (the Sun and another star). When we take the ratio P_star / P_sun, the constants (σ and 4π) cancel out. We are left with a comparison based only on their sizes and temperatures:\n**(P_star / P_sun) = (R_star / R_sun)² × (T_star / T_sun)⁴**\n\nWe are given the power ratio (10,000) and both temperatures. We plug these in to solve for the one unknown: the radius ratio (R_star / R_sun).", "guided_f_question": "1.  The problem states the star's radiation is 10,000 times the Sun's. In the formula P = σ A T⁴, what does the variable 'P' represent? What are the two main stellar properties that 'P' depends on?\n2.  We form the ratio: P_star / P_sun = (R_star² / R_sun²) × (T_star⁴ / T_sun⁴). Why do the constants σ and 4π disappear when we create this ratio of the two power equations?\n3.  You've substituted the values to get: 10,000 = (R_star² / R_sun²) × (2000⁴ / 6000⁴). What is the numerical value of the temperature ratio part, (2000/6000)⁴, before we solve for the radius ratio?", "keywords": ["Stefan-Boltzmann Law", "Luminosity", "Surface Temperature", "Radius", "Blackbody Radiation", "Power"]}
{"subject": "PHYS101", "question": "Light traveling in water strikes a glass plate at an angle of incidence of $53^{\\circ}$ , part of the beam is reflected. If the reflected and refracted portions make an angle of $90^{\\circ}$ with each other, what is the index of refraction of the glass?", "marks": 3, "exam_mode_answer": "Here, its given that,  \nAngle of incidence \\( i = 53^\\circ \\) (in water),  \nAngle between reflected and refracted rays \\( = 90^\\circ \\).  \n\nWe know,  \nThe reflected ray makes angle \\( i \\) with the normal,  \nthe refracted ray makes angle \\( r \\) with the normal,  \nand the angle between reflected and refracted rays is \\( i + r = 90^\\circ \\).  \n\nNow, by the definition of Brewster’s law,  \nwhen reflected and refracted rays are perpendicular,  \n\\( i = \\theta_p \\) (polarizing angle) and  \n\\( \\tan \\theta_p = \\frac{n_2}{n_1} \\).  \n\nSubstituting,  \n\\( i + r = 90^\\circ \\) ⇒ \\( r = 90^\\circ - 53^\\circ = 37^\\circ \\).  \n\nFrom Snell’s law:  \n\\( n_1 \\sin i = n_2 \\sin r \\),  \nwith \\( n_1 = 1.33 \\) (water), \\( i = 53^\\circ \\), \\( r = 37^\\circ \\).  \n\nThen,  \n\\( n_2 = n_1 \\frac{\\sin i}{\\sin r} = 1.33 \\times \\frac{\\sin 53^\\circ}{\\sin 37^\\circ} \\).  \n\nWe get,  \n\\( \\sin 53^\\circ \\approx 0.7986 \\), \\( \\sin 37^\\circ \\approx 0.6018 \\),  \n\\( \\frac{0.7986}{0.6018} \\approx 1.327 \\),  \n\\( n_2 \\approx 1.33 \\times 1.327 \\approx 1.765 \\).  \n\nHence,  \nIndex of refraction of glass \\( \\approx 1.77 \\).", "exam_f_question": "A light ray traveling in air strikes a block of flint glass at an angle of incidence of 58.0°. The reflected ray and the refracted ray are observed to be perpendicular to each other. Calculate the index of refraction of the flint glass.", "guided_mode_answer": "**Concept Explanation: Brewster's Angle**\n\nLet's break down the core idea from the problem.\n\n**Beginner Level:**\nImagine shining a flashlight into a window. Some light bounces back (reflection), and some goes through (refraction). Normally, these two beams come off at different angles. However, there is one special angle where the reflected beam and the refracted beam form a perfect right angle (90°). This special angle of incidence is called **Brewster's angle**.\n\nAt this angle, something interesting happens: the reflected light becomes **polarized**, meaning its electric field vibrates in only one direction (parallel to the surface).\n\n**Intermediate Level:**\nThe condition for Brewster's angle is derived from geometry and Snell's Law.\n1.  **Geometry:** The angle of reflection equals the angle of incidence (*i*). The angle of refraction is *r*. If the reflected and refracted rays are perpendicular, then *i + r = 90°* (because all angles around the point add up to 180°, and the normal takes 90°).\n2.  **Snell's Law:** This governs refraction: *n₁ sin(i) = n₂ sin(r)*.\n3.  **The Brewster's Law Formula:** If *r = 90° - i*, then sin(r) = sin(90° - i) = cos(i). Substituting into Snell's Law gives: *n₁ sin(i) = n₂ cos(i)*. Rearranging yields the key formula:\n    **tan(i) = n₂ / n₁**\n    Here, *i* is Brewster's angle (*θₚ*), *n₁* is the index of the first medium, and *n₂* is the index of the second medium.\n\nIn the exam problem, the 90° condition immediately tells us we are dealing with Brewster's angle. We used *i + r = 90°* to find *r*, then applied Snell's Law. Alternatively, we could have directly used Brewster's Law: *n_glass = n_water * tan(53°)*.", "guided_f_question": "1.  In the problem, we found the angle of refraction *r* to be 37°. Using the geometry of the situation, can you explain why the relationship *i + r = 90°* is true when the reflected and refracted rays are perpendicular?\n2.  The solution mentions Brewster's Law: tan(θₚ) = n₂/n₁. Starting from the two conditions we have (Snell's Law and *i + r = 90°*), can you perform the algebra to derive this formula?\n3.  Using the direct Brewster's Law formula (tan(θₚ) = n₂/n₁) with n₁=1.33 and θₚ=53°, calculate n₂. Does it match the answer obtained via the Snell's Law method in the original solution?", "keywords": ["Refraction", "Reflection", "Brewster's Angle", "Snell's Law", "Index of Refraction", "Polarization"]}
{"subject": "PHYS101", "question": "Establish the Newton's second law of motion for the system of a variable mass. Show that for a rocket system $M_f = M_0 \\exp (-v_f / v_{\\text{rel}})$ , where the symbols have their usual meanings", "marks": 5, "exam_mode_answer": "Here, its given that the rocket has initial mass \\(M_0\\) and final mass \\(M_f\\), with exhaust speed \\(v_{\\text{rel}}\\) relative to the rocket.  \nWe know Newton’s second law for variable mass is  \n\\[\nF_{\\text{ext}} = \\frac{dp}{dt} = M\\frac{dv}{dt} + v_{\\text{rel}}\\frac{dM}{dt},\n\\]  \nwhere \\(v\\) is rocket velocity and \\(\\frac{dM}{dt} < 0\\).  \n\nNow, for a rocket in free space, \\(F_{\\text{ext}} = 0\\).  \nThen,  \n\\[\nM\\frac{dv}{dt} = - v_{\\text{rel}}\\frac{dM}{dt}.\n\\]  \nSeparating variables,  \n\\[\ndv = - v_{\\text{rel}} \\frac{dM}{M}.\n\\]  \nIntegrating from initial velocity 0 to final velocity \\(v_f\\) and mass \\(M_0\\) to \\(M_f\\),  \n\\[\n\\int_{0}^{v_f} dv = - v_{\\text{rel}} \\int_{M_0}^{M_f} \\frac{dM}{M}.\n\\]  \nWe get  \n\\[\nv_f = - v_{\\text{rel}} \\left[ \\ln M \\right]_{M_0}^{M_f} = v_{\\text{rel}} \\ln\\left( \\frac{M_0}{M_f} \\right).\n\\]  \nHence,  \n\\[\n\\frac{M_f}{M_0} = \\exp\\left( -\\frac{v_f}{v_{\\text{rel}}} \\right) \\quad \\text{or} \\quad M_f = M_0 \\exp\\left( -\\frac{v_f}{v_{\\text{rel}}} \\right).\n\\]", "exam_f_question": "A rocket of initial mass M₀ is launched vertically upwards from Earth's surface. The rocket engine ejects exhaust gases at a constant speed u relative to the rocket, at a constant mass ejection rate α (so dM/dt = -α). Derive an expression for the velocity of the rocket v(t) as a function of time, taking gravity (g) into account. Assume g is constant and air resistance is negligible.", "guided_mode_answer": "**Beginner Explanation:**\nThink of a rocket. As it flies, it burns fuel and ejects hot gas out the back. This means the rocket's total mass (rocket body + remaining fuel) is constantly decreasing. Newton's Second Law (F=ma) in its simple form assumes mass is constant. For a rocket, we need a special version of this law that can handle changing mass.\n\nThe key idea is momentum. The rocket gains forward momentum, while the ejected exhaust gas carries away backward momentum. The modified law states: The net external force (like gravity) acting on the system equals the rate of change of the rocket's momentum PLUS the momentum carried away by the ejected mass.\n\n**Intermediate Explanation & Derivation:**\nWe consider the rocket and its fuel as our system. In a short time dt:\n1.  The rocket's mass changes from M to M + dM (where dM is *negative* because mass is lost).\n2.  Its velocity changes from v to v + dv.\n3.  It ejects a small mass -dM (a positive quantity) at an exhaust velocity **v_rel** *relative to the rocket*.\n\nThe total momentum of the system (rocket + exhaust) at time t is: p(t) = Mv.\nAt time t+dt:\n*   Rocket momentum: (M + dM)(v + dv)\n*   Exhaust momentum: (-dM)(v - v_rel)  (The exhaust's absolute velocity is v - v_rel).\n\nThe change in momentum dp = p(t+dt) - p(t). After simplifying and neglecting the very small term dM*dv, we get:\ndp = M dv + v_rel dM.\n\nNewton's Second Law says the net external force F_ext equals the rate of change of momentum: F_ext = dp/dt.\nTherefore: **F_ext = M (dv/dt) + v_rel (dM/dt)**. This is the variable mass rocket equation.\n\nFor a rocket in deep space (F_ext = 0), this simplifies to: M dv = - v_rel dM.\nIntegrating this from initial state (v=0, M=M₀) to final state (v=v_f, M=M_f) gives the famous **Tsiolkovsky rocket equation**:\n**v_f = v_rel * ln(M₀ / M_f)** or equivalently, **M_f = M₀ * exp(-v_f / v_rel)**.\nThis shows why rockets need so much fuel—to achieve high final speed (v_f), you need an exponentially larger initial mass (M₀) for a given exhaust speed (v_rel).", "guided_f_question": "1.  In the derivation of the variable mass equation, we wrote the exhaust's velocity as (v - v_rel). Why is it subtracted, and what would the equation look like if the exhaust were ejected in the same direction as the rocket's motion?\n2.  The final equation M_f = M₀ exp(-v_f / v_rel) was derived assuming no external forces (F_ext = 0). What major real-world force is neglected in this assumption for a rocket launched from Earth, and how would its presence change the final velocity for the same amount of fuel burned?\n3.  Looking at the integrated result v_f = v_rel * ln(M₀/M_f), if a rocket's exhaust speed (v_rel) doubles, does the final velocity (v_f) also double? Explain why or why not using the structure of the equation.", "keywords": ["Variable Mass System", "Rocket Equation", "Tsiolkovsky Rocket Equation", "Exhaust Velocity", "Momentum", "Thrust"]}
{"results": [{"subject": "EDRG 101", "question": "A thin circular disc of 50 mm diameter is allowed to roll without slipping from upper edge of sloping plank which is inclined at 15° with the horizontal plane. Draw the curve traced by the point on the circumference of the disc.", "keywords": ["cycloid", "rolling without slipping", "inclined plane", "locus of a point", "engineering graphics"], "marks": 6, "exam_mode_answer": "The curve traced is a cycloid on an inclined plane.\n\nProcedure:\n1. Draw the sloping plank AB inclined at 15° to horizontal. Mark starting point A at top edge.\n2. Draw the disc with center O and diameter 50 mm (radius 25 mm). Mark a point P on circumference at starting position (typically at bottom).\n3. Divide the disc circumference into 12 equal parts (30° each) and number divisions 1,2,...,12.\n4. Project these divisions horizontally to get points on the base line of the cycloid.\n5. As disc rolls without slipping, the center O moves parallel to the inclined plank. Draw path of O parallel to AB.\n6. Divide path of O into 12 equal parts (O1, O2,..., O12).\n7. With each center O1, O2,..., draw arcs of radius 25 mm.\n8. From each division point on circumference, draw lines parallel to AB to intersect corresponding arc. These intersections give cycloid points.\n9. Join points with smooth curve to get inclined cycloid.\n\nKey points: Curve is not a standard cycloid due to inclination. The generating circle rolls along inclined line, not horizontal. The curve will be elongated along the incline.", "exam_f_question": "A circular disc of 60 mm diameter rolls without slipping along a straight line. A point P is located at a distance of 15 mm from the center of the disc. Draw the path traced by point P for one complete revolution of the disc. Name the curve.", "guided_mode_answer": "Purpose: To find and draw the path (locus) of a specific point on a rolling disc. This is fundamental for understanding motion in mechanisms.\n\nProcedure:\nStep 1 – Understand the Setup: We have a disc rolling down a slope. 'Without slipping' means the disc rotates exactly as it moves forward. The point on the rim will trace a special curve called a cycloid, but modified because the surface is sloped.\n\nStep 2 – Initial Drawing: Draw the inclined plank (a straight line at 15°). Draw the disc at the starting position at the top. Clearly mark the point on the rim you are tracking (e.g., the point touching the plank at the start).\n\nStep 3 – Break the Motion: Imagine the disc making a small roll. The motion has two parts: (a) The center of the disc moves straight down the slope. (b) The disc rotates about its center. The point's position is the sum of these two motions.\n\nStep 4 – Construction Method:\n- Divide one full rotation of the disc into equal parts (say, 12 parts of 30° each).\n- Mark where the disc's center would be after each small movement down the slope (points O1, O2, O3...).\n- For each center position (O1, O2...), imagine the disc has also rotated. Locate your tracked point relative to that center.\n- Plot each of these calculated positions.\n\nStep 5 – Finalize: Connect all the plotted points with a smooth, continuous curve. This is the required path.\n\nRemember: The curve will look like a series of arches, but stretched along the direction of the slope.", "guided_f_question": "1. Why is the condition 'rolling without slipping' so important for this construction?\n2. What are the standard steps (conventions) for constructing a cycloid or related curve in engineering drawing?\n3. In an exam, how would you start the drawing if the paper size and scale are given?"}]}
{"subject": "CHEM 101", "question": "Define azeotrope mixture. Show that $\\Delta T = K_{f}m$\nThe freezing point depression constant for mercuric chloride, $HgCl_{2}$ , is 34.3. for a solution of $0.849\\mathrm{gm}$ of mercurous chloride, (empirical formula $HgCl$ ) in $50\\mathrm{gm}$ of $HgCl_{2}$ , the freezing point depression is $1.24^{\\circ}\\mathrm{C}$ . What is the molecular weight of mercurous chloride in this solution? What is its molecular formula?", "marks": 6, "exam_mode_answer": "Here, its given that,\n$\\Delta T = 1.24^{\\circ}\\mathrm{C}$,\n$K_f = 34.3\\ \\mathrm{K\\ kg\\ mol^{-1}}$,\nMass of solute $(w) = 0.849\\ \\mathrm{g}$,\nMass of solvent $= 50\\ \\mathrm{g} = 0.050\\ \\mathrm{kg}$.\n\nWe know,\nFreezing point depression $\\Delta T_f = K_f \\cdot m$,\nwhere $m$ is molality.\n\nNow, by the definition of molality,\n$m = \\frac{\\text{moles of solute}}{\\text{mass of solvent in kg}} = \\frac{w/M}{W}$,\nwhere $M$ is the molar mass of solute.\n\nSubstituting,\n$\\Delta T_f = K_f \\cdot \\frac{w/M}{W}$.\n\nThen,\n$M = \\frac{K_f \\cdot w}{\\Delta T_f \\cdot W}$.\n\nWe get,\n$M = \\frac{34.3 \\times 0.849}{1.24 \\times 0.050} = \\frac{29.1207}{0.062} \\approx 469.7\\ \\mathrm{g\\ mol^{-1}}$.\n\nHence, the molecular weight of mercurous chloride in this solution is about $470\\ \\mathrm{g/mol}$.\n\nEmpirical formula $= \\mathrm{HgCl}$,\nEmpirical formula weight $= 200.6 + 35.5 = 236.1\\ \\mathrm{g/mol}$.\n$n = \\frac{\\text{Molecular weight}}{\\text{Empirical weight}} = \\frac{470}{236.1} \\approx 2$.\n\nThus, the molecular formula is $\\mathrm{(HgCl)_2} = \\mathrm{Hg_2Cl_2}$.\n\nAn azeotrope mixture is a liquid mixture that boils at a constant temperature and has the same composition in vapour as in the liquid phase.", "exam_f_question": "A solution of 2.15 g of a non-electrolyte solute in 100 g of benzene (C₆H₆) causes a freezing point depression of 0.56 °C. Given the freezing point depression constant (K_f) for benzene is 5.12 °C kg mol⁻¹, calculate the molar mass of the solute.", "guided_mode_answer": "**Concept Explanation: Azeotropes and Colligative Properties**\n\n**Azeotrope Mixture:**\nAn azeotrope is a special type of liquid mixture that behaves like a pure substance during boiling. When you heat an azeotropic mixture, it boils at a constant, specific temperature, and the vapor produced has the exact same composition as the liquid. This makes it impossible to separate the components by simple distillation. A common example is a mixture of approximately 95% ethanol and 5% water.\n\n**Freezing Point Depression (ΔT = K_f * m):**\nThis is a colligative property, meaning it depends only on the *number* of solute particles, not their identity.\n*   **ΔT:** The amount the freezing point is lowered (in °C or K).\n*   **K_f:** The Freezing Point Depression Constant. This is a unique value for each solvent (e.g., for water it's 1.86 °C kg/mol). It tells you how much 1 mole of particles will lower the freezing point of 1 kg of that solvent.\n*   **m:** Molality, the concentration in moles of solute per kilogram of solvent (mol/kg).\n\n**Why the formula works:** When a non-volatile solute is added to a solvent, it disrupts the orderly arrangement of solvent molecules needed to form a solid. The solution must be cooled to a lower temperature for the solvent molecules to overcome this disruption and freeze. The more solute particles present (higher molality, *m*), the greater the disruption and the larger the freezing point drop (ΔT). The constant *K_f* is the proportionality factor that relates them.\n\n**Connecting to the Problem:** In the exam answer, we used ΔT = K_f * m to find the molality of the mercurous chloride solution. Then, using the definition of molality (moles of solute / kg of solvent), we worked backwards to find the molar mass of the unknown solute. Comparing this calculated molar mass to the mass from its simplest (empirical) formula revealed its true molecular formula.", "guided_f_question": "1.  The problem states the empirical formula is HgCl. If the calculated molar mass was approximately 236 g/mol instead of ~470 g/mol, what would the molecular formula be, and what would that tell you about the compound's structure in solution?\n2.  In the step where you calculated molar mass, you divided by the mass of solvent in kg (0.050 kg). What would be the effect on your final calculated molar mass if you accidentally used the solvent mass in grams (50 g) instead of kilograms in the formula M = (K_f * w) / (ΔT * W)?\n3.  The constant K_f for the solvent HgCl₂ is given as 34.3. This is a very large value compared to common solvents like water (1.86) or benzene (5.12). What does the magnitude of K_f tell you about the sensitivity of this particular solvent's freezing point to the addition of a solute?", "keywords": ["Azeotrope", "Colligative Properties", "Freezing Point Depression", "Molality", "Empirical Formula", "Molecular Formula"]}
{"subject": "CHEM 101", "question": "State first law of thermodynamics. Show that $w_{free} > w_{rev}$ .\nCalculate the change in entropy that occurs when a sample containing $2.0\\mathrm{moles}$ of water is heated from $50.0^{\\circ}\\mathrm{C}$ to $150.0^{\\circ}\\mathrm{C}$ at $1\\mathrm{atm}$ pressure. The molar heat capacities for $H_{2}O(l)$ and $H_{2}O(g)$ are $18.0\\mathrm{Cal}K^{-1}\\mathrm{mol}^{-1}$ and $8.7\\mathrm{Cal}K^{-1}\\mathrm{mol}^{-1}$ , respectively, and the enthalpy of vaporization for water is $9.7\\mathrm{kCal / mol}$ at $100^{\\circ}\\mathrm{C}$ .", "marks": 6, "exam_mode_answer": "The first law of thermodynamics states that energy cannot be created or destroyed; the change in internal energy of a system is equal to the heat added to the system minus the work done by the system: $\\Delta U = q - w$.\n\nFor work, $w_{rev}$ is maximum work. In any irreversible (free) expansion against lower constant external pressure, less work is obtained than the maximum possible reversible work. Hence, $w_{free} > w_{rev}$ is incorrect; actually $w_{rev} > w_{free}$. The correct relation is $|w_{rev}| > |w_{free}|$ for expansion work done by the system.\n\nFor entropy change of 2.0 moles water from 50.0°C to 150.0°C at 1 atm:\nHere, its given that,\n$C_{p,m}(l) = 18.0 \\ \\mathrm{Cal \\ K^{-1} mol^{-1}}$, $C_{p,m}(g) = 8.7 \\ \\mathrm{Cal \\ K^{-1} mol^{-1}}$, $\\Delta H_{vap} = 9700 \\ \\mathrm{Cal/mol}$ at 373 K.\nWe know $\\Delta S = n C_p \\ln(T_2/T_1)$ for heating at constant pressure, and $\\Delta S = n \\Delta H_{vap}/T$ for phase change at constant T.\nNow, by the definition,\nStep 1: Heat liquid from 323 K to 373 K.\n$\\Delta S_1 = 2.0 \\times 18.0 \\times \\ln(373/323) = 36.0 \\times \\ln(1.1548) = 36.0 \\times 0.1440 = 5.184 \\ \\mathrm{Cal/K}$.\nStep 2: Vaporize at 373 K.\n$\\Delta S_2 = 2.0 \\times 9700 / 373 = 19400 / 373 = 52.01 \\ \\mathrm{Cal/K}$.\nStep 3: Heat vapor from 373 K to 423 K.\n$\\Delta S_3 = 2.0 \\times 8.7 \\times \\ln(423/373) = 17.4 \\times \\ln(1.1340) = 17.4 \\times 0.1258 = 2.189 \\ \\mathrm{Cal/K}$.\nTotal $\\Delta S = \\Delta S_1 + \\Delta S_2 + \\Delta S_3 = 5.184 + 52.01 + 2.189 = 59.383 \\ \\mathrm{Cal/K}$.\nHence, the entropy change is $59.4 \\ \\mathrm{Cal/K}$.", "exam_f_question": "Calculate the total enthalpy change (ΔH) for the process of heating 2.0 moles of water from 50.0°C to 150.0°C at 1 atm pressure, using the same given data for heat capacities and enthalpy of vaporization.", "guided_mode_answer": "**Beginner Explanation:**\nThe first law of thermodynamics is like an energy accounting system. It says the total energy in the universe is constant; you can't create or destroy it, only change its form. For a specific system (like a gas in a piston), the change in its internal energy (ΔU) equals the heat energy flowing in (q) minus the work energy flowing out (w). Think of it as: Change in stored energy = Energy in - Energy out.\n\nThe statement \"w_free > w_rev\" from the question is a common trick. \"rev\" means reversible, a slow, idealized process that gets the maximum possible useful work out. \"free\" or irreversible expansion is fast and wasteful, like gas bursting into a vacuum—it does little to no useful work. Therefore, for work done *by* the system (like an expanding gas), the reversible work is actually the *greatest*: |w_rev| > |w_free|. The original question contains an error.\n\n**Intermediate Explanation:**\nThe first law, ΔU = q - w, is a statement of energy conservation for thermodynamic systems. The sign convention is crucial: 'w' is work done *by* the system on the surroundings. For an expansion, w is positive, meaning the system loses energy by doing work.\n\nThe comparison of work terms hinges on the path. A reversible process is a theoretical limit where the system is in near-perfect equilibrium with its surroundings at every infinitesimal step. This path maximizes the work output (for expansion) or minimizes the work input (for compression). Any real, irreversible process (like free expansion against a constant lower pressure) is less efficient. Therefore, for an expansion where work is done *by* the system, the magnitude of reversible work is greater: w_rev (a larger positive number) > w_free. The inequality in the question is backwards.\n\nThe entropy calculation demonstrates how to find the total disorder change for a complex, multi-step process. Entropy (S) increases with temperature and during phase changes like vaporization. The total ΔS is the sum of the changes for each step: heating the liquid, the vaporization itself (ΔH_vap/T), and heating the vapor. The large positive result (59.4 Cal/K) confirms the process is highly spontaneous and irreversible under the given conditions.", "guided_f_question": "1. In the entropy calculation, why must we use the *molar* heat capacity (Cp,m) and not just the heat capacity (Cp) of the sample? What is the relationship between them?\n2. The formula for entropy change during heating, ΔS = nCp ln(T2/T1), is only valid under a specific condition. What is that condition, and why is it necessary?\n3. During the phase change step, we used ΔS = ΔH_vap / T. Why is the temperature fixed at 373 K (100°C) for this calculation, and what does this imply about the vaporization process?", "keywords": ["First Law of Thermodynamics", "Reversible Process", "Entropy", "Enthalpy of Vaporization", "Heat Capacity", "Phase Change"]}
{"subject": "CHEM 101", "question": "Define reaction rate. Derive integrated rate law for the reaction that follows second order kinetics.\nA mixture of $KBr$ and $NaBr$ weighing $0.560\\mathrm{gm}$ was treated with aqueous $Ag^{+}$ and all the bromide ion was recovered as $0.970\\mathrm{gm}$ of pure $AgBr$ . What was the fraction by weight of $KBr$ in the original sample?", "marks": 6, "exam_mode_answer": "Reaction rate is defined as the change in concentration of a reactant or product per unit time. For a second-order reaction where rate depends on the square of the concentration of a single reactant A, the differential rate law is: rate = -d[A]/dt = k[A]².  \nHere, its given that,  \n-d[A]/dt = k[A]².  \nWe know,  \nRearranging: d[A]/[A]² = -k dt.  \nNow, by the definition of integration, integrating from initial concentration [A]₀ at t=0 to [A] at time t:  \n∫_{[A]₀}^{[A]} d[A]/[A]² = -k ∫_{0}^{t} dt.  \nSubstituting,  \nWe get, -1/[A] + 1/[A]₀ = -kt.  \nSimilarly, multiplying by -1 gives:  \n1/[A] - 1/[A]₀ = kt.  \nHence, the integrated rate law is 1/[A] = kt + 1/[A]₀.  \n\nFor the mixture problem:  \nLet mass of KBr = x g, mass of NaBr = (0.560 – x) g.  \nMolar masses: KBr = 119.0 g/mol, NaBr = 102.9 g/mol, AgBr = 187.8 g/mol.  \nMoles of Br⁻ from KBr = x/119.0, from NaBr = (0.560 – x)/102.9.  \nTotal moles Br⁻ = moles AgBr = 0.970/187.8 = 0.005165 mol.  \nThus, x/119.0 + (0.560 – x)/102.9 = 0.005165.  \nSolving: (102.9x + 119.0×0.560 – 119.0x) / (119.0×102.9) = 0.005165.  \n(66.64 – 16.1x) = 0.005165 × 12248.1 = 63.26.  \nThen, 66.64 – 63.26 = 16.1x → 3.38 = 16.1x → x = 0.210 g.  \nFraction by weight of KBr = 0.210/0.560 = 0.375.", "exam_f_question": "A reaction A → B is found to be second order with respect to A. If the initial concentration of A is 0.800 M and the rate constant k is 0.050 M⁻¹s⁻¹, calculate the concentration of A after 50.0 seconds. Also, determine the time required for the concentration of A to decrease to one-fourth of its initial value.", "guided_mode_answer": "Let's break down the two main parts of the original question.\n\n**Part 1: Reaction Rate & Integrated Rate Law**\n*   **Reaction Rate:** Think of it as the \"speed\" of a chemical reaction. It measures how fast reactants are being used up or how fast products are being formed. We usually track this by watching the change in concentration (moles per liter) over time.\n*   **Second-Order Kinetics:** This is a specific \"speed rule.\" For a reaction where one reactant (A) turns into products, if doubling the amount of A makes the reaction four times faster, it follows second-order kinetics. The rate is proportional to the square of A's concentration.\n*   **Derivation:** We start with the rule: Rate = k[A]². Since rate is also the decrease in [A] over time (-d[A]/dt), we write: **-d[A]/dt = k[A]²**.\n    *   **Step 1 (Rearrange):** We separate the variables ([A] on one side, time (t) on the other): **d[A]/[A]² = -k dt**.\n    *   **Step 2 (Integrate):** We sum up (integrate) these tiny changes from the start (time=0, concentration=[A]₀) to a later time (time=t, concentration=[A]).\n    *   **Step 3 (Solve):** The integral of 1/[A]² is -1/[A]. Doing the math gives the final, useful formula: **1/[A] = kt + 1/[A]₀**. This lets you find [A] at any time if you know k and the starting point.\n\n**Part 2: Mixture Problem (Stoichiometry)**\nThis is a chemistry puzzle using mole concepts.\n1.  **Goal:** Find the mass of KBr in a mixed sample.\n2.  **Clue:** All bromide (Br⁻) from both KBr and NaBr ends up in a known mass of AgBr.\n3.  **Strategy:**\n    *   Let the mass of KBr = x g. Then mass of NaBr = (0.560 - x) g.\n    *   Find moles of Br⁻ from each salt using their molar masses (KBr: 119.0 g/mol, NaBr: 102.9 g/mol).\n    *   These moles add up to the total moles of Br⁻, which must equal the moles of AgBr formed (AgBr: 187.8 g/mol).\n    *   Set up the equation: **(x / 119.0) + ((0.560 - x) / 102.9) = 0.970 / 187.8**\n    *   Solve for x. The fraction is then **x / 0.560**.", "guided_f_question": "1.  For the integrated rate law 1/[A] = kt + 1/[A]₀, what would a plot of 1/[A] (y-axis) versus time (t, x-axis) look like for a second-order reaction? What does the slope represent, and what does the y-intercept represent?\n2.  In the mixture problem, why is it valid to assume that the moles of Br⁻ from the original sample equal the moles of AgBr precipitated? What fundamental chemical principle allows us to make this connection?\n3.  If the reaction in the derivation was second order overall but involved two different reactants (e.g., rate = k[A][B]), could we use the same integrated rate law (1/[A] = kt + 1/[A]₀)? Why or why not?", "keywords": ["Reaction Rate", "Second-Order Kinetics", "Integrated Rate Law", "Stoichiometry", "Molar Mass", "Precipitation Reaction"]}
{"subject": "CHEM 101", "question": "Differentiate between reversible and irreversible process. Show that entropy of the universe for an irreversible process always increases.\nFor the reaction: $C_{2}H_{5}I + OH^{-} \\rightarrow C_{2}H_{5}OH + I^{-}$ , $k = 5.03 \\times 10^{-2}M^{-1}sec^{-1}$ at $289\\mathrm{K}$ and $k = 6.71M^{-1}sec^{-1}$ at $333\\mathrm{K}$ . What is the activation energy of the reaction? What is its rate constant at $305\\mathrm{K}$ ?", "marks": 6, "exam_mode_answer": "Here, it is given that for the reaction \\( C_{2}H_{5}I + OH^{-} \\rightarrow C_{2}H_{5}OH + I^{-} \\),  \n\\( k_{1} = 5.03 \\times 10^{-2} \\, M^{-1}s^{-1} \\) at \\( T_{1} = 289 \\, K \\) and  \n\\( k_{2} = 6.71 \\, M^{-1}s^{-1} \\) at \\( T_{2} = 333 \\, K \\).  \n\nWe know the Arrhenius equation in two-point form:  \n\\[\n\\ln \\frac{k_{2}}{k_{1}} = \\frac{E_{a}}{R} \\left( \\frac{1}{T_{1}} - \\frac{1}{T_{2}} \\right)\n\\]  \nSubstituting the values:  \n\\[\n\\ln \\frac{6.71}{5.03 \\times 10^{-2}} = \\frac{E_{a}}{8.314} \\left( \\frac{1}{289} - \\frac{1}{333} \\right)\n\\]  \n\\[\n\\ln (133.4) = \\frac{E_{a}}{8.314} \\left( 0.003460 - 0.003003 \\right)\n\\]  \n\\[\n4.894 = \\frac{E_{a}}{8.314} \\times 4.57 \\times 10^{-4}\n\\]  \n\\[\nE_{a} = \\frac{4.894 \\times 8.314}{4.57 \\times 10^{-4}} = 8.90 \\times 10^{4} \\, J/mol = 89.0 \\, kJ/mol\n\\]  \n\nNow to find \\( k \\) at \\( T = 305 \\, K \\), using \\( k_{1} = 5.03 \\times 10^{-2} \\) at \\( T_{1} = 289 \\, K \\):  \n\\[\n\\ln \\frac{k}{5.03 \\times 10^{-2}} = \\frac{8.90 \\times 10^{4}}{8.314} \\left( \\frac{1}{289} - \\frac{1}{305} \\right)\n\\]  \n\\[\n= 10706 \\times (0.003460 - 0.003279) = 10706 \\times 1.81 \\times 10^{-4} = 1.938\n\\]  \n\\[\n\\frac{k}{5.03 \\times 10^{-2}} = e^{1.938} = 6.947\n\\]  \n\\[\nk = 6.947 \\times 5.03 \\times 10^{-2} = 0.349 \\, M^{-1}s^{-1}\n\\]  \n\nHence, activation energy \\( E_{a} = 89.0 \\, kJ/mol \\) and rate constant at \\( 305 \\, K \\) is \\( 0.349 \\, M^{-1}s^{-1} \\).", "exam_f_question": "For the same reaction, if the rate constant is measured to be 0.125 M⁻¹s⁻¹ at 298 K, what would be the expected rate constant at 315 K? (Use the activation energy calculated in the original problem).", "guided_mode_answer": "Let's break down the core concepts from the exam answer.\n\n**1. The Arrhenius Equation:** This equation describes how the rate constant (k) of a reaction depends on temperature (T) and activation energy (Ea). The most common form is:\n   k = A * e^(-Ea/(RT))\n   Where:\n   * k = rate constant\n   * A = frequency factor (pre-exponential factor)\n   * Ea = activation energy (the minimum energy needed for a reaction to occur)\n   * R = ideal gas constant (8.314 J/mol·K)\n   * T = temperature in Kelvin\n\n**2. The Two-Point Form:** Since 'A' is often unknown, we use a rearranged form to compare rate constants at two different temperatures:\n   ln(k₂/k₁) = (Ea/R) * (1/T₁ - 1/T₂)\n   This is the formula used in the solution. It allows us to calculate Ea if we know k at two temperatures, or to find k at a new temperature if we know Ea.\n\n**3. Understanding the Calculation Steps:**\n   * **Step 1: Set up the equation** with the two known (k, T) pairs to solve for the unknown Ea.\n   * **Step 2: Calculate the ratio k₂/k₁** and find its natural logarithm (ln).\n   * **Step 3: Calculate the temperature difference term** (1/T₁ - 1/T₂). Remember to use temperatures in Kelvin.\n   * **Step 4: Solve for Ea** by rearranging the equation: Ea = [ln(k₂/k₁) * R] / (1/T₁ - 1/T₂).\n   * **Step 5: Use the calculated Ea** with one of the original (k, T) points and the new temperature in the same two-point formula to solve for the new rate constant.\n\nThe key is careful substitution and paying close attention to units (especially ensuring Ea is in J/mol when using R=8.314 J/mol·K).", "guided_f_question": "1. What is the physical significance of the activation energy (Ea) in a chemical reaction, and how does it relate to the reaction rate?\n2. In the two-point Arrhenius equation ln(k₂/k₁) = (Ea/R) * (1/T₁ - 1/T₂), why is it crucial to express the temperature in units of Kelvin (K) rather than Celsius (°C)?\n3. If the activation energy for a reaction were higher, how would that affect the change in the rate constant when the temperature is increased? (Would it be more sensitive or less sensitive to temperature change?)", "keywords": ["Activation Energy", "Arrhenius Equation", "Rate Constant", "Chemical Kinetics", "Temperature Dependence", "Two-Point Form"]}
{"subject": "CHEM 101", "question": "State LeChatelier's principle and explain the effect of temperature for the following reaction.\n$N_{2}(g) + O_{2}(g) \\rightleftharpoons 2NO \\quad \\Delta H = 43.5 \\mathrm{kcal}$\nHydrogen and iodine react at $699^{\\circ}\\mathrm{K}$ according to\n$H_{2}(g) + I_{2}(g) \\rightleftharpoons 2HI(g)$\nIf $1.00\\mathrm{mole}$ of $H_{2}$ and $1.00\\mathrm{mole}$ of $I_{2}$ are placed in a $1.00$ - liter vessel and allowed to react, what weight of hydrogen iodide will be present at equilibrium? (At $699^{\\circ}\\mathrm{K}$ , $K = 55.3$ , Atomic weight of Iodine = $126.9$ )", "marks": 6, "exam_mode_answer": "Le Chatelier's principle states that if a system at equilibrium is subjected to a change in concentration, pressure, or temperature, the equilibrium shifts so as to counteract the effect of that change. For the reaction \\(N_{2}(g) + O_{2}(g) \\rightleftharpoons 2NO\\) with \\(\\Delta H = +43.5 \\mathrm{kcal}\\) (endothermic), an increase in temperature favors the forward reaction (produces more NO) to absorb the added heat, while a decrease in temperature favors the reverse reaction.\n\nFor \\(H_{2}(g) + I_{2}(g) \\rightleftharpoons 2HI(g)\\) at \\(699 \\mathrm{~K}\\) with \\(K = 55.3\\):\nInitial moles: \\([H_2] = 1.00\\), \\([I_2] = 1.00\\), \\([HI] = 0\\) in \\(1.00 \\mathrm{~L}\\) vessel.\nLet \\(x\\) moles of \\(H_2\\) react. At equilibrium:\n\\([H_2] = 1 - x\\), \\([I_2] = 1 - x\\), \\([HI] = 2x\\).\nEquilibrium constant:\n\\[\nK = \\frac{[HI]^2}{[H_2][I_2]} = \\frac{(2x)^2}{(1-x)(1-x)} = \\frac{4x^2}{(1-x)^2} = 55.3\n\\]\nTaking square root:\n\\[\n\\frac{2x}{1-x} = \\sqrt{55.3} \\approx 7.436\n\\]\n\\[\n2x = 7.436(1-x)\n\\]\n\\[\n2x = 7.436 - 7.436x\n\\]\n\\[\n9.436x = 7.436\n\\]\n\\[\nx \\approx 0.788\n\\]\nThus, moles of \\(HI\\) at equilibrium = \\(2x = 1.576 \\mathrm{~mol}\\).\nMolar mass of \\(HI = 1 + 126.9 = 127.9 \\mathrm{~g/mol}\\).\nWeight of \\(HI = 1.576 \\times 127.9 \\approx 201.6 \\mathrm{~g}\\).", "exam_f_question": "For the same reaction \\(H_{2}(g) + I_{2}(g) \\rightleftharpoons 2HI(g)\\) at \\(699^{\\circ}\\mathrm{K}\\), if the initial concentrations are changed to \\(2.00 \\mathrm{~M}\\) \\(H_{2}\\) and \\(1.00 \\mathrm{~M}\\) \\(I_{2}\\) in a \\(1.00\\)-liter vessel, calculate the equilibrium concentration of \\(HI\\). (Use \\(K = 55.3\\))", "guided_mode_answer": "This problem involves applying the equilibrium constant (K) to calculate the amount of product formed. The key steps are:\n1.  **Set up an ICE table** (Initial, Change, Equilibrium) to track molar concentrations.\n2.  **Define the change (x)** as the amount of reactant that reacts.\n3.  **Write the equilibrium expression** using the equilibrium concentrations from the ICE table.\n4.  **Substitute into the K expression** and solve for x.\n5.  **Use x to find** the requested equilibrium quantity (moles or concentration of HI).\n6.  **Convert moles to mass** using the molar mass.\n\nThe symmetry of the initial conditions (equal starting amounts of H₂ and I₂) simplifies the math because the equilibrium expression becomes a perfect square, allowing us to take a square root to solve for x easily.", "guided_f_question": "1.  What would be the first step in solving this problem after writing the balanced equation? (Hint: It involves organizing the known information about amounts at the start, change, and at equilibrium).\n2.  In the equilibrium expression \\(K = \\frac{[HI]^2}{[H_2][I_2]}\\), why is the concentration of HI squared?\n3.  If the calculated value of x was greater than 1.00, what would that tell you about your setup or calculation, and why is it impossible in this specific problem?", "keywords": ["Le Chatelier's Principle", "Equilibrium Constant (K)", "ICE Table", "Reaction Quotient", "Endothermic Reaction", "Equilibrium Concentration"]}
{"subject": "CHEM 101", "question": "Give reasonable explanations for the following.\nAcid base indicators respond to the change in pH of a solution.\nAqueous solution of a nonvolatile solute boils at greater than $100^{\\circ}\\mathrm{C}$ at 1 atm pressure.\nDifferential rate law is helpful to predict reaction mechanism.", "marks": 6, "exam_mode_answer": "Acid base indicators are weak organic acids or bases whose conjugate acid and base forms have different colors. Here, it is given that the indicator equilibrium is \\(\\mathrm{HIn} \\rightleftharpoons \\mathrm{H}^{+} + \\mathrm{In}^{-}\\). We know that according to the Henderson-Hasselbalch equation, the ratio \\([\\mathrm{In}^{-}]/[\\mathrm{HIn}]\\) depends on the pH of the solution. Now, by the definition of the indicator's color change, the perceived color is determined by this ratio. Substituting different pH values, the ratio changes significantly over a narrow pH range (the transition interval). Hence, the indicator responds to a change in pH by shifting its equilibrium, altering the color of the solution.\n\nFor the boiling point elevation, we know that at \\(100^{\\circ}\\mathrm{C}\\) and 1 atm, the vapor pressure of pure water equals atmospheric pressure. Here, it is given that a nonvolatile solute is added. According to Raoult's law, this lowers the vapor pressure of the solution. Then, to boil, the solution must be heated to a temperature where its vapor pressure again reaches 1 atm. We know that vapor pressure increases with temperature. Substituting the condition, a higher temperature than \\(100^{\\circ}\\mathrm{C}\\) is required for the solution's vapor pressure to equal the external pressure. Hence, the aqueous solution boils at a temperature greater than \\(100^{\\circ}\\mathrm{C}\\).\n\nThe differential rate law expresses the instantaneous rate of reaction as a function of reactant concentrations. Here, its given form, \\(\\text{rate} = k[A]^m[B]^n\\), provides the orders \\(m\\) and \\(n\\). We know these experimental orders must match the exponents of the concentration terms in the slow, rate-determining step of a proposed mechanism. Now, by comparing the differential rate law with the rate law derived from a postulated mechanism, one can test the mechanism's validity. Substituting different mechanistic steps, only those consistent with the experimental rate law are plausible. Hence, the differential rate law is a critical tool for predicting or corroborating a reaction mechanism.", "exam_f_question": "A common acid-base indicator, phenolphthalein, is colorless in acidic solution and pink in basic solution. Using the equilibrium HIn ⇌ H⁺ + In⁻, explain why the color change occurs over a specific pH range (approximately 8.2-10.0 for phenolphthalein) rather than at a single precise pH value.", "guided_mode_answer": "**Beginner Explanation:**\nThink of an acid-base indicator like a special dye that acts as a chemical spy. It's a weak acid (or base) that exists in two forms: one form has one color (like red) and the other form has a different color (like blue). The spy changes its appearance based on the \"acidity\" (pH) of its surroundings. In a very acidic solution (lots of H⁺ ions), the equilibrium is pushed to favor the \"acid form\" (HIn), so you see its color (red). In a very basic solution (very few H⁺ ions), the equilibrium is pushed to favor the \"base form\" (In⁻), so you see that color (blue). The change happens over a small range because your eye needs a noticeable mix of the two colors to see the transition.\n\n**Intermediate Explanation:**\nAn acid-base indicator (HIn) is a weak acid whose conjugate base (In⁻) has a different color. Its behavior is governed by the equilibrium: HIn(aq) ⇌ H⁺(aq) + In⁻(aq) and the associated acid dissociation constant, Ka = [H⁺][In⁻]/[HIn]. The color perceived depends on the ratio [In⁻]/[HIn]. According to the Henderson-Hasselbalch equation, pH = pKa + log([In⁻]/[HIn]). When pH << pKa, [HIn] >> [In⁻] and the acid color dominates. When pH >> pKa, [In⁻] >> [HIn] and the base color dominates. The human eye typically detects a color change when the ratio of the two colored forms is between 1:10 and 10:1, which corresponds to a pH range of pKa ± 1. This is the indicator's transition interval.", "guided_f_question": "1. If the pKa of a certain indicator is 5.0, what is the approximate pH range over which you would expect to observe its color change?\n2. How would adding a nonvolatile solute to water affect the vapor pressure above the solution at a fixed temperature (e.g., 100°C), and why does this lead to boiling point elevation?\n3. For a reaction with the differential rate law: rate = k [A]², what can you infer about the molecularity (number of molecules involved) of the slow, rate-determining step in its mechanism?", "keywords": ["Acid-Base Indicator", "Equilibrium Constant (Ka)", "Vapor Pressure", "Raoult's Law", "Differential Rate Law", "Reaction Mechanism"]}
{"subject": "CHEM 101", "question": "Balance the following redox reactions using half-reaction method.\n$Zn + NO_3^- \\xrightarrow{} Zn^{++} + NH_4^+$ (in basic medium)\n$CuS + NO_3^- \\xrightarrow{} Cu^{++} + SO_4^{2-} + NO$ (in acidic medium)", "marks": 6, "exam_mode_answer": "Here, its given that,  \nFor basic medium: \\( Zn + NO_3^- \\rightarrow Zn^{++} + NH_4^+ \\)  \nWe know,  \nOxidation half: \\( Zn \\rightarrow Zn^{2+} + 2e^- \\)  \nReduction half: \\( NO_3^- + 6H_2O + 8e^- \\rightarrow NH_4^+ + 8OH^- \\)  \n\nNow, by balancing electrons, multiply oxidation by 4:  \n\\( 4Zn \\rightarrow 4Zn^{2+} + 8e^- \\)  \nAdding both half-reactions:  \n\\( 4Zn + NO_3^- + 6H_2O \\rightarrow 4Zn^{2+} + NH_4^+ + 8OH^- \\)  \n\nThen, since medium is basic, add \\( 8OH^- \\) to both sides to cancel \\( OH^- \\) on right:  \n\\( 4Zn + NO_3^- + 6H_2O + 8OH^- \\rightarrow 4Zn^{2+} + NH_4^+ + 8OH^- + 8OH^- \\)  \nBut \\( 8OH^- \\) on right becomes \\( 8OH^- \\) from reaction plus 8 more, so adjust: actually, the balanced reaction in basic medium is:  \n\\( 4Zn + NO_3^- + 6H_2O \\rightarrow 4Zn^{2+} + NH_4^+ + 8OH^- \\)  \n\nSimilarly, for acidic medium: \\( CuS + NO_3^- \\rightarrow Cu^{2+} + SO_4^{2-} + NO \\)  \nWe know,  \nOxidation: \\( CuS + 4H_2O \\rightarrow Cu^{2+} + SO_4^{2-} + 8H^+ + 8e^- \\)  \nReduction: \\( NO_3^- + 4H^+ + 3e^- \\rightarrow NO + 2H_2O \\)  \n\nNow, by balancing electrons (LCM 24): multiply oxidation by 3, reduction by 8:  \n\\( 3CuS + 12H_2O \\rightarrow 3Cu^{2+} + 3SO_4^{2-} + 24H^+ + 24e^- \\)  \n\\( 8NO_3^- + 32H^+ + 24e^- \\rightarrow 8NO + 16H_2O \\)  \n\nAdding:  \n\\( 3CuS + 8NO_3^- + 12H_2O + 32H^+ \\rightarrow 3Cu^{2+} + 3SO_4^{2-} + 8NO + 16H_2O + 24H^+ \\)  \n\nSimplify \\( H_2O \\) and \\( H^+ \\):  \n\\( 3CuS + 8NO_3^- + 8H^+ \\rightarrow 3Cu^{2+} + 3SO_4^{2-} + 8NO + 4H_2O \\)  \n\nHence, balanced equations:  \nBasic: \\( 4Zn + NO_3^- + 6H_2O \\rightarrow 4Zn^{2+} + NH_4^+ + 8OH^- \\)  \nAcidic: \\( 3CuS + 8NO_3^- + 8H^+ \\rightarrow 3Cu^{2+} + 3SO_4^{2-} + 8NO + 4H_2O \\)", "exam_f_question": "Balance the following redox reaction using the half-reaction method: $MnO_4^- + SO_3^{2-} \\rightarrow Mn^{2+} + SO_4^{2-}$ (in acidic medium).", "guided_mode_answer": "Balancing redox reactions using the half-reaction method is a systematic way to ensure mass (atoms) and charge are conserved. The core idea is to split the reaction into two parts: one where a species loses electrons (oxidation) and one where a species gains electrons (reduction). You balance each half-reaction separately for atoms and charge, then combine them so the electrons lost equal the electrons gained.\n\n**Key Steps:**\n1.  **Assign Oxidation States:** Identify which atoms are oxidized (increase in oxidation state) and reduced (decrease in oxidation state).\n2.  **Write Skeleton Half-Reactions:** Write separate equations for the oxidation and reduction processes.\n3.  **Balance Atoms (except O and H):** Balance all elements other than oxygen and hydrogen.\n4.  **Balance Oxygen Atoms:** Add H₂O molecules to the side needing oxygen.\n5.  **Balance Hydrogen Atoms:**\n    *   In **acidic** medium: Add H⁺ ions to the side needing hydrogen.\n    *   In **basic** medium: First balance as if in acid (using H⁺ and H₂O). Then, for every H⁺ present, add an equal number of OH⁻ ions to *both sides*. Combine H⁺ and OH⁻ on the same side to form H₂O, and simplify.\n6.  **Balance Charge:** Add electrons (e⁻) to the more positive side to balance the total charge on both sides.\n7.  **Equalize Electron Transfer:** Multiply one or both half-reactions by integers so the number of electrons lost equals the number gained.\n8.  **Add and Simplify:** Add the two balanced half-reactions, canceling electrons and any species (like H₂O or H⁺/OH⁻) that appear on both sides.\n\nThe provided exam answer demonstrates this process for one reaction in basic medium and one in acidic medium.", "guided_f_question": "1.  In the balanced basic medium reaction from the answer, \\(4Zn + NO_3^- + 6H_2O \\rightarrow 4Zn^{2+} + NH_4^+ + 8OH^-\\), which side of the final equation has a greater total charge, and how do you know the reaction is still charge-balanced?\n2.  For the acidic medium reaction, the reduction half-reaction was given as \\(NO_3^- + 4H^+ + 3e^- \\rightarrow NO + 2H_2O\\). Walk through the steps (balancing O, H, and charge) to derive this half-reaction from the skeleton \\(NO_3^- \\rightarrow NO\\).\n3.  In the final step for the acidic reaction, the answer shows simplification of H⁺ and H₂O. Starting from the combined equation before simplification: \\(3CuS + 8NO_3^- + 12H_2O + 32H^+ \\rightarrow 3Cu^{2+} + 3SO_4^{2-} + 8NO + 16H_2O + 24H^+\\), show the arithmetic for canceling the common water molecules and hydrogen ions to arrive at the final net equation.", "keywords": ["Redox Reaction", "Half-Reaction Method", "Oxidation State", "Acidic Medium", "Basic Medium", "Electron Transfer"]}
{"subject": "CHEM 101", "question": "Explain briefly on (ANY THREE) of the following\nElectrochemical theory of rusting of iron\nSolution that displays positive deviation from Raoult's law\nCollision theory of gaseous reactions\nCharacteristics of chemical equilibria\nFuel cell and its benefits.", "marks": 9, "exam_mode_answer": "Electrochemical theory of rusting of iron explains corrosion as an electrochemical process. Here, its given that rusting requires the presence of water and oxygen. We know that iron acts as an anode. Now, by the definition of oxidation, at the anode, iron loses electrons: Fe(s) → Fe²⁺(aq) + 2e⁻. Similarly, at the cathode, which is another part of the same iron surface, oxygen gains electrons in the presence of water: O₂(g) + 2H₂O(l) + 4e⁻ → 4OH⁻(aq). Substituting the ionic products, the Fe²⁺ and OH⁻ ions react to form ferrous hydroxide, which is further oxidized by oxygen to form hydrated ferric oxide (rust): 4Fe(OH)₂(s) + O₂(g) + 2H₂O(l) → 4Fe(OH)₃(s). Hence, rusting is an electrochemical cell with anodic and cathodic areas on the metal surface, facilitated by an electrolyte (water).\n\nA solution that displays positive deviation from Raoult's law has a vapour pressure higher than that predicted by Raoult's law. We know Raoult's law states that the partial vapour pressure of a component is equal to its mole fraction multiplied by its vapour pressure in the pure state. Now, by the definition of positive deviation, the intermolecular forces between different molecules (A-B) are weaker than those between like molecules (A-A and B-B). Substituting this weaker interaction, the molecules escape the liquid phase more easily. Similarly, the total vapour pressure of the solution becomes greater than the ideal value. We get a positive deviation, often accompanied by an endothermic heat of mixing. Hence, examples include ethanol-water or carbon disulfide-acetone mixtures.\n\nCharacteristics of chemical equilibria describe the state of a reversible reaction. Here, its given that at equilibrium, the forward and reverse reaction rates are equal. We know the macroscopic properties, like concentration of reactants and products, remain constant over time. Now, by the definition of a dynamic process, the reactions do not stop; molecules continue to react in both directions. Substituting the condition of a closed system, equilibrium can be approached from either direction. Similarly, the equilibrium state can be disturbed by changing conditions like concentration, pressure, or temperature, as described by Le Chatelier's principle. We get a constant ratio of product and reactant concentrations at a given temperature, expressed as the equilibrium constant. Hence, equilibrium represents a dynamic, stable balance under constant conditions.", "exam_f_question": "Explain how the presence of an electrolyte, such as salt (NaCl), accelerates the rusting of iron according to the electrochemical theory.", "guided_mode_answer": "Let's break down the **Electrochemical Theory of Rusting** step-by-step.\n\n**1. The Basic Setup:** Rusting isn't just iron reacting with air. It's a specific type of corrosion that requires water (even moisture in the air) and oxygen. Think of a tiny, invisible battery forming on the surface of a wet iron nail.\n\n**2. The Two \"Poles\" (Electrodes):**\n*   **Anode (Site of Oxidation):** At one spot on the iron surface, iron atoms lose electrons and become iron(II) ions. This is oxidation.\n    *   Reaction: `Fe(s) → Fe²⁺(aq) + 2e⁻`\n*   **Cathode (Site of Reduction):** At a different spot on the same wet surface, oxygen from the air gains the electrons released at the anode. This happens in the presence of water.\n    *   Reaction: `O₂(g) + 2H₂O(l) + 4e⁻ → 4OH⁻(aq)`\n\n**3. The Connection (The Circuit):**\n*   The iron metal itself conducts the **electrons** from the anode to the cathode.\n*   The water, especially if it contains dissolved ions (making it a better conductor), allows the **ions** (Fe²⁺ and OH⁻) to move. This completes the electrical circuit, allowing the process to continue.\n\n**4. Forming the Rust:**\n*   The Fe²⁺ and OH⁻ ions meet in the water and form iron(II) hydroxide: `Fe²⁺(aq) + 2OH⁻(aq) → Fe(OH)₂(s)`.\n*   This pale green solid is then further oxidized by more oxygen to form the familiar reddish-brown hydrated iron(III) oxide, which we call rust: `4Fe(OH)₂(s) + O₂(g) + 2H₂O(l) → 4Fe(OH)₃(s)`.\n\n**In a Nutshell:** Rusting is a **galvanic cell** where the anode and cathode are different areas on the same piece of wet iron. The process is **electrochemical** because it involves both chemical reactions (forming new substances) and the flow of electricity (movement of electrons and ions).", "guided_f_question": "1. In the rusting process, why is water essential beyond just being a reactant in the chemical equation?\n2. If iron loses electrons at the anode, what is the role of the electrons that travel through the metal to the cathode?\n3. The final product is Fe(OH)₃. What is the initial product formed when Fe²⁺ and OH⁻ first meet, and what happens to it to become rust?", "keywords": ["Electrochemical cell", "Anode (oxidation)", "Cathode (reduction)", "Electrolyte", "Corrosion", "Galvanic cell"]}
{"subject": "CHEM 101", "question": "Evidences support that decomposition of di-nitrogen pentoxide $(N_{2}O_{5})$ follows the following mechanism. Based on steady state approximation derive rate law for this reaction.\n$N_{2}O_{5}\\xrightarrow{k_{1}}NO_{2}+NO_{3}$\n$NO_{2}+NO_{3}\\xrightarrow{k_{2}}NO+NO_{2}+O_{2}$\n$NO+NO_{3}\\xrightarrow{k_{3}}2NO_{2}$\nA sample of iron (At. Wt. 55.85) weighing 15.0 g was heated with $KClO_{3}$ in an evacuated container. The $O_{2}$ generated from the decomposition of $KClO_{3}$ converted some of the Fe to $Fe_{2}O_{3}$ . If the combined mass of Fe and $Fe_{2}O_{3}$ was 17.9 g, calculate the mass of $Fe_{2}O_{3}$ formed and the mass of $KClO_{3}$ decomposed.", "marks": 8, "exam_mode_answer": "Here, its given that,\n\\[\nN_2O_5 \\xrightarrow{k_1} NO_2 + NO_3\n\\]\n\\[\nNO_2 + NO_3 \\xrightarrow{k_2} NO + NO_2 + O_2\n\\]\n\\[\nNO + NO_3 \\xrightarrow{k_3} 2NO_2\n\\]\n\nWe know, steady-state approximation applies to intermediates \\(NO_3\\) and \\(NO\\).\n\nNow, by the definition of steady state for \\(NO_3\\):\n\\[\n\\frac{d[NO_3]}{dt} = k_1[N_2O_5] - k_2[NO_2][NO_3] - k_3[NO][NO_3] = 0\n\\]\nSimilarly for \\(NO\\):\n\\[\n\\frac{d[NO]}{dt} = k_2[NO_2][NO_3] - k_3[NO][NO_3] = 0\n\\]\nFrom the second equation:\n\\[\nk_2[NO_2][NO_3] = k_3[NO][NO_3]\n\\]\n\\[\n[NO] = \\frac{k_2}{k_3}[NO_2]\n\\]\n\nSubstituting into the first steady-state equation:\n\\[\nk_1[N_2O_5] - k_2[NO_2][NO_3] - k_3\\left(\\frac{k_2}{k_3}[NO_2]\\right)[NO_3] = 0\n\\]\n\\[\nk_1[N_2O_5] - 2k_2[NO_2][NO_3] = 0\n\\]\n\\[\n[NO_3] = \\frac{k_1[N_2O_5]}{2k_2[NO_2]}\n\\]\n\nThe rate of decomposition of \\(N_2O_5\\) is:\n\\[\n\\text{Rate} = -\\frac{d[N_2O_5]}{dt} = k_1[N_2O_5]\n\\]\nBut the net rate of \\(O_2\\) formation is from step 2:\n\\[\n\\frac{d[O_2]}{dt} = k_2[NO_2][NO_3]\n\\]\nSubstituting \\([NO_3]\\):\n\\[\n\\frac{d[O_2]}{dt} = k_2[NO_2] \\cdot \\frac{k_1[N_2O_5]}{2k_2[NO_2]} = \\frac{k_1}{2}[N_2O_5]\n\\]\nSince one \\(N_2O_5\\) decomposed gives one \\(O_2\\) overall, the rate of reaction is:\n\\[\n\\text{Rate} = \\frac{d[O_2]}{dt} = \\frac{k_1}{2}[N_2O_5]\n\\]\nHence, the rate law is first order in \\(N_2O_5\\):\n\\[\n\\text{Rate} = k_{\\text{obs}}[N_2O_5], \\quad k_{\\text{obs}} = \\frac{k_1}{2}\n\\]\n\nFor the numerical part:\nLet mass of Fe converted to \\(Fe_2O_3\\) be \\(x\\) g.\nMass of Fe left = \\(15.0 - x\\) g.\nMoles of Fe converted = \\(\\frac{x}{55.85}\\).\nFrom \\(4Fe + 3O_2 \\to 2Fe_2O_3\\), moles of \\(Fe_2O_3\\) formed = \\(\\frac{x}{2 \\times 55.85}\\).\nMass of \\(Fe_2O_3\\) formed = \\(\\frac{x}{2 \\times 55.85} \\times 159.7\\).\nTotal mass of Fe + \\(Fe_2O_3\\) = \\((15.0 - x) + \\frac{159.7x}{111.7} = 17.9\\).\nSolving: \\(15.0 - x + 1.430x = 17.9\\)  \n\\(0.430x = 2.9\\)  \n\\(x = 6.744\\) g Fe converted.\nMass of \\(Fe_2O_3\\) = \\(\\frac{6.744}{111.7} \\times 159.7 = 9.64\\) g.\nMoles of \\(O_2\\) required = \\(\\frac{3}{4} \\times \\frac{6.744}{55.85} = 0.0906\\) mol.\nFrom \\(2KClO_3 \\to 2KCl + 3O_2\\), moles of \\(KClO_3\\) = \\(\\frac{2}{3} \\times 0.0906 = 0.0604\\) mol.\nMass of \\(KClO_3\\) decomposed = \\(0.0604 \\times 122.55 = 7.40\\) g.", "exam_f_question": "The thermal decomposition of ozone (O₃) to oxygen (O₂) is believed to proceed via the following mechanism:\nStep 1 (fast, reversible): O₃ ⇌ O₂ + O\nStep 2 (slow): O + O₃ → 2O₂\nUsing the steady-state approximation for the oxygen atom (O) intermediate, derive the rate law for the formation of O₂. Express your final answer in terms of the concentration of ozone and the rate constants for the elementary steps.", "guided_mode_answer": "**Concept Explanation: The Steady-State Approximation**\n\n**Beginner Level:**\nImagine a complex reaction is like a busy factory assembly line. Some workers (called \"intermediates\") are produced in one step but immediately used up in the next. They don't pile up in the warehouse. The steady-state approximation is a simple rule we use: we assume that the concentration of these busy, short-lived workers stays constant and very low during most of the reaction. This lets us write an equation saying their rate of production equals their rate of consumption, which we can solve to find out how much of them is present.\n\n**Intermediate Level:**\nIn chemical kinetics, a reaction mechanism often involves highly reactive intermediates (like radicals NO₃ and NO in the given problem). Their concentrations are difficult to measure directly. The steady-state approximation states that after a brief initial induction period, the net rate of change of these reactive intermediate concentrations is approximately zero (d[intermediate]/dt ≈ 0). This is because they are formed and consumed at nearly equal rates, leading to a low, constant concentration. We apply this condition to write algebraic equations that relate the intermediate concentration to the concentrations of stable reactants/products and the rate constants of the elementary steps. Substituting this relationship into the expression for the overall reaction rate (often based on the consumption of a reactant or formation of a product from a specific step) yields the experimental rate law.\n\nIn the N₂O₅ decomposition problem:\n1.  We identified NO₃ and NO as the reactive intermediates.\n2.  We wrote two steady-state equations: d[NO₃]/dt = 0 and d[NO]/dt = 0.\n3.  Solving these simultaneously gave us [NO₃] in terms of [N₂O₅] and [NO₂].\n4.  We then expressed the observable rate (here, the rate of O₂ formation from step 2) using this expression for [NO₃].\n5.  The final result was a simple first-order rate law: Rate = (k₁/2)[N₂O₅].", "guided_f_question": "1.  In the provided mechanism, which chemical species are considered \"intermediates,\" and why do we apply the steady-state approximation specifically to them?\n2.  From the steady-state condition for NO (d[NO]/dt = 0), we found that k₂[NO₂][NO₃] = k₃[NO][NO₃]. What does this equation physically mean about the relationship between step 2 and step 3 of the mechanism?\n3.  After substituting the expression for [NO₃] into the rate law d[O₂]/dt = k₂[NO₂][NO₃], the [NO₂] terms canceled out. What does this cancellation imply about the observed dependence of the reaction rate on the concentration of NO₂?", "keywords": ["Reaction Mechanism", "Steady-State Approximation", "Rate Law", "Reaction Intermediate", "Elementary Step", "Kinetics"]}
{"subject": "CHEM 101", "question": "Give an example of acidic buffer solution. Derive a Henderson-Hassel Balch equation for this buffer. Explain how does this buffer resist change in pH on addition of i. strong acid, ii. Strong base.\nConsider that a solution of hydrogen sulfide is added slowly to a mixture containing 0.1 M each of $Zn^{2 + }$ and $Fe^{2 + }$ in order to carry out selective precipitation. Which salt precipitates out first and why? Find the concentration of cation of first precipitate when the second salt just starts to precipitate? (Given $K_{sp}$ of $FeS$ , is $1.0 \\times 10^{-19}$ and $ZnS$ is $4.5 \\times 10^{-24}$ ).", "marks": 8, "exam_mode_answer": "An example of an acidic buffer is a mixture of acetic acid (CH₃COOH) and sodium acetate (CH₃COONa).  \nHere, its given that the buffer consists of a weak acid (HA) and its conjugate base (A⁻).  \nWe know, for the dissociation of weak acid: HA ⇌ H⁺ + A⁻.  \nNow, by the definition of the acid dissociation constant,  \nKa = [H⁺][A⁻] / [HA].  \nRearranging, [H⁺] = Ka × [HA] / [A⁻].  \nTaking negative logarithm on both sides,  \n–log[H⁺] = –log Ka – log([HA]/[A⁻]).  \nSubstituting pH = –log[H⁺] and pKa = –log Ka,  \nWe get, pH = pKa + log([A⁻]/[HA]).  \nHence, the Henderson-Hasselbalch equation for the buffer is pH = pKa + log([salt]/[acid]).\n\nThis buffer resists pH change as follows:  \ni. On adding strong acid (H⁺), the added H⁺ ions react with the conjugate base (A⁻) to form undissociated weak acid (HA), minimizing increase in [H⁺].  \nii. On adding strong base (OH⁻), the OH⁻ ions react with the weak acid (HA) to form water and A⁻, minimizing decrease in [H⁺].\n\nFor selective precipitation with H₂S, the sulfide ion concentration needed for precipitation is found from Ksp = [M²⁺][S²⁻]. For FeS: [S²⁻] = Ksp(FeS)/[Fe²⁺] = (1.0×10⁻¹⁹)/(0.1) = 1.0×10⁻¹⁸ M. For ZnS: [S²⁻] = (4.5×10⁻²⁴)/(0.1) = 4.5×10⁻²³ M. Since lower [S²⁻] is required to precipitate ZnS, ZnS precipitates first.\n\nWhen FeS just starts to precipitate, [S²⁻] = 1.0×10⁻¹⁸ M. At this point, [Zn²⁺] in solution is given by Ksp(ZnS) = [Zn²⁺][S²⁻] ⇒ [Zn²⁺] = (4.5×10⁻²⁴)/(1.0×10⁻¹⁸) = 4.5×10⁻⁶ M. Hence, concentration of Zn²⁺ when FeS begins to precipitate is 4.5×10⁻⁶ M.", "exam_f_question": "A buffer solution is prepared by mixing 0.15 M acetic acid (CH₃COOH) and 0.25 M sodium acetate (CH₃COONa). The pKa of acetic acid is 4.74. Calculate the pH of this buffer solution. If 0.01 moles of solid NaOH is added to 1.0 liter of this buffer, what will be the new pH? (Assume no significant change in volume).", "guided_mode_answer": "**Concept Explanation: Buffers & Selective Precipitation**\n\n**Part 1: Acidic Buffer Solutions**\nA buffer is a solution that resists drastic changes in pH when small amounts of acid or base are added. An **acidic buffer** is made from a weak acid and its conjugate base (often a salt of that acid), like acetic acid (CH₃COOH) and sodium acetate (CH₃COONa).\n\n*   **How it works:** The solution contains a large reservoir of both the weak acid (HA) and its conjugate base (A⁻).\n    *   If you add **strong acid (H⁺)**, the extra H⁺ ions are \"mopped up\" by the conjugate base (A⁻) to form more weak acid (HA). This prevents a large increase in free H⁺ concentration.\n    *   If you add **strong base (OH⁻)**, the OH⁻ ions are neutralized by the weak acid (HA), which donates H⁺ to form water (H₂O) and more conjugate base (A⁻). This prevents a large decrease in free H⁺ concentration.\n\n*   **The Henderson-Hasselbalch Equation:** This is the formula that makes buffers predictable. It relates the pH of the buffer to the pKa of the weak acid and the ratio of the concentrations of the conjugate base and acid.\n    *   Derivation: Start from the acid dissociation constant: Ka = [H⁺][A⁻]/[HA]. Rearrange to [H⁺] = Ka * [HA]/[A⁻]. Take the negative log of both sides: -log[H⁺] = -log(Ka) - log([HA]/[A⁻]). Substitute pH = -log[H⁺] and pKa = -log(Ka). Finally, use log rules to get: **pH = pKa + log([A⁻]/[HA])**.\n\n**Part 2: Selective Precipitation**\nThis is a technique to separate ions from a mixture by adding a reagent that forms precipitates with them at different concentrations.\n\n*   **The Key Idea:** The ion that requires the *lower* concentration of the precipitating agent (here, sulfide ion S²⁻) to start forming a solid will precipitate *first*.\n*   **The Math:** The solubility product constant, **Ksp**, tells us the maximum product of ion concentrations before a solid forms. For a salt like MS, Ksp = [M²⁺][S²⁻]. You can calculate the [S²⁻] needed to start precipitation for each cation: [S²⁻] = Ksp / [M²⁺].\n*   **In our problem:** ZnS has a much smaller Ksp than FeS. For the same initial [M²⁺] (0.1 M), Zn²⁺ needs a far lower [S²⁻] to precipitate. Therefore, **ZnS precipitates first**.\n*   **When the second starts:** When we add enough H₂S to reach the [S²⁻] needed for FeS to *just begin* precipitating, we can plug that [S²⁻] value back into the Ksp expression for ZnS to find out how much Zn²⁺ remains dissolved in the solution at that precise moment.", "guided_f_question": "1.  For the acetic acid/sodium acetate buffer, which component (the acid or the salt) reacts with a small added amount of hydrochloric acid (HCl)? Write the simple chemical equation for this reaction.\n2.  Using the Ksp values provided, calculate the minimum concentration of sulfide ions (S²⁻) required to initiate precipitation for both ZnS and FeS from 0.1 M solutions of their cations.\n3.  Based on your calculations in question 2, which sulfide (ZnS or FeS) has the higher molar solubility in pure water? Explain your reasoning.", "keywords": ["Buffer Solution", "Henderson-Hasselbalch Equation", "Solubility Product Constant (Ksp)", "Selective Precipitation", "Conjugate Acid-Base Pair", "pKa"]}
{"subject": "CHEM 101", "question": "For enzyme-catalyzed reactions that follow the mechanism, a graph of the rate as a function of [S] has the appearance as provided. Note that at higher substrate concentrations the rate no longer changes with\n$\\mathrm{E + S}\\xrightarrow{k_{1}}\\mathrm{ES}\\xrightarrow{k_{2}}\\mathrm{E + P}$\n[S]. Suggest a reason for this.\nConsider the reaction: $2SO_{2}(g) + O_{2}(g) \\to 2SO_{3}(g)$ ; carried out at $25^{\\circ}C$ , and 1 atm. Calculate $\\Delta H^{\\circ}$ , $\\Delta S^{\\circ}$ , $\\Delta G^{\\circ}$ and equilibrium constant $(K)$ , using the following data:", "marks": 8, "exam_mode_answer": "For enzyme-catalyzed reactions following Michaelis-Menten kinetics, the rate levels off at high substrate concentration because the enzyme active sites become saturated. At low [S], the rate increases linearly as more ES complex forms. At very high [S], essentially all enzyme molecules are bound in the ES complex at any given moment, so the rate reaches a maximum \\(V_{max}\\) determined by \\(k_2[E]_0\\). Further increases in [S] cannot increase the concentration of ES or the rate.\n\nHere, its given reaction: \\(2SO_2(g) + O_2(g) \\rightarrow 2SO_3(g)\\) at \\(25^\\circ C\\) and 1 atm.\nWe know standard enthalpies of formation \\((\\Delta H_f^\\circ)\\) and standard molar entropies \\((S^\\circ)\\) from data:\n\\(\\Delta H_f^\\circ (SO_2) = -296.83 \\text{ kJ mol}^{-1}\\), \\(\\Delta H_f^\\circ (O_2) = 0\\), \\(\\Delta H_f^\\circ (SO_3) = -395.72 \\text{ kJ mol}^{-1}\\)\n\\(S^\\circ (SO_2) = 248.22 \\text{ J K}^{-1} \\text{mol}^{-1}\\), \\(S^\\circ (O_2) = 205.14 \\text{ J K}^{-1} \\text{mol}^{-1}\\), \\(S^\\circ (SO_3) = 256.76 \\text{ J K}^{-1} \\text{mol}^{-1}\\)\n\nNow, by the definition of \\(\\Delta H^\\circ\\) for reaction:\n\\(\\Delta H^\\circ = \\sum \\Delta H_f^\\circ(\\text{products}) - \\sum \\Delta H_f^\\circ(\\text{reactants})\\)\nSubstituting,\n\\(\\Delta H^\\circ = [2 \\times (-395.72)] - [2 \\times (-296.83) + 0] = -791.44 + 593.66 = -197.78 \\text{ kJ}\\)\n\nSimilarly, \\(\\Delta S^\\circ = \\sum S^\\circ(\\text{products}) - \\sum S^\\circ(\\text{reactants})\\)\n\\(\\Delta S^\\circ = [2 \\times 256.76] - [2 \\times 248.22 + 205.14] = 513.52 - (496.44 + 205.14) = 513.52 - 701.58 = -188.06 \\text{ J K}^{-1} = -0.18806 \\text{ kJ K}^{-1}\\)\n\nThen, \\(\\Delta G^\\circ = \\Delta H^\\circ - T\\Delta S^\\circ\\)\nAt \\(T = 298 \\text{ K}\\),\n\\(\\Delta G^\\circ = -197.78 - 298 \\times (-0.18806) = -197.78 + 56.04 = -141.74 \\text{ kJ}\\)\n\nWe get equilibrium constant \\(K\\) from \\(\\Delta G^\\circ = -RT \\ln K\\)\n\\(\\ln K = -\\frac{\\Delta G^\\circ}{RT} = -\\frac{-141.74 \\times 10^3}{8.314 \\times 298} = \\frac{141740}{2477.572} \\approx 57.19\\)\nHence, \\(K = e^{57.19} \\approx 7.1 \\times 10^{24}\\)", "exam_f_question": "The reaction \\(2SO_2(g) + O_2(g) \\rightarrow 2SO_3(g)\\) is central to the industrial production of sulfuric acid. Using your calculated thermodynamic values, explain why this reaction is typically carried out at elevated temperatures (e.g., 400-500°C) despite being exothermic. Discuss the trade-offs involved.", "guided_mode_answer": "**Beginner Explanation:**\nThink of an enzyme like a worker on an assembly line, and the substrate (S) is the part they need to assemble. The worker can only handle one part at a time. At first, if you give them more parts, they work faster because they're never waiting. This is the rising part of the graph. But eventually, the worker is constantly busy—they have a part in their hands all the time. Giving them even more parts just piles up on the floor; it doesn't make them work any faster because they are already at their maximum speed. This is the flat part of the graph, where the enzyme is \"saturated.\"\n\n**Intermediate Explanation:**\nIn enzyme kinetics, the rate of reaction (v) depends on the concentration of the enzyme-substrate complex [ES]. At low [S], [ES] is proportional to [S], so the rate increases linearly. However, enzymes have a finite number of active sites. As [S] increases, a greater fraction of these sites are occupied. The maximum rate (\\(V_{max}\\)) is achieved when the enzyme is fully saturated, meaning [ES] equals the total enzyme concentration [E]_total. At this point, the rate is limited by the catalytic step (\\(k_2\\), the rate constant for converting ES to product), so \\(V_{max} = k_2[E]_{total}\\). Further increases in [S] cannot increase [ES] or the rate, leading to the plateau observed in the rate vs. [S] graph.", "guided_f_question": "1. In the provided mechanism, which step (\\(k_1\\) or \\(k_2\\)) primarily determines the reaction rate when the substrate concentration [S] is very low? Why?\n2. How would the value of \\(V_{max}\\) change if the total concentration of enzyme [E]_total in the system was doubled?\n3. The thermodynamic calculation for the \\(SO_3\\) reaction yielded a very large equilibrium constant K. What does the magnitude of K tell you about the position of equilibrium at 25°C, and how is this related to the sign of \\(\\Delta G^\\circ\\)?", "keywords": ["Enzyme Saturation", "Michaelis-Menten Kinetics", "Standard Enthalpy Change (\\(\\Delta H^\\circ\\))", "Standard Gibbs Free Energy Change (\\(\\Delta G^\\circ\\))", "Equilibrium Constant (K)", "Reaction Mechanism"]}
{"subject": "CHEM 101", "question": "What is Raoult's law? Prove $\\Delta T = K_{f}.m$ (where the symbols have their usual meaning)\nA sample of iron (At. Wt. 55.85) weighing 15.0 g was heated with $\\mathrm{KClO}_{3}$ in an evacuated container. The $\\mathrm{O}_{2}$ generated from the decomposition of $\\mathrm{KClO}_{3}$ converted some of the Fe to $\\mathrm{Fe}_{2}\\mathrm{O}_{3}$ . If the combined mass of Fe and $\\mathrm{Fe}_{2}\\mathrm{O}_{3}$ was 17.9 g, calculate the mass of $\\mathrm{Fe}_{2}\\mathrm{O}_{3}$ formed and the mass of $\\mathrm{KClO}_{3}$ decomposed.", "marks": 5, "exam_mode_answer": "Raoult's law states that for a solution of volatile liquids, the partial vapour pressure of each component is equal to the product of its mole fraction in the solution and the vapour pressure of the pure component.\n\nFor the proof, consider the lowering of vapour pressure for a non-volatile solute. Here, its given that $\\Delta P = P^\\circ_A - P_A$. We know, by Raoult's law, $P_A = x_A P^\\circ_A$. For dilute solutions, $x_B \\approx n_B / n_A$. Then, $\\Delta P = P^\\circ_A - x_A P^\\circ_A = P^\\circ_A (1 - x_A) = P^\\circ_A x_B$. Substituting $x_B \\approx n_B / n_A = \\frac{W_B / M_B}{W_A / M_A}$, we get $\\Delta P = P^\\circ_A \\cdot \\frac{M_A}{1000} \\cdot \\frac{1000 \\cdot W_B / M_B}{W_A} = P^\\circ_A \\cdot \\frac{M_A}{1000} \\cdot m$. Similarly, the freezing point depression $\\Delta T_f$ is proportional to $\\Delta P$. Hence, $\\Delta T_f = K_f \\cdot m$, where $K_f$ is the cryoscopic constant.\n\nFor the numerical part:\nLet mass of Fe converted to $\\mathrm{Fe_2O_3}$ be $x$ g.\nMass of Fe remaining = $(15.0 - x)$ g.\nMass of $\\mathrm{Fe_2O_3}$ formed from $x$ g Fe: Molar mass $\\mathrm{Fe_2O_3} = 159.69$. From $2 \\times 55.85$ g Fe, $159.69$ g $\\mathrm{Fe_2O_3}$ forms.\nSo mass of $\\mathrm{Fe_2O_3} = \\frac{159.69}{111.70} x = 1.430 x$ g.\nTotal mass: $(15.0 - x) + 1.430x = 17.9$.\nSolving: $15.0 + 0.430x = 17.9 \\Rightarrow x = 6.744$ g.\nMass of $\\mathrm{Fe_2O_3}$ formed = $1.430 \\times 6.744 = 9.64$ g.\nReaction for oxygen: $\\mathrm{2KClO_3 \\rightarrow 2KCl + 3O_2}$.\nOxygen used: For $111.70$ g Fe, $48.00$ g $\\mathrm{O_2}$ is needed (from $4\\mathrm{Fe} + 3\\mathrm{O_2} \\rightarrow 2\\mathrm{Fe_2O_3}$).\nFor $6.744$ g Fe, $\\mathrm{O_2}$ mass = $\\frac{48.00}{111.70} \\times 6.744 = 2.90$ g.\nMolar mass $\\mathrm{KClO_3} = 122.55$. From stoichiometry, $96.00$ g $\\mathrm{O_2}$ from $245.10$ g $\\mathrm{KClO_3}$.\nSo mass of $\\mathrm{KClO_3}$ decomposed = $\\frac{245.10}{96.00} \\times 2.90 = 7.41$ g.", "exam_f_question": "A solution is prepared by dissolving 10.0 g of a non-electrolyte solute in 200 g of benzene. The freezing point of pure benzene is 5.5 °C and its cryoscopic constant (K_f) is 5.12 K kg mol⁻¹. If the observed freezing point of the solution is 3.0 °C, calculate the molar mass of the solute.", "guided_mode_answer": "**Raoult's Law & Colligative Properties: A Guided Explanation**\n\n**Beginner Level:**\nImagine you have a pure liquid, like water, in a closed container. Some molecules escape the surface to become vapour; this creates a pressure called vapour pressure. Now, if you dissolve some salt (a non-volatile substance) in the water, the salt particles get in the way at the surface. Fewer water molecules can escape now, so the vapour pressure *decreases*. Raoult's Law is a simple formula that predicts this: The vapour pressure of the solution (P_solution) equals the mole fraction of the solvent (like water) multiplied by the vapour pressure of the pure solvent (P°_pure). For a non-volatile solute, this directly means the vapour pressure is lowered.\n\n**Intermediate Level:**\nRaoult's Law is expressed as P_A = x_A * P°_A for a component A in an ideal solution. For a solution with a non-volatile solute B, the vapour pressure lowering (ΔP) is ΔP = P°_A - P_A = P°_A * x_B. In dilute solutions, the mole fraction of the solute (x_B) is approximately equal to the molality (m) times the molar mass of the solvent (M_A) divided by 1000. Thus, ΔP ∝ m.\n\nThis lowering of vapour pressure is a **colligative property**—it depends only on the *number* of solute particles, not their identity. Freezing point depression (ΔT_f) is another such property. Since both ΔP and ΔT_f originate from the same physical cause (reduced escaping tendency of solvent molecules), they are proportional to each other and to the molality. The constant of proportionality for freezing point depression is the cryoscopic constant (K_f), which is a property of the *solvent*. Therefore, we arrive at the formula: **ΔT_f = K_f * m**.", "guided_f_question": "1.  In the proof for ΔT_f = K_f * m, why do we specifically consider a *dilute* solution and a *non-volatile* solute? What might change if the solute were volatile?\n2.  In the numerical problem, we used the reaction 4Fe + 3O₂ → 2Fe₂O₃. How would the setup and calculations change if the product formed was FeO (iron(II) oxide) instead of Fe₂O₃?\n3.  The final mass of the solid mixture (Fe + Fe₂O₃) was greater than the initial mass of iron. Where did this extra mass come from, and how is this concept related to the law of conservation of mass?", "keywords": ["Raoult's Law", "Colligative Properties", "Freezing Point Depression", "Molality", "Stoichiometry", "Mole Fraction"]}
{"subject": "CHEM 101", "question": "Equal weights of zinc metal and iodine are mixed together and the iodine is completely converted to $\\mathrm{ZnI}_2$ . What fraction by weight of the original zinc remains unreacted? (A W of $\\mathrm{Zn} = 65.4$ ; A W of $1 = 126.9$ )\nExplain the importance of mole concept? Illustrate.", "marks": 5, "exam_mode_answer": "Here, its given that equal weights of zinc and iodine are taken. Let the mass of each be \\( m \\) grams.\n\nWe know the reaction: \\( \\mathrm{Zn} + \\mathrm{I_2} \\rightarrow \\mathrm{ZnI_2} \\).\n\nNow, by the definition of molar mass, moles of Zn taken = \\( \\frac{m}{65.4} \\), moles of I₂ taken = \\( \\frac{m}{253.8} \\) (since molecular mass of I₂ = \\( 2 \\times 126.9 = 253.8 \\)).\n\nFrom stoichiometry, 1 mole Zn reacts with 1 mole I₂. The limiting reagent is I₂ because \\( \\frac{m}{253.8} < \\frac{m}{65.4} \\).\n\nThen, moles of Zn reacted = moles of I₂ = \\( \\frac{m}{253.8} \\). Mass of Zn reacted = \\( \\frac{m}{253.8} \\times 65.4 \\).\n\nMass of Zn unreacted = \\( m - \\left( \\frac{m \\times 65.4}{253.8} \\right) = m \\left( 1 - \\frac{65.4}{253.8} \\right) \\).\n\nWe get fraction unreacted = \\( 1 - \\frac{65.4}{253.8} = 1 - 0.2577 = 0.7423 \\).\n\nHence, about 0.742 or 74.2% of the original zinc remains unreacted.\n\nThe mole concept is fundamental as it allows chemists to relate mass to number of particles (atoms, molecules). It provides a bridge between the macroscopic mass scale and the atomic scale. For example, in stoichiometry, it enables precise calculation of reactant masses needed or products formed, ensuring no waste and accurate yields in chemical synthesis. Without it, quantitative predictions in reactions would be impossible.", "exam_f_question": "If the reaction were instead between aluminum and iodine to form aluminum iodide (AlI₃), and equal masses of aluminum and iodine were used, which element would be the limiting reagent? (Atomic weights: Al = 27.0, I = 126.9)", "guided_mode_answer": "Let's break down the original problem step-by-step.\n\n**Step 1: Understanding the Setup**\nWe are told we have equal *weights* (masses) of zinc and iodine. Let's call this mass `m` grams for each. The goal is to find what fraction of the original zinc is left over after the reaction.\n\n**Step 2: The Chemical Reaction**\nThe reaction is: Zn + I₂ → ZnI₂.\nThis tells us the *mole ratio* in which the reactants combine: 1 mole of Zn reacts with 1 mole of I₂.\n\n**Step 3: Converting Mass to Moles (The Key Step)**\nWe can't compare grams directly because atoms have different weights. We use the mole concept.\n*   Moles of Zn = mass / molar mass = `m` g / 65.4 g/mol.\n*   Iodine exists as diatomic molecules (I₂). So, the molar mass of I₂ = 2 × 126.9 = 253.8 g/mol.\n*   Moles of I₂ = `m` g / 253.8 g/mol.\n\n**Step 4: Identifying the Limiting Reagent**\nCompare the available moles to the required ratio (1:1).\n*   (`m`/65.4) moles of Zn is available.\n*   (`m`/253.8) moles of I₂ is available.\nSince 253.8 > 65.4, dividing by a larger number gives a smaller result. Therefore, (`m`/253.8) < (`m`/65.4). We have fewer moles of I₂ than Zn relative to what's needed. Thus, **I₂ is the limiting reagent**. It will run out first and stop the reaction.\n\n**Step 5: Calculating How Much Zinc Reacts**\nThe reaction consumes Zn and I₂ in a 1:1 mole ratio. Since I₂ is limiting, the moles of Zn that react will equal the moles of I₂ we started with.\n*   Moles of Zn reacted = Moles of I₂ = `m` / 253.8.\n*   Mass of Zn reacted = moles × molar mass = (`m` / 253.8) × 65.4.\n\n**Step 6: Finding the Fraction Unreacted**\n*   Mass of Zn unreacted = Initial mass - Mass reacted = `m` - (`m` × 65.4 / 253.8).\n*   Factor out `m`: = `m` (1 - 65.4/253.8).\n*   **Fraction unreacted** = (Mass unreacted) / (Initial mass) = 1 - (65.4/253.8).\n*   Calculate: 65.4/253.8 ≈ 0.2577. So, Fraction = 1 - 0.2577 = 0.7423.\nThis means **74.2%** of the original zinc remains.\n\n**Why the Mole Concept is Crucial:**\nIt is the bridge between the mass of a substance (which we can measure) and the number of atoms/molecules (which participate in reactions). Without it, we couldn't use the balanced chemical equation (which is in *moles*) to figure out how much of one reactant mass is needed for another. It allows for precise, quantitative chemistry.", "guided_f_question": "1.  In the step where we find moles of I₂, why do we use 253.8 g/mol instead of 126.9 g/mol?\n2.  How would the final answer change if we had taken equal *moles* of zinc and iodine instead of equal masses?\n3.  After identifying I₂ as the limiting reagent, why do we say the moles of Zn reacted equals the initial moles of I₂?", "keywords": ["Stoichiometry", "Limiting Reagent", "Mole Concept", "Molar Mass", "Diatomic Molecule", "Chemical Equation"]}
{"subject": "CHEM 101", "question": "What is Raoult's law? Prove $\\Delta T_b = K_b \\cdot m$ (where the symbols have their usual meaning)\nBalance the following redox reaction be using half-reaction method.\n$\\mathrm{Zn} + \\mathrm{NO}_3^- \\longrightarrow \\mathrm{Zn}^{++} + \\mathrm{NH}_4^+ \\quad (\\mathrm{in} \\mathrm{basic} \\mathrm{medium})$", "marks": 5, "exam_mode_answer": "Raoult's law states that for a solution of volatile liquids, the partial vapour pressure of each component is equal to the product of its mole fraction in the solution and the vapour pressure of the pure component.\n\nFor the elevation of boiling point:\nHere, its given that, $\\Delta T_b = T_b - T_b^0$.\nWe know, at boiling point, vapour pressure equals atmospheric pressure. For a dilute solution, the lowering of vapour pressure $\\Delta p = p^0 - p$ is given by $\\Delta p = p^0 x_2$, where $x_2$ is mole fraction of solute.\nNow, by the definition of molality $m$, for dilute solution $x_2 \\approx \\frac{M_1 m}{1000}$, where $M_1$ is molar mass of solvent.\nSubstituting, $\\Delta p = p^0 \\frac{M_1 m}{1000}$.\nFrom thermodynamics, $\\frac{\\Delta p}{p^0} \\approx \\frac{\\Delta H_{vap} \\Delta T_b}{R (T_b^0)^2}$.\nSimilarly, equating the two expressions for $\\frac{\\Delta p}{p^0}$:\n$\\frac{M_1 m}{1000} = \\frac{\\Delta H_{vap} \\Delta T_b}{R (T_b^0)^2}$.\nThen, $\\Delta T_b = \\left[ \\frac{R (T_b^0)^2 M_1}{1000 \\Delta H_{vap}} \\right] m$.\nWe get $\\Delta T_b = K_b \\cdot m$, where $K_b = \\frac{R (T_b^0)^2 M_1}{1000 \\Delta H_{vap}}$.\nHence, proved.\n\nBalanced redox reaction in basic medium:\nOxidation: $\\mathrm{Zn} \\longrightarrow \\mathrm{Zn}^{2+} + 2\\mathrm{e}^-$\nReduction: $\\mathrm{NO}_3^- + 6\\mathrm{H}_2\\mathrm{O} + 8\\mathrm{e}^- \\longrightarrow \\mathrm{NH}_4^+ + 8\\mathrm{OH}^-$\nMultiply oxidation by 4: $4\\mathrm{Zn} \\longrightarrow 4\\mathrm{Zn}^{2+} + 8\\mathrm{e}^-$\nAdding: $4\\mathrm{Zn} + \\mathrm{NO}_3^- + 6\\mathrm{H}_2\\mathrm{O} \\longrightarrow 4\\mathrm{Zn}^{2+} + \\mathrm{NH}_4^+ + 8\\mathrm{OH}^-$", "exam_f_question": "A solution is prepared by dissolving 10.0 g of a non-electrolyte solute in 200 g of water. If the boiling point of the solution is found to be 100.26 °C, calculate the molar mass of the solute. (K_b for water = 0.512 K kg mol⁻¹)", "guided_mode_answer": "**Raoult's Law & Colligative Properties: A Guided Explanation**\n\n**1. The Core Idea (Beginner):**\nImagine a pot of pure water boiling. The bubbles are water vapor escaping. Now, imagine you add salt. The water now needs to be hotter to boil. Why? Raoult's Law helps explain this. It says that in a mixture, each liquid's tendency to escape into the vapor (its vapor pressure) is reduced by the presence of other particles. For a non-volatile solute (like salt), it simply lowers the solvent's vapor pressure.\n\n**2. Connecting to Boiling Point Elevation (Intermediate):**\n*   **Boiling Point Definition:** A liquid boils when its vapor pressure equals the surrounding atmospheric pressure.\n*   **The Problem:** Adding a solute lowers the vapor pressure. At the pure solvent's boiling point (T_b⁰), the solution's vapor pressure is now *below* atmospheric pressure, so it won't boil.\n*   **The Solution:** You must heat the solution to a higher temperature (T_b) to get its vapor pressure back up to atmospheric pressure. This increase (ΔT_b = T_b - T_b⁰) is the boiling point elevation.\n*   **Why it Depends on Molality (m):** The amount of vapor pressure lowering depends directly on the *number* of solute particles, not their identity (a colligative property). Molality (m = moles solute / kg solvent) is the perfect measure for this. More particles (higher molality) = greater lowering = greater ΔT_b needed. The constant K_b (ebullioscopic constant) is a property of the solvent that tells you how sensitive its boiling point is to added particles.\n\n**3. Redox Balancing in Basic Medium - Key Steps:**\n1.  **Split into Half-Reactions:** Identify oxidation (loss of e⁻) and reduction (gain of e⁻).\n2.  **Balance Atoms *except* H and O.**\n3.  **Balance O atoms** by adding H₂O.\n4.  **Balance H atoms** by adding H⁺ (in acidic medium) or H₂O/OH⁻ (in basic medium).\n    *   **For Basic Medium:** After step 3, balance H by adding H₂O to the side needing H, and add an equal number of OH⁻ to the *opposite* side.\n5.  **Balance charge** by adding electrons (e⁻).\n6.  **Equalize electrons** in both half-reactions by multiplying them by integers.\n7.  **Add the half-reactions** and simplify by canceling species that appear on both sides.", "guided_f_question": "1.  In the proof for ΔT_b = K_b·m, we related mole fraction (x₂) to molality (m) using the approximation x₂ ≈ (M₁*m)/1000. What is the key assumption about the solution that makes this approximation valid, and why does it break down for very concentrated solutions?\n2.  In the balanced redox reaction, 8 OH⁻ ions appear on the product side. If this reaction occurred in an acidic medium, what would be the corresponding balanced half-reaction for the reduction of NO₃⁻ to NH₄⁺? (Hint: You would use H⁺ and H₂O instead of OH⁻ and H₂O).\n3.  The proof uses the Clausius-Clapeyron equation in the form Δp/p⁰ ≈ (ΔH_vap ΔT_b) / [R (T_b⁰)²]. Conceptually, what does this equation tell us about the relationship between a small change in temperature (ΔT_b) and the resulting change in vapor pressure (Δp) needed to reach the boiling point?", "keywords": ["Raoult's Law", "Colligative Properties", "Boiling Point Elevation", "Molality", "Redox Reaction", "Half-Reaction Method"]}
{"subject": "CHEM 101", "question": "The initial rate of decomposition of acetaldehyde at $600^{\\circ}\\mathrm{C}$ $CH_{3}CHO(g)\\rightarrow CH_{4}(g) + CO(g)$ was measured at a series of concentrations with the following results:\ni. Write differential rate law\nii. Derive integrate rate law and an equation for half life\nCalculate the change in entropy that occurs when a sample containing 2.0 moles of water is heated from $50.0^{\\circ}\\mathrm{C}$ to $150.0^{\\circ}\\mathrm{C}$ at 1 atm pressure. The molar heat capacities for $H_{2}O(l)$ and $H_{2}O(g)$ are $18.0 \\mathrm{Cal} \\mathrm{K}^{-1} \\mathrm{mol}^{-1}$ and $8.7 \\mathrm{Cal} \\mathrm{K}^{-1} \\mathrm{mol}^{-1}$ , respectively, and the enthalpy of vaporization for water is $9.7 \\mathrm{kCal} / \\mathrm{mol}$ at $100^{\\circ}\\mathrm{C}$ .", "marks": 5, "exam_mode_answer": "Here, its given that,  \nInitial rate data for \\( \\text{CH}_3\\text{CHO}(g) \\rightarrow \\text{CH}_4(g) + \\text{CO}(g) \\) is provided.  \nFrom the experimental results (concentration vs rate), if rate \\( \\propto [\\text{CH}_3\\text{CHO}]^2 \\), the differential rate law is:  \n\\[\n\\text{Rate} = k [\\text{CH}_3\\text{CHO}]^2\n\\]  \nWe know,  \n\\[\n-\\frac{d[A]}{dt} = k[A]^2\n\\]  \nNow, by the definition of integrated rate law,  \n\\[\n\\frac{1}{[A]_t} - \\frac{1}{[A]_0} = kt\n\\]  \nSimilarly, half-life \\( t_{1/2} \\) when \\( [A]_t = \\frac{[A]_0}{2} \\):  \nSubstituting,  \n\\[\n\\frac{2}{[A]_0} - \\frac{1}{[A]_0} = k t_{1/2}\n\\]  \n\\[\nt_{1/2} = \\frac{1}{k[A]_0}\n\\]  \n\nFor entropy change when heating 2.0 moles \\( \\text{H}_2\\text{O} \\) from 50.0°C to 150.0°C at 1 atm:  \nStep 1: Heating liquid from 50°C to 100°C:  \n\\[\n\\Delta S_1 = n C_{p,\\text{l}} \\ln\\frac{T_2}{T_1} = 2.0 \\times 18.0 \\times \\ln\\frac{373}{323} = 5.23 \\ \\text{Cal/K}\n\\]  \nStep 2: Vaporization at 100°C:  \n\\[\n\\Delta S_2 = \\frac{n \\Delta H_{\\text{vap}}}{T} = \\frac{2.0 \\times 9700}{373} = 52.01 \\ \\text{Cal/K}\n\\]  \nStep 3: Heating vapor from 100°C to 150°C:  \n\\[\n\\Delta S_3 = n C_{p,\\text{g}} \\ln\\frac{T_2}{T_1} = 2.0 \\times 8.7 \\times \\ln\\frac{423}{373} = 2.17 \\ \\text{Cal/K}\n\\]  \nTotal entropy change:  \n\\[\n\\Delta S_{\\text{total}} = 5.23 + 52.01 + 2.17 = 59.41 \\ \\text{Cal/K}\n\\]", "exam_f_question": "The decomposition of nitrogen dioxide, NO₂(g) → NO(g) + ½ O₂(g), is studied at a constant temperature. The initial concentration of NO₂ is 0.0100 M. After 100 seconds, the concentration of NO₂ is measured to be 0.0067 M. Assuming the reaction is second order with respect to NO₂, calculate the rate constant (k) for this reaction and determine the half-life of NO₂ under these initial conditions.", "guided_mode_answer": "Let's break down the two main concepts from the exam answer.\n\n**1. Integrated Rate Laws & Half-Life (Kinetics):**\nThis part deals with how the concentration of a reactant changes over time during a chemical reaction. The \"differential rate law\" (like Rate = k[A]²) tells us the instantaneous speed of the reaction at any given concentration. To find out how much reactant is left after a certain time, we use the \"integrated rate law,\" which is a mathematical equation derived from the differential law. For a second-order reaction (where rate depends on concentration squared), this equation is 1/[A]_t = kt + 1/[A]_0. The \"half-life\" is the time it takes for half of the reactant to be consumed. A key feature of a second-order reaction is that its half-life *depends on the starting concentration* (t₁/₂ = 1/(k[A]_0)), unlike a first-order reaction where it is constant.\n\n**2. Entropy Change (ΔS) for a Multi-Step Process (Thermodynamics):**\nEntropy is a measure of molecular disorder or randomness. The total entropy change for a process is the sum of the entropy changes for each step. When heating a substance, ΔS = nC_p ln(T₂/T₁). During a phase change (like vaporization) at constant temperature, ΔS = ΔH_vap / T. The exam problem required calculating ΔS for three sequential steps: heating liquid water, vaporizing it, and then heating the steam. The key is to ensure temperatures are in Kelvin and to add the ΔS values for each step to get the total.", "guided_f_question": "1. For the second-order reaction in the exam answer, if the initial concentration [A]_0 is doubled, how does the initial rate of reaction change? How does the half-life (t₁/₂) change?\n2. In the entropy calculation, why must we use absolute temperature (in Kelvin) in the formulas ΔS = nC_p ln(T₂/T₁) and ΔS = ΔH/T, rather than temperature in degrees Celsius?\n3. Looking at the entropy calculation steps, the largest contribution to ΔS_total came from ΔS₂ (vaporization). Why is the entropy change for a phase change from liquid to gas typically so large compared to just heating a substance?", "keywords": ["Differential Rate Law", "Integrated Rate Law", "Half-Life", "Second-Order Reaction", "Entropy Change", "Enthalpy of Vaporization"]}
{"subject": "CHEM 101", "question": "What is steady state approximation? Derive rate law equation for a reaction whose mechanism is given as following.\n$A + M \\xrightarrow{k_{1}} A^{*} + M$\n$A^{*} \\xrightarrow{k_{2}} B + C$", "marks": 5, "exam_mode_answer": "The steady-state approximation assumes that the concentration of a reactive intermediate remains constant during the reaction after a short initial period.\n\nHere, the mechanism is:\nStep 1: \\( A + M \\xrightarrow{k_1} A^{*} + M \\)\nStep 2: \\( A^{*} \\xrightarrow{k_2} B + C \\)\nThe intermediate is \\( A^{*} \\).\n\nNow, by the definition of the steady-state approximation, the net rate of formation of \\( A^{*} \\) is zero.\n\\[\n\\frac{d[A^{*}]}{dt} = 0\n\\]\nThe rate of formation of \\( A^{*} \\) is from step 1: \\( k_1 [A][M] \\).\nThe rate of consumption of \\( A^{*} \\) is from step 2: \\( k_2 [A^{*}] \\).\nThus,\n\\[\n\\frac{d[A^{*}]}{dt} = k_1 [A][M] - k_2 [A^{*}] = 0\n\\]\nThen,\n\\[\nk_1 [A][M] = k_2 [A^{*}]\n\\]\n\\[\n[A^{*}] = \\frac{k_1}{k_2} [A][M]\n\\]\nThe overall rate is the rate of formation of products \\( B \\) or \\( C \\), given by step 2:\n\\[\n\\text{Rate} = k_2 [A^{*}]\n\\]\nSubstituting the expression for \\( [A^{*}] \\),\n\\[\n\\text{Rate} = k_2 \\left( \\frac{k_1}{k_2} [A][M] \\right)\n\\]\nWe get,\n\\[\n\\text{Rate} = k_1 [A][M]\n\\]\nHence, the derived rate law is first order in \\( A \\) and first order in \\( M \\).", "exam_f_question": "The derived rate law is Rate = k₁[A][M]. If the concentration of M is very high and remains essentially constant throughout the reaction, how would you simplify the expression for the observed rate constant? What would the overall reaction order be with respect to A under these conditions?", "guided_mode_answer": "Let's break down the steady-state approximation step-by-step.\n\n**1. What is a Reactive Intermediate?**\nIn the given mechanism, A* is a high-energy, unstable species formed in one step and consumed in a later step. It usually doesn't accumulate in the reaction mixture.\n\n**2. The Core Idea of Steady-State**\nThe approximation states that after a very short initial period, the rate at which this intermediate (A*) is formed becomes equal to the rate at which it is consumed. Therefore, its concentration stays at a very low, constant value.\nMathematically, we say its net rate of change is zero: d[A*]/dt = 0.\n\n**3. Applying it to the Mechanism**\n*   **Formation of A*:** Only from Step 1. Rate = k₁ [A][M]\n*   **Consumption of A*:** Only from Step 2. Rate = k₂ [A*]\n*   **Set up the equation:** Formation Rate - Consumption Rate = 0\n    k₁ [A][M] - k₂ [A*] = 0\n\n**4. Solving for the Intermediate**\nWe rearrange the equation from step 3 to find [A*]:\n[A*] = (k₁ / k₂) [A][M]\nThis expresses the unknown concentration of the intermediate in terms of the known reactant concentrations.\n\n**5. Finding the Overall Rate**\nThe rate of product formation (which is what we measure) is given by the slow, product-forming step (Step 2): Rate = k₂ [A*].\nWe substitute our expression for [A*] from step 4 into this equation:\nRate = k₂ * [(k₁ / k₂) [A][M]]\nThe k₂ terms cancel, giving the final rate law: **Rate = k₁ [A][M]**.", "guided_f_question": "1. In the derived rate law, Rate = k₁[A][M], which species (A or M) is considered the reactant, and which might be considered a catalyst or an inert \"bath gas\" based on its role in the mechanism?\n2. Looking at the final rate law, which elementary step (Step 1 or Step 2) is effectively rate-determining? Why?\n3. If we could not apply the steady-state approximation, what alternative method could we use to try to solve for the rate law from this mechanism? (Hint: Think about a more restrictive condition).", "keywords": ["Steady-State Approximation", "Reaction Mechanism", "Rate-Determining Step", "Reactive Intermediate", "Elementary Step", "Rate Law"]}
{"subject": "CHEM 101", "question": "State first law of thermodynamics. Derive a relation that shows how rate of a gaseous reaction depends on temperature using Arrhenius equation.\nCombustion reactions involve reacting a substance with oxygen. When compounds containing carbon and hydrogen are combusted, carbon dioxide and water are the products. Using the enthalpies of combustion for $C_{4}H_{4}(-2341 \\mathrm{kJ} / \\mathrm{mol}), C_{4}H_{8}(-2755 \\mathrm{kJ} / \\mathrm{mol}),$ and $H_{2}(-286 \\mathrm{kJ} / \\mathrm{mol})$ , calculate $\\Delta H$ for the reaction:\n$C_{4}H_{4}(g) + 2H_{2}(g) \\rightarrow C_{4}H_{8}(g)$", "marks": 5, "exam_mode_answer": "The first law of thermodynamics states that energy can neither be created nor destroyed; it can only be transformed from one form to another. For a system, the change in internal energy (ΔU) equals the heat (q) added to the system minus the work (w) done by the system: ΔU = q – w.\n\nHere, its given that the rate constant k depends on temperature as per the Arrhenius equation: \\( k = A e^{-E_a/(RT)} \\), where A is the pre-exponential factor, \\(E_a\\) is the activation energy, R is the gas constant, and T is the temperature. Taking natural logarithm on both sides: \\( \\ln k = \\ln A - \\frac{E_a}{RT} \\). Differentiating with respect to temperature, we get \\( \\frac{d \\ln k}{dT} = \\frac{E_a}{RT^2} \\). This shows the rate of reaction increases exponentially with temperature, as \\(E_a\\) and R are positive constants.\n\nFor the enthalpy calculation:\nWe know: (1) \\(C_4H_4(g) + 5O_2(g) \\rightarrow 4CO_2(g) + 2H_2O(l)\\); \\(\\Delta H_1 = -2341 \\text{ kJ/mol}\\)\n(2) \\(C_4H_8(g) + 6O_2(g) \\rightarrow 4CO_2(g) + 4H_2O(l)\\); \\(\\Delta H_2 = -2755 \\text{ kJ/mol}\\)\n(3) \\(H_2(g) + \\frac{1}{2}O_2(g) \\rightarrow H_2O(l)\\); \\(\\Delta H_3 = -286 \\text{ kJ/mol}\\)\nTarget: \\(C_4H_4(g) + 2H_2(g) \\rightarrow C_4H_8(g)\\); \\(\\Delta H_r = ?\\)\nApplying Hess's Law: \\(\\Delta H_r = \\Delta H_1 + 2 \\times \\Delta H_3 - \\Delta H_2\\)\nSubstituting: \\(\\Delta H_r = (-2341) + 2(-286) - (-2755) = -2341 - 572 + 2755\\)\nHence, \\(\\Delta H_r = -158 \\text{ kJ/mol}\\).", "exam_f_question": "Using the same principle of Hess's Law, calculate the standard enthalpy of formation (ΔH°f) for gaseous butadiene, C₄H₆(g), given the following standard enthalpies of combustion: ΔH°comb[C₄H₆(g)] = -2540 kJ/mol, ΔH°comb[C(s, graphite)] = -394 kJ/mol, and ΔH°comb[H₂(g)] = -286 kJ/mol. The formation reaction is: 4C(s, graphite) + 3H₂(g) → C₄H₆(g).", "guided_mode_answer": "Let's break down the key concepts from the answer.\n\n**1. First Law of Thermodynamics:** This is the law of conservation of energy applied to thermodynamic systems. Think of a system (like a gas in a piston). The energy inside it (internal energy, U) can change in only two ways: by adding/removing heat (q) or by doing work/having work done on it (w). The formula ΔU = q - w is the accountant's version: the change in the system's energy equals the energy in (heat) minus the energy out (work done *by* the system).\n\n**2. Arrhenius Equation & Temperature Dependence:** The Arrhenius equation explains why reactions get much faster when heated. The core idea is the energy barrier (activation energy, Ea). Only molecules with enough energy to overcome this barrier can react. Heating doesn't just add a little energy; it exponentially increases the *number* of molecules that have the required Ea. The mathematical derivation (ln k = ln A - Ea/RT) shows that plotting ln k vs. 1/T gives a straight line, and its slope (-Ea/R) tells us how sensitive the rate is to temperature.\n\n**3. Hess's Law & Enthalpy Calculation:** Hess's Law states that the total enthalpy change for a reaction is the same no matter what pathway is taken. We use known combustion reactions like stepping stones. The strategy is to algebraically combine the given equations to build the target equation. Key steps: Reverse equations when needed (which changes the sign of ΔH), multiply equations (which multiplies ΔH), and then add them all together. In this problem, we added the combustion of C₄H₄ and twice the combustion of H₂, then subtracted the combustion of C₄H₈ to get the hydrogenation reaction.", "guided_f_question": "1. The first law is written as ΔU = q - w. In the context of a simple system (like a gas expanding in a cylinder), what does a positive value for 'w' represent? What would be the sign of 'w' if the system is compressed?\n2. In the differentiated form of the Arrhenius equation, d(ln k)/dT = Ea/(RT²), all terms on the right are positive. What does this tell you about the graph of ln(k) versus temperature (T)? What about the graph of ln(k) versus the reciprocal of temperature (1/T)?\n3. In the enthalpy calculation, why did we subtract ΔH₂ (the combustion of C₄H₈) instead of adding it? Walk through how you would manipulate the three given combustion equations to physically derive the target hydrogenation equation.", "keywords": ["First Law of Thermodynamics", "Arrhenius Equation", "Activation Energy", "Hess's Law", "Enthalpy of Combustion", "Enthalpy Change (ΔH)"]}
