[
  {
    "subject": "COMP 202",
    "question": "Clarity circular linked list with suitable example. How do you implement linked list operation in singly linked list? Explain.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What is the difference between file structure and storage structure? How can you implement a stack using queues?",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What is the main idea behind the selection sort? Is the heap sort always better than the quick sort? Make justification with an example.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What are some examples of divide and conquer algorithms? What are the advantages of binary search over a linear search?",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What do you mean by graph traversal? Explain with an example.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Mention the steps to insert data at the starting of a singly linked list. Write an algorithm to add an item to the beginning of the list.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Define minimum cost spanning tree. Prove that the maximum number of edges that a graph with n Vertices is $n^{*}(n - 1) / 2$.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "(a) What is Graph? Write and explain the prim's algorithm and depth first search algorithm.\n(b) Define searching. What are the collision resolution methods? Explain with examples.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "(a) Provide a concise and accurate description of a good way for quick sort to improve its performance by using insertion sort.\n(b) What is sorting and what are its types?\nwith step-by-step procedure:\n11 17 19 43 22 27 33 29",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "What are the steps to convert a general tree into binary tree? Explain the tree traversals with algorithms and examples.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Define stack ADT. Write pseudocode for major operations on stack implemented using a linked list. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Which data structure would you use in the following scenario? Justify your choice. [2+2]\n(i) You need to store application settings, such as language, theme etc.\n(ii) You need to store information about movies and users who watched those movies.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Define tree traversal. Discuss different types of traversal in a binary tree. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What is a priority queue? Using heap data structure, construct an ascending priority queue from the following data.\n2- A, 5- B, 8- X, 6- W, 1- C, 4- D, 7- E, 3- F\nHere, the first number is the priority (lower value indicates higher priority) and the letter is the data. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain the divide-and-conquer strategy in algorithm design. Give an example of a problem which can be solved using this strategy. [2+2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "The best case input for a sorting algorithm is not always an array that is already sorted. Justify this statement with appropriate examples. [4]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Write short notes on ANY TWO.\n(i) Collision resolution techniques ii. Binary search tree iii. Array data structure",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Define minimum spanning tree. Compare and contrast Prim's and Kruskal's algorithms. Do we always obtain the same minimum spanning tree from these two algorithms? [2 + 4 + 2]",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Write an algorithm to convert a decimal number to binary using circular queue or doubly linked list. Compute the time complexity of your algorithm. What are the benefits of a circular queue over a simple queue? [3 + 3 + 2]",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "(i) List out the properties of binary search tree.\n(ii) Explain, with an example, what this algorithm returns.\n(iii) Compute the time complexity of this algorithm if the time complexity of the algorithm minimum is $O(h)$, where $h$ is the height of the tree.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "What is the big-O complexity of this algorithm, if the set is implemented as:\na) an AVL tree\nb) a hash table\nMake explanation.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Here is an array of ten integers: 6 3 8 9 2 7 0 3 6 5\nSuppose we partition this array using quick sort's partition function and using 5 for the pivot. Draw the resulting array after the partition finishes.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What is Prim's Algorithms? Explain with the help of an example. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain Binary Search Tree. How does dynamic memory allocation help in managing data? [2+2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain the following with diagram and also write algorithm:\n(a) Insert a node at the beginning, at the end and at the specified position of singly link list.\n(b) Deleting the first node, last node and a node from a specified position in case of doubly linked list.\n(c) Deleting the first node, last node and a node from a specified position in case of circular linked list.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain the insertion sort algorithm and discuss the worst case and best case time complexities. Explain the time complexities with the suitable case scenarios. [2+2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Define hashing. The table size is 10 (0....9), hash function: $h(x) = x \\mod 10$, Insert keys 21, 32, 3, 14, 22, 27, 8. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "(a) What are the two ways of representing binary trees in the memory? Which one do you prefer and why?\n(b) Quick sort can be described as a recursive in-place sorting algorithm that performs a partition () operation on the given array and then invokes itself twice on two distinct subranges of the array.\n(i) Describe the purpose, I/O parameters and effect of the partition() procedure and explain what the pivot is. Pseudocode is not required.\n(ii) Give pseudocode for the quicksort () procedure that would call the partition () procedure you described in (a). Prove that your quick sort () will always terminate.\n(iii) Analyse the worst-case behaviour of Quick sort and discuss possible ways of improving it.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "(a) Give a concise and accurate description of a good way for selection sort to improve its performance by using insertion sort.\n(b) What is sorting and what are its types? Arrange following elements in insertion sort with step-by-step procedure:\n14 17 19 44 22 24 32 26",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Describe how binary search works. Describe its main idea, what kind of data it can be used on, its time complexity and its pseudo code. Give an example of how the algorithm works. [2+3+3]",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Consider a following undirected graph. Show how Krushkal's and Prim's algorithms are applied to find the minimum spanning tree.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Arrange the following expressions from slowest to fastest growth rate. Provide justifications for your arrangement.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Analyze the time complexity of the following programs.\na) for send = 1 to n do for receive = 1 to send do\nfor ack = 2 to receive do b) sum = 0;\nend message = send - (receive + ack); i = n;\nend while (i> 0).\nend end",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain the insertion sort algorithm and discuss the best case and worst case time complexities. Explain the time complexities with the suitable case scenarios.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Illustrate the application of a stack to convert the infix expression $A + B * C$ to postfix.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Hand execute the following code and show the contents of the resulting qucue:\nvalues = Queue()\nfor (i = 0; i<16; i++)\n{\nif i mod 3 ==0\n{\nvalues.enqueue(i);\n}\nelse if (i mod 4 ==0)\n{\nvalues.dequeue();\n}",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Apply mergesort algorithm to sort the given sequence of keys\n(80, 7, 24, 16, 43, 91, 35, 2, 19, 72).\nWrite the pseudocode of mergesort algorithm.",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Consider the following set of values and use them to build a heap by adding one value at a time in the order listed:\n30 63 2 89 16 24 19 52 27 9 4 45\n(a) min-heap\n(b) max-heap",
    "mark": 5,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Given input {4371, 1323, 6173, 4199, 4344, 9679, 1989} and a hash function $h(x) = x \\mod 10$, show the resulting: [2+2+4] a. Separate chaining hash table b. Open addressing hash table using linear probing c. What is rehashing? How does it serve to overcome the drawbacks of linear probing?",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Given the graph below, illustrate Depth First Search (DFS) and Breadth First Search(BFS) traversal algorithms to show the order of the vertices visited. What are minimum spanning trees and their applications? [2+2+4]",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Differentiate between binary search and linear search algorithms. Write the iterative and recursive versions of the binary search algorithm. Discuss the time complexities of linear and binary search. [2+4+2]",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 202",
    "question": "Counting the steps of the following algorithm, generate a time complexity (in Big-O notation) of the given algorithm. [4]\nAlgorithm fun(A) Input: An array A storing $n \\geq 1$ integers Output: The sum of the prefix sums in A $s \\gets 0$ for $i \\gets 1$ to $n - 1$ do $s \\gets s + A[0]$ for $j \\gets 1$ to $i$ do $s \\gets s + A[j]$\nreturn s",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Write the algorithm of evaluating postfix expression using stack? Demonstrate your algorithm by evaluating the postfix expression $7 \\cdot 5 \\cdot 3 + *$ . [2 + 2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Consider an Array based Stack implementation. Write pseudo codes for pop and push operations of Stack. [2+2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "What is singly linked list? Write a remove Duplicates () function which takes a list that is already sorted in increasing order and deletes any duplicate nodes from the list. Ideally, the list should only be traversed once. [1 + 3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Describe an almost complete binary tree? With an example, show that every complete binary tree is a strictly binary tree but vice-versa may not be true. [1+3]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Discuss about the two ways of representing a Graph. What is the adjacency matrix of a following graph. [3+1]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Take an initially empty hash table with five slots, with hash function $h(x) = x \\mod 5$ and with collision resolved by separate chaining. Draw a sketch of what happens when inserting the following sequence of keys into it: 35, 2, 18, 6, 3, 10, 8, 5.\nRepeat the same but with the following three changes: the hash table now has ten slots, the hash function is $h(x) = x \\mod 10$, and collision are resolved by linear probing. [2+2]",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain asymptotic notations. Calculate Big O of the following code. \nint example4(int n) { \n    if (n <= 1) { \n    return n; \n    } \n    return example4(n - 1) + example4(n - 1) + example4(n - 1); \n}",
    "mark": 5,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Implement push and pop operations for a stack. You may provide either an algorithm or C code implementation.",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "(a) Evaluate the given prefix expression using stack. \n$2^2 \\times 32$\n(b) Convert the given infix expression to a postfix expression. \n$a+b*(c^d-e)^(f+g*h)-i$",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 202",
    "question": "Explain the problem of queue overflow in a linear queue even when free space is available and how does a circular queue solve this problem. Mention the advantages of using priority queue over regular queue.",
    "mark": 6,
    "paper_type": "internal",
    "section": "B"
  }
]