[
  {
    "subject": "COMP 102",
    "question": "Define identifier and keywords in C. Explain basic data types supported by C with suitable example.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "List out different types of operators in C. Explain logical and conditional operators with suitable example.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Define formatted input/output in C. Explain different formatted input/output functions available in C with suitable example.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Write a menu driven program to perform basic arithmetic operations such as addition, subtraction, multiplication and subtraction.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Write a program to calculate factorial of a given number using recursive function.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Define storage class in C. Explain different types of storage class in C programming.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Explain the importance of dynamic memory allocation (DMA) with the help of calloc() and malloc() function.",
    "mark": 4,
    "paper_type": "endsem",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Write a program to input name, address, roll, marks and age of 10 students and display the information of students whose age is less than or equal to 20 years in proper format using the structure.\nb. Write a program to count the even and odd numbers in an integer array using pointer. User inputs the required array.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "a. What are the importances of loops in programming?. Explain entry control and exit control loops in C programming with suitable example.\nb. Explain about arguments pass by value and pass by reference with suitable example.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Define multidimensional array. How multidimensional array is declared and initialized? Write a program to multiply two matrices using function. User inputs the size of two matrices and if multiplication is possible, the function returns the resulting matrix.",
    "mark": 8,
    "paper_type": "endsem",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Explain the basic structure of a C program.",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "What are derived data types? Explain bitwise-operator.",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Differentiate break and continue statement. Write the purpose of the default keyword used in switch case with syntax?",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Write a program to check whether the given number is an armstrong number or not.",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "Write a program to find the Greatest Common Divisor (GCD) of two numbers.\nHint: The HCF or GCD of two integers is the largest integer that can exactly divide both numbers (without a remainder).",
    "mark": 4,
    "paper_type": "internal",
    "section": "B"
  },
  {
    "subject": "COMP 102",
    "question": "What do you mean by identifiers? Write down rules for identifiers.",
    "mark": 3,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Illustrate the purpose of operator precedence and associativity. What is the effect of the presence of parentheses in expressions?",
    "mark": 4,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Write a program to compute and display the sum of all integers between the two given numbers (e.g. 0 and 100) that are divisible by 6 but not by 4.",
    "mark": 3,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Write a C program to input electricity unit charges and calculate total electricity bill according to the given condition: For first 50 units Rs. 0.50/unit- For next 100 units Rs. 0.75/unit For next 100 units Rs. 1.20/unit For unit above 250 Rs. 1.50/unit An additional surcharge of 20% is added to the bill. (Write a function named calculateElectricityBill() which takes necessary inputs as parameters and returns the calculated bill amount to the calling function.)",
    "mark": 6,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Differentiate between while loop and do-while loop. What are the different sections of a for statement? Explain.",
    "mark": 4,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "What are the different types of data types in C? How do you declare variables?",
    "mark": 3,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Write a C program to calculate the product of all even numbers that are not divisible by 5 between 1 and n. (Assume n > 1.)",
    "mark": 3,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "Write a C program to calculate the total cost of movie tickets purchased based on the following rules: For the first 3 tickets: Rs. 450/ticket. For the next 2 tickets (4th and 5th): Rs. 350/ticket. For tickets above 5: Rs. 250/ticket. Additionally, add a convenience fee of 5% to the total ticket cost.\n(Write a function named calculateTicketPricing() which takes necessary inputs as parameters and returns the calculated pricing to the calling function.)",
    "mark": 6,
    "paper_type": "internal",
    "section": "C"
  },
  {
    "subject": "COMP 102",
    "question": "What are the similarities and differences between the for loop and the while loop? What is the purpose of the continue statement in loops? How does it differ from the break statement?",
    "mark": 4,
    "paper_type": "internal",
    "section": "C"
  }
]