[
  {
    "subject": "EDRG 102",
    "question": "Figure 1 shows a pictorial view of an Object. Draw: a) Front View b) Top view and c) Sectional Right Side View (First Angle Projection)",
    "mark": 5,
    "paper_type": "internal",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Pictorial view of an object is shown in figure 2. Draw its Front View, Top View and left side view by using Third Angle Projection System.",
    "mark": 5,
    "paper_type": "internal",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Figure below shows front and top view of an object. Draw its isometric view.",
    "mark": 5,
    "paper_type": "internal",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Draw the 3 principal views of a hexagonal nut and square bolt assembly. Orient the fasteners such that the 3 rectangular faces of the nut and 2 rectangular faces of the bolt are visible in the front view. The bolt is 24 mm diameter, 120 mm long and thread length of 60 mm. indicate the necessary calculations, and provide all dimensions.",
    "mark": 5,
    "paper_type": "internal",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Draw multi views of the following object with front view indicated by arrow.",
    "mark": 12,
    "paper_type": "endsem",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Draw isometric view of the following object.",
    "mark": 12,
    "paper_type": "endsem",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Draw three views of a threaded hexagonal nut of $24 \\mathrm{mm}$ diameter. Indicate all dimensions and empirical proportions. Formula sheet is attached.",
    "mark": 12,
    "paper_type": "endsem",
    "section": "C",
    "semester": 2,
    "family": "design"
  },
  {
    "subject": "EDRG 102",
    "question": "Draw top view and sectional front view of a double riveted lap joint with zigzag riveting. The thickness of the plates is $5 \\mathrm{mm}$ . Indicate all dimensions and empirical proportions. Formula sheet is attached.",
    "mark": 12,
    "paper_type": "endsem",
    "section": "C",
    "semester": 2,
    "family": "design"
  }
]